{
    "2024-09-06": {
        "article0": {
            "headline": "Mark Cuban offers to serve in the Harris White House",
            "text": "Mark Cuban called Kamala Harris \"pro-business\" in an interview on Thursday.\n\nHe said he talked to her team regularly and told them to \"put my name in for the SEC.\"\n\nCuban praised Harris' desire to lower Biden's proposed capital-gains tax to 28% from nearly 40%.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Go to newsletter preferences Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nMark Cuban, the billionaire investor and owner of the Dallas Mavericks, volunteered himself for a key position in Kamala Harris' administration should she defeat Donald Trump in November.\n\nSpeaking on CNBC's show \"Squawk Box\" on Thursday, Cuban praised the Harris campaign as having open, consistent communication with business leaders. He said he talked to her team three or four times a week and added that, compared with prior administrations, hers had been the \"most open.\"\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in ."
        },
        "article1": {
            "headline": "A historian who's correctly predicted 9 out of 10 elections says Kamala Harris will win in 2024",
            "text": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nThanks for signing up! Go to newsletter preferences\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nVice President Kamala Harris will beat former President Donald Trump this November, says the historian who successfully predicted nine out of 10 presidential elections since 1984.\n\n\"Kamala Harris will be the next president of the United States, at least that's my prediction for the outcome of this race,\" Allan Lichtman, a presidential historian at American University, told The New York Times in a video interview that aired on Thursday.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nLichtman, whose \"Keys to the White House\" prediction model consists of 13 true-or-false questions, said in the interview that eight keys were in Harris' favor.\n\nTrump, Lichtman said, had three keys going for him — one, Harris isn't an incumbent; two, Harris isn't, in his opinion, a \"once-in-a-generational, broadly inspirational candidate\"; and three, the Democratic Party lost control of the House during the midterm elections in 2022.\n\nAdvertisement\n\nBut that was outnumbered by eight other keys.\n\nBesides benefiting from the positive short- and long-term economic conditions as well as legislative accomplishments under President Joe Biden's administration, Harris' candidacy wasn't dogged by any scandals or ongoing social unrest, Lichtman said.\n\nIn addition, Harris did not have to go through a primary contest to succeed Biden as nominee, he added. Lichtman said that it helped that she was facing off against Trump, who \"only appeals to a narrow base.\"\n\nHarris, he said, also didn't have a third-party challenger since Robert F. Kennedy Jr. suspended his campaign last month.\n\nAdvertisement\n\nThe last two keys — on foreign policy failures and successes — wouldn't matter as much since Trump would still only have five keys even if they were against Harris, Lichtman said.\n\nLichtman's assessment marks a slight shift from his last prediction in July when he told The Wall Street Journal that the Democratic Party should stick with Biden if they wanted to retain the White House.\n\n\"Biden running checks off two keys right. Biden steps aside, they lose obviously the incumbency, and it's not at all clear that there wouldn't be a big party fight,\" he said then.\n\nAlthough Biden did eventually drop out, Harris was able to avert a primary contest. Besides securing Biden's endorsement, Harris was able to get her party to unite around her in short order.\n\nAdvertisement\n\nTo be sure, Lichtman's predictions haven't always been on the money. He got the 2000 election wrong when he predicted a victory for Al Gore instead of the eventual winner, George W. Bush.\n\nThat's been the only election outcome Lichtman got wrong since he started giving predictions in the 1984 election.\n\nRepresentatives for the Harris campaign didn't immediately respond to requests for comment from Business Insider sent outside regular business hours."
        },
        "article2": {
            "headline": "Donald Trump Says Elon Musk Will Lead ‘Government Efficiency’ Task Force",
            "text": "Donald Trump has made it known that, if elected again, he will create a “government efficiency” commission to audit the federal government—an idea that was notably spawned by his pal (and, more recently, funder and unofficial campaign administrator), billionaire jackass Elon Musk. Lord help us.\n\nTrump made the remarks Thursday during a campaign stop at the New York Economic Club. “At the suggestion of Elon Musk, who has given me his complete and total endorsement…I will create a government efficiency commission tasked with conducting a complete financial and performance audit of the entire federal government,” Trump said. “Elon has agreed to head the task force,” Trump added while noting that the task force would be responsible for “making recommendations for drastic reforms” to the government.\n\nMusk, who originally mentioned the commission during a podcast appearance last month, made it known that he would jump at the opportunity to take the job that he made up. “I’d be happy to help out on such a commission,” he said Thursday on X. “I look forward to serving America if the opportunity arises. No pay, no title, no recognition is needed.” Later, Musk tweeted: “This would unlock tremendous prosperity for America.”\n\nThe Journal was quick to note that such a position could represent a conflict of interest. Given the fact that multiple Musk-owned companies are currently under investigation by federal agencies, what’s to stop Elon from using his “efficiency” commission to argue that the SEC (which is currently probing his takeover of Twitter) is “inefficient” and needs gutting? Indeed, handing Musk such a role gives him the perfect bureaucratic vantage point to target his enemies in government. In the past, Musk has also raged against America’s National Labor Relations Board, the agency tasked with protecting America’s workers from people like Musk. It isn’t hard to imagine that it could also be on the chopping block.\n\nIn general, Musk’s commission sounds in line with the rest of Trump’s plans for a second presidency, the likes of which would likely be a windfall for America’s plutocrats and a complete disaster for everybody else.\n\nLike their rightwing backers, Trump and his cronies have made a lot of noise about the need for “government efficiency” and federal spendthrift. However, voters would do well to remember that, during his first administration, Trump was hardly the picture of “efficiency.” Indeed, he caused one of the single biggest increases in the national debt in our nation’s history (the only apparent exceptions being George W. Bush and Abraham Lincoln). Trump added to the debt substantially when he pointlessly gave huge tax breaks to America’s richest people, like Musk. Notably, some estimates say Trump ran the national debt up twice as much as Biden. Furthermore, analysis of Trump’s new economic plan shows it would add as much as $4 trillion to the national deficit over the course of the next decade—substantially more than Kamala Harris’ plan.\n\nPerhaps to distract from the fact that their economic designs are basically just an Oprah-style giveaway to America’s plutocratic elite, Donald Trump and his allies (including Musk) have resorted to a rather pathetic attempt to cast Kamala Harris—a wealthy former prosecutor who is married to a corporate lawyer—as a “communist.” Trump has spewed a near-constant stream of vitriol at Harris, repeatedly referring to her as “Comrade Kamala” and suggesting that the rather tame economic suggestions that her campaign has made in recent weeks would put America on the path to Bolshevism. The implication here seems clear: any attempt to use the government to lessen the impact of corporate predation on everyday people is “communism,” while the path to bureaucratic virtue is paved with privatization and tax giveaways to the rich."
        },
        "article3": {
            "headline": "Doug Emhoff says he's never won a debate against Kamala Harris",
            "text": "Vice President Kamala Harris and second gentleman Doug Emhoff have been married for 10 years.\n\nBoth were high-powered lawyers — Harris was attorney general and Emhoff worked in entertainment law.\n\nIn an interview with \"Pod Save America,\" Emhoff said he's never won a debate against Harris.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Go to newsletter preferences Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nVice President Kamala Harris and her husband, second gentleman Doug Emhoff, were both accomplished lawyers before entering politics, and Emhoff shared in a new interview with \"Pod Save America\" that their debates as a couple can be reminiscent of a courtroom.\n\nOn an episode released Thursday, \"Pod Save America\" cohost Tommy Vietor asked Emhoff about the upcoming presidential debate between Harris and former President Donald Trump.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in ."
        },
        "article4": {
            "headline": "James Murdoch and 87 other corporate leaders sign a letter endorsing Kamala Harris",
            "text": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nDozens of prominent Wall Street and tech executives combined forces on Friday morning to support Kamala Harris' bid for the White House. Eighty-eight top executives signed a joint letter endorsing the vice president, CNBC reported.\n\nThe signatories span political engagement, from longtime Democratic donors to people issuing their first public endorsement of Harris. James Murdoch, the former CEO of 21st Century Fox, broke even further away from his father by adding his name to the list.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThough the list of signatories is lengthy, the letter itself is a mere five sentences. Electing Harris is, the executives wrote, \"the best way to support the continued strength, security, and reliability of our democracy and economy.\" They celebrated her record support of small businesses and said she would \"continue to advance fair and predictable policies that support the rule of law, stability, and a sound business environment.\"\n\nCurrent executives include Aaron Levie of Box and Jeremy Stoppelman of Yelp, as well as big names in the sports world. The NBA Hall of Famer and billionaire Magic Johnson signed on, so did Ted Leonsis, whose company owns the NBA's Washington Wizards and WNBA's Washington Mystics.\n\nAdvertisement\n\nSome signatories, such as Murdoch and the Ripple Labs cofounder Chris Larsen, declared their support for Harris for the first time.\n\n\"Proud to support the Harris campaign — she's the right leader for our fast-changing world,\" Larsen told Business Insider in a statement. \"And I'm confident that she will reset the misguided Biden policies that were too anti-business and anti-innovation. At the same time, I'm confident she will maintain Biden's strong leadership on our energy transition.\"\n\nRelated stories\n\nLarsen added that he recently donated $1 million in crypto to Future Forward, a PAC supporting Harris.\n\nOther signatories have long rallied behind the vice president. Many know her from her days in California politics, which reflects how Harris is relying on her home state for support, financial and otherwise. The veteran Harris supporters include the philanthropist Laurene Powell Jobs and the Facebook cofounder Dustin Moskovitz.\n\nAdvertisement\n\nBoth coasts are well represented, with executives from Silicon Valley and Wall Street alike joining the effort. The angel investor Ron Conway, the entrepreneur Mark Cuban, and the LinkedIn cofounder Reid Hoffman are among the biggest West Coast names, while former Blackstone President and CEO Tony James and the former Goldman Sachs executive Bruce Heyman hail from the world of New York finance.\n\nFormer executives at various prominent companies — including PepsiCo, Paramount, Lyft, and Starbucks — also signed on to endorse Harris.\n\nThe support from the business community comes at a crucial time, as both Harris and Trump are laying out their economic agendas ahead of Tuesday's debate. Both candidates are presenting themselves as the pro-business option while attempting to woo the financial and tech sectors.\n\nCorrection: September 6, 2024 — An earlier version of this story misdescribed Harris. She is the current US vice president, not a former vice president."
        },
        "article5": {
            "headline": "Liz Cheney Endorses Kamala Harris",
            "text": "Former Representative Liz Cheney, whose steady rise in the Republican Party ended when she opposed Donald Trump, said Wednesday that she’d vote for his Democratic opponent in the November election.\n\n“As a conservative and someone who believes in and cares deeply about the Constitution, I have thought deeply about this. And because of the danger that Donald Trump poses—not only am I not voting for Donald Trump, but I will be voting for Kamala Harris,” Cheney said Wednesday at a Sanford School of Public Policy event at Duke University in North Carolina.\n\nCheney, a daughter of former Vice President Dick Cheney, served as vice chair—and was one of only two Republicans—on the House committee that investigated the insurrection on Jan. 6, 2021, and Trump’s efforts to change the result of the 2020 presidential election.\n\nJeremy Adler, a Cheney spokesman, confirmed her statement.\n\nElected to a House seat in Wyoming in 2016, she was defeated by a primary challenger backed by Trump in 2022. More than a year earlier, in May 2021, she had been ousted by fellow Republicans from the third-ranking House GOP leadership post of conference chair.\n\nResentment against her arose after she became one of 10 House Republicans who voted to impeach Trump over allegations that he incited the assault on the U.S. Capitol.\n\nJen O’Malley Dillon, the chairwoman of Harris’ campaign, said in a statement on Wednesday night that the vice president was “proud to have earned Congresswoman Cheney’s vote. She is a patriot who loves this country and puts our democracy and our Constitution first.”"
        },
        "article6": {
            "headline": "Which high-profile Republican says they are voting for Harris? Find out in the quiz",
            "text": "Which Republican says they are voting for Harris? Find out in the quiz Queens of the chart, field and Maori adorn the quiz this week, and we also address seasonal topics like memoirs and TV shows. Enjoy it while you can!"
        },
        "article7": {
            "headline": "Could AI and Deepfakes Sway the US Election?",
            "text": "A few months ago, everyone was worried about how AI would impact the 2024 election. It seems like some of the angst has dissipated, but political deepfakes—including pornographic images and video—are still everywhere. Today on the show, WIRED reporters Vittoria Elliott and Will Knight talk about what has changed with AI and what we should worry about.\n\nLeah Feiger is @LeahFeiger. Vittoria Elliott is @telliotter. Will Knight is @willknight. Or you can write to us at politicslab@WIRED.com. Be sure to subscribe to the WIRED Politics Lab newsletter here.\n\nMentioned this week:\n\nOpenAI Is Testing Its Powers of Persuasion, by Will Knight\n\nAI-Fakes Detection Is Failing Voters in the Global South, by Vittoria Elliott\n\n2024 Is the Year of the Generative AI Election, by Vittoria Elliott\n\nHow to Listen\n\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\n\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts, and search for WIRED Politics Lab. We’re on Spotify too.\n\nTranscript\n\nNote: This is an automated transcript, which may contain errors.\n\nLeah Feiger: This is WIRED Politics Lab, a show about how tech is changing politics. I'm Leah Feiger, the senior politics editor at WIRED. A few months ago, a lot of people were concerned about how artificial intelligence might affect the 2024 US election. AI-generated images, audio, and video had just gotten so good and was so easy to make and spread. The WIRED politics team in our project tracking the use of AI in elections around the world actually called 2024 the year of the generative AI election. Lately, it seems like some of the panic around AI has subsided, but deepfakes of Kamala Harris, Joe Biden, Donald Trump, and other politicians and their supporters are everywhere. And as we'll talk about today, legislation on political deepfakes, including AI-generated pornography, is really tricky. So with the election looming, what has changed, if anything, and how much should we really be worrying about AI? Joining me to talk about all of this are two of WIRED's AI experts. We have politics reporter Vittoria Elliott—\n\nVittoria Elliott: Hi, Leah.\n\nLeah Feiger: Hey, Tori. And from Cambridge, Massachusetts, senior writer Will Knight. Will, thank you so much for coming on. It's your first time here.\n\nWill Knight: Yep. Hello. Thank you for having me.\n\nLeah Feiger: So let's start with porn, if that's OK. Tori, you have a big article out today all about US states tackling the issue of AI-generated porn. Tell us about it. How are people handling this?\n\nVittoria Elliott: It's actually really piecemeal, and that's because on a fundamental level, we don't have national regulation on this. Congresswoman Alexandria Ocasio-Cortez, who was herself the target of nonconsensual deepfake porn this year, has introduced the Defiance Act, which would allow victims to sue the people who create and share nonconsensual deepfake porn as long as they can show that the images or videos were made nonconsensually. And then Senator Ted Cruz also has a bill called the Take It Down Act that would let people force platforms to remove those images and videos. But there hasn't really been major movement on these in several months, and this issue has gotten a lot of attention, particularly because we've seen the spate of young people, of middle and high schoolers, using generative AI technology to bully their peers, to make explicit images and videos of their peers. And we obviously have data that shows that while generative AI is maybe still being used in politics, and we definitely have a ton of examples where it is, mostly it's used to target and harass and intimidate women."
        },
        "article8": {
            "headline": "JD Vance says he doesn't like that school shootings are 'a fact of life'",
            "text": "Vice presidential nominee Sen. JD Vance said he didn't like that school shootings are \"a fact of life.\"\n\nHe made the comments in response to a Wednesday shooting at a Georgia high school that left four dead.\n\nVance suggested that increased security at schools could help address the problem.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Go to newsletter preferences Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nRepublican vice presidential nominee Sen. JD Vance called for more security while saying that he didn't like that school shootings are a \"fact of life\" during a Thursday rally.\n\nVance's comments come one day after a 14-year-old suspect opened fire at a Georgia high school in a rampage that left two teachers and two students dead.\n\n\"If these psychos are going to go after our kids, we've got to be prepared for it,\" Vance said, according to The Associated Press. \"We don't have to like the reality that we live in, but it is the reality we live in.\"\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in ."
        },
        "article9": {
            "headline": "Don’t Underestimate Kamala Harris’ Good Vibes Only Campaign",
            "text": "Kamala Harris’ presidential run against Donald Trump is nearing its final act. And while Trump has repeatedly threatened to undermine democracy and leveled vicious personal attacks against her, throughout the campaign so far, the public seen never seen Harris get mad—in fact, she’s full of joy. Her campaign is playfully tapping into the latest social media trends and memes. And rather than complaining and insulting people like Donald Trump, she’s laughing and smiling on the campaign trail. “The thing we like about hard work is we have fun doing hard work,” she told autoworkers in Michigan.\n\nPundits have largely interpreted this as a classic expression of Black joy—a form of incredible resilience in the face of the ugly challenges Black people have long faced in the U.S.—or complained that joy can’t substitute for smart policies (true).\n\nBut Harris’ campaign has never suggested joy is a policy. It’s a political strategy, and we’re radically underestimating just how smart it is. Adopting a joyful approach has simultaneously highlighted Trump’s biggest weaknesses (his age and cantankerousness), taken the spotlight off him and possibly endeared Harris to the majority of Americans who’ve had enough of our country’s uncivilized politics. It has also deprived Trump of the easiest line of attack he’d otherwise have against Harris—the same attack that Trump had against democratic candidate Hillary Clinton in 2016: the contention that she’s crazy. Expressing rage would allow him to portray Harris as such.\n\n“When a man becomes angry in an argument or debate, people are more likely to abandon their own positions and defer to his,” Soraya Chemaly writes in Rage Becomes Her: The Power of Women’s Anger. “But when a woman acts the same way, she’s likely to elicit the opposite response.”\n\nIt’s not just that people wouldn’t believe Harris if she appeared angry. Women candidates often have to walk a tightrope to appear presidential without displaying characteristics that the public accepts without question from men in the public eye. “Male candidates are allowed to yell, to be ‘passionate’ and volatile. It’s a mark of their dedication,” Gemma Hartley writes in FED UP: Emotional Labor, Women, and the Way Forward.” But, for a woman, “tipping anywhere near yelling means being labeled ‘shrill,’ and America has a serious problem with shrill women. Assertiveness turns from a leadership trait to a sign of instability when it is a woman on stage.”\n\nAs a Black woman, Harris is especially vulnerable. From early childhood, the behavior of Black women in the U.S. has historically been carefully policed for any perceived expression of dissatisfaction. For example, Black girls are 5.5 times more likely than white girls to be suspended from school, according to the National Women’s Law Center. And when Black women do try to share their concerns, they’re often simply ignored or written off as “too difficult.”\n\nBut eschewing anger isn’t just protecting Harris from political risks. It’s highlighting one of her biggest strengths: the enthusiasm with which her campaign has quickly been met.\n\nRead More: The Reintroduction of Kamala Harris\n\nWhat’s more, something feels fresh and youthful about the way Harris laughs and has fun on the campaign trail. Without lobbing a single insult, it paints a massive contrast with Trump’s two biggest weaknesses: he’s an angry septuagenarian.\n\nThe majority of people in the U.S. – 62%, to be exact– think Trump is too old to be president, according to a February ABC News/IPSOS poll. We’re also tired of our country’s ugly politics – literally. Some 65% of Americans always or often feel exhausted when we think about politics, according to a 2023 Pew Research Center survey.\n\nHarris’ refusal to rebut Trump’s mean insults and inaccurate claims – most famously, when she was asked in a CNN interview about Trump’s contention that she isn’t Black and responded that he was using the “same old tired playbook” before asking for the next question—is likely to appeal to voters who want more civility in our politics.\n\nThis approach is also undermining one of Trump’s main strategies on the campaign trail and as president: picking arguments with people. “It has long been clear that no spectacle is more absorbing than a fight,” Tim Wu wrote in The Attention Merchants: The Epic Scramble to Get Inside our Heads, which is why one of Trump’s signature strategies has been “continuous warfare.”\n\nBy not responding to his attacks, Harris isn’t participating in the spectacle. That’s had the effect of taking a lot of media attention off Trump—one of the most devastating things she could do to him personally and politically. Recall that the continuous coverage the media gave Trump’s 2016 presidential campaign—largely because his unorthodox tactics made for good entertainment—is one of the major things that helped him win that election. But this year, Harris is getting plenty of media attention of her own.\n\nOf course, joy isn’t why voters should cast their ballots for Harris—they should be examining her policies, which she’s continuing to roll out on the trail and which are already having an impact on voters. (For example, low income voters now significantly favor Harris over Trump – a huge change from June, when they favored Biden by a mere 3 percentage points, according to a USA TODAY/Suffolk University poll released this week.) But this campaign tactic is making Harris a more formidable political candidate—and signaling to voters that she’ll go about getting things done in new, strategic ways."
        },
        "article10": {
            "headline": "Exclusive: Florida U.S. Senate challenger launches WhatsApp channel to reach voters",
            "text": "Democrats launch text message campaign in Florida Senate race to reach Latino voters\n\ntoggle caption Joe Raedle/Getty Images\n\nDebbie Mucarsel-Powell, the former U.S. House Democrat now challenging Florida Republican Sen. Rick Scott for the Senate, has launched a new campaign on WhatsApp to reach voters and attack a sea of disinformation.\n\nThe direct messaging operation is part of a broader attempt to close the gap in a race that has grown increasingly tight. Democrats face an uphill battle undoing Republican gains in the state in recent years, particularly in an election where former President Trump is expected to add to GOP turnout in the state. However, Democrats think they can move the needle, particularly with Latino voters, through smartphones.\n\nSponsor Message\n\n“It's particularly created to target Latino voters across the state to provide them with accurate, factual information coming straight from the source,” Mucarsel-Powell, the sole Latina candidate running for U.S. Senate this year, told NPR.\n\nThe Scott campaign did not immediately respond to a request for comment.\n\nThe messaging campaign includes two channels on the messaging platform WhatsApp — one in English and another in Spanish.\n\nThe effort also coincides with a similar launch by the presidential campaign of Vice President Kamala Harris, which now has its own bilingual channel to reach Latino voters. In their case, the Harris campaign said it was a first-of-its kind in a presidential contest.\n\nThe encrypted platform is a free messaging app that is particularly popular among immigrants, and especially Latinos, to communicate through texts and calls domestically and internationally. With campaigns increasingly looking to use the app, they hope their network will grow with voters as updates are shared by users.\n\nMucarsel-Powell argues WhatsApp will let her directly reach Florida’s Hispanic community, often a target of disinformation. A Pew Research report found 46% of Hispanic Americans use the messaging program compared to a quarter of Americans. It’s used by 23% of Black Americans and 16% of white Americans, the group found.\n\nSponsor Message\n\n“It's very easy to forward, and it's actually one of the reasons why there's been so much disinformation, because of that easy feature, the easy forwarding feature,” Mucarsel-Powell said. “And so we wanted to have our own channels to allow our own supporters to just forward the contact to their networks across the state.”\n\nMucarsel-Powell is Democrats’ first Spanish-speaking candidate for U.S. Senate in Florida. And the WhatsApp effort is part of an overall campaign strategy to reach Latino voters who sat out previous elections, which includes dozens of English and Spanish language campaign events so far as well as ads in both languages.\n\nBOLD PAC, the campaign arm of the Congressional Hispanic Caucus, has identified the Florida Senate race as a top target to address disinformation and reach Latino voters. In the last presidential election in 2020, Mucarsel-Powell and others raised alarm with congressional members over misinformation on WhatsApp and Facebook that was reaching voters.\n\nDemocrats have long argued that Republicans have helped spread misinformation through their campaigns, while Republicans have argued the opposite.\n\nMucarsel-Powell’s campaign faces a tough challenge trying to unseat Scott, the first-term senator now seeking re-election after previously serving as Florida governor.\n\nNow the home state Republican presidential nominee and former President Donald Trump, Florida has largely turned red in recent years. However, Democrats argue their voters have been energized by the Harris presidential campaign and national issues, such as abortion access, which will be on Florida's November ballot."
        },
        "article11": {
            "headline": "Hackers Threaten to Release Stolen Data From Planned Parenthood of Montana",
            "text": "Planned Parenthood of Montana announced on Wednesday a “cybersecurity incident” that was first identified on August 28, according to a new report from Cyberscoop. The healthcare organization had roughly 93 gigabytes of data stolen by hackers affiliated with RansomHub, who are reportedly giving Planned Parenthood until September 11 to pay an undisclosed amount or have all of the data leaked online.\n\nMartha Fuller, the CEO of Planned Parenthood of Montana, said in a statement to EM360Tech that the organization “immediately implemented our incident response protocols, including taking portions of our network offline as a proactive security measure.”\n\nIt’s not immediately clear what kind of data has been stolen and it’s unknown whether patient files have been impacted. Planned Parenthood offers a wide range of health services, but mainstream American perceptions typically associate the organization only with providing abortion care. Whatever is ultimately leaked, if that does come to pass, will almost certainly become a political football in today’s highly politicized environment.\n\nStarted in February 2024, RansomHub works under a “ransomware-as-a-service” model, encrypting and exfiltrating data from at least 210 known victims, according to the Cybersecurity and Infrastructure Security Agency (CISA). Those 2010 victims have been in some of the most sensitive areas of national infrastructure and anything else that helps society run smoothly, according to the CISA, including, “water and wastewater, information technology, government services and facilities, healthcare and public health, emergency services, food and agriculture, financial services, commercial facilities, critical manufacturing, transportation, and communications critical infrastructure sectors.”\n\nPlanned Parenthood acknowledged the existence of the claims by RansomHub that it hacked the healthcare group but didn’t confirm or deny RansomHub was actually behind the attack.\n\n“We are aware of the RansomHub post, and want to assure our community that we are taking this matter very seriously,” Fuller said. “We have reported this incident to federal law enforcement, and will support their investigation.”\n\nAbortion is a vitally important issue in American life, especially after the U.S. Supreme Court decided in 2022 to overturn 50 years of legal precedent by abolishing the federal right to an abortion recognized in Roe v. Wade. The Dobbs decision has been a disaster for human rights in the U.S. and many Americans are understandably upset about having their rights stripped of them.\n\nAnd it’s for that reason many political pundits believe abortion will be a key factor in this November’s election. After all, former president Donald Trump was instrumental in taking away those rights by appointing three Supreme Court justices with views completely outside the mainstream. Trump is currently trailing his Democratic opponent Kamala Harris, who notably supports abortion rights, in the key battleground states that will decide the election.\n\nPlanned Parenthood said on Wednesday that the group is working to restore its systems but there’s no timeline on when that may happen.\n\n“We are grateful to our IT staff and cyber security partners, who are working around the clock to securely restore impacted systems as quickly as possible, and who are tirelessly investigating the cause and scope of the incident,” Fuller said. “That investigation is ongoing.”\n\nPlanned Parenthood of Montana didn’t immediately respond to questions sent Thursday. Gizmodo will update this post when we hear back."
        },
        "article12": {
            "headline": "Harris-Trump ABC News presidential debate: How to watch, what to know",
            "text": "Harris-Trump ABC News presidential debate: How to watch, what to know\n\nPresident Donald Trump and Vice President Kamala Harris are set to face off in their first debate of the 2024 election next week, moderated by ABC News.\n\nWith only weeks until Election Day, the debate is a crucial opportunity for both candidates to work to sway undecided voters in what's expected to be a close contest.\n\nThe debate is a chance for Harris -- who became the Democratic candidate after President Joe Biden left the race following his lackluster June debate performance -- and Trump to explain their policies on key issues. It’s the first time the pair will meet in person.\n\nLikewise, the debate is Trump's first opportunity to attack Harris while laying out some of his own positions.\n\nHere's what to know about the debate and how to tune in.\n\nVice President Kamala Harris, Former President Donald Trump. Marco Bello/Reuters, Jeenah Moon\n\nHow to watch or livestream the debate\n\nThere are several ways to watch the ABC News presidential debate, which is being produced in conjunction with the ABC-owned Philadelphia news station WPVI-TV.\n\nIt will air on ABC and stream on ABC News Live, Disney+ and Hulu. Viewers can also stream the debate on the ABC app on a smartphone or tablet, on ABC.com and connected devices.\n\nABC News Digital and 538 will live blog the latest from the debate stage as it happens and provide analysis, fact checks and coverage of the biggest takeaways from the night.\n\n\\Former president Donald Trump and President Joe Biden participate in the first presidential debate of the 2024 elections at CNN's studios in Atlanta, GA, June 27, 2024. Jabin Botsford/The Washington Post via Getty Images\n\nWhen and where is the presidential debate?\n\nThe debate will take place in Philadelphia at the National Constitution Center on Tuesday, Sept. 10, at 9 p.m. EDT.\n\nVice President Kamala Harris speaks at North Western High School in Detroit, Mich., Sep. 2, 2024. Brendan McDermid/Reuters\n\nWho is moderating the ABC News presidential debate?\n\n\"World News Tonight\" anchor and managing editor David Muir and ABC News Live \"Prime\" anchor Linsey Davis will serve as moderators.\n\nThe prime-time pre-debate special, \"Race for the White House,\" will be anchored by chief global affairs correspondent and \"This Week\" co-anchor Martha Raddatz, chief Washington correspondent and \"This Week\" co-anchor Jonathan Karl, chief White House correspondent Mary Bruce and senior congressional correspondent Rachel Scott. It will air at 8 p.m. EDT and stream on ABC's platforms.\n\nWhat are the ground rules?\n\nBoth Harris and Trump accepted the debate rules, which include that their microphones will be muted when the time belongs to another candidate.\n\nThe agreed-upon rules include:"
        },
        "article13": {
            "headline": "Former Republican Vice President Dick Cheney to vote for Harris, Liz Cheney says",
            "text": "He said Trump \"can never be trusted with power again.\"\n\nFormer Vice President Dick Cheney, one of the most prominent Republicans in the last half-century, announced Friday will be crossing party lines this election and voting for Vice President Kamala Harris, contending former President Donald Trump \"can never be trusted with power again.\"\n\n\"In our nation’s 248-year history, there has never been an individual who is a greater threat to our republic than Donald Trump. He tried to steal the last election using lies and violence to keep himself in power after the voters had rejected him,\" he said in a statement.\n\n\"As citizens, we each have a duty to put country above partisanship to defend our Constitution. That is why I will be casting my vote for Vice President Kamala Harris.\"\n\nFormer Vice President Dick Cheney speaks at the Sunshine Summit opening dinner, Nov. 12, 2015, in Orlando, Fla. Tom Benite/Pool/Getty Images\n\nCheney released his statement hours after his daughter, former Wyoming GOP Rep. Liz Cheney, revealed his intentions. She told \"The Atlantic\" magazine's Mark Leibovich in an interview at the Texas Tribute Festival that her father believes this is a serious moment in history.\n\n\"My dad believes -- and he said publicly -- that there's never been an individual in our country who is as grave a threat to our democracy as Donald Trump is, and that's, that's the moment that we're facing,\" she said.\n\nTune in to \"This Week\" on Sunday, Sept. 8, where co-anchor Jonathan Karl will have an exclusive interview with Liz Cheney.\n\nBoth Cheneys have been open about their criticism of Trump following the Jan. 6 attack on the U.S. Capitol by a pro-Trump mob.\n\nEarlier in the week, Liz Cheney said she was going to vote for Harris.\n\nShe lost her seat in the 2022 primary to Trump-backed Harriet Hageman by more than 60,000 votes, according to election results.\n\nRep. Liz Cheney arrives, with her father, former Vice President Dick Cheney, to vote at the Teton County Library during the Republican primary election, Aug 16, 2022, in Jackson Hole, Wyo. Jabin Botsford/The Washington Post via Getty Images\n\nCheney made news on another front during her remarks at the festival and said she would support incumbent Texas Sen. Ted Cruz's Democratic challenger Rep. Colin Allred ahead of November. She said that one of the most important things to do to \"rebuild our politics is we need to elect serious people.\"\n\n\"You know, there aren't enough good candidates running. I want to say specifically, though, here in Texas, you guys do have a tremendous, serious candidate running for the United States Senate, and his name is ...\" Cheney began before being interrupted by an applause \"Well, it's not Ted Cruz,\" she said.\n\n\"Colin Allred is somebody I served with in the House ... When you think about the kind of leaders our country needs, and going to this point about [how] you might not agree on every policy position, but we need people who are going to serve in good faith. We need people who are honorable public servants and in this race that is Colin Allred, so I'll be working on his behalf,\" she continued.\n\nAt the same time, Liz Cheney however has been critical of Democratic vice presidential candidate Gov. Tim Walz over recent comments he gave about the Israel-Gaza conflict.\n\nWalz told Michigan public radio WCMU reporters on Thursday that Israel had the right to defend itself and condemned the Oct. 7 Hamas terrorist attack.\n\nWalz then shifted focus to the humanitarian condition in Gaza, saying \"the Palestinian people have every right to life and liberty themselves.\"\n\n\"We need to continue, I think, to put the leverage on to make sure we move towards a two-state solution,\" Walz said. \"I think we're at a critical point right now. We need the Netanyahu government to start moving in that direction.\"\n\nWalz added that pro-Palestinian protesters in Michigan were \"speaking out for all the right reasons.\n\n\"It's a humanitarian crisis. It can't stand the way it is,\" he said.\n\nFormer Rep. Liz Cheney speaks during a conversation with Mark Leibovich, a staff writer with the Atlantic, about her new book \"Oath and Honor: A Memoir and a Warning\" during an event, Dec. 13, 2023, in Washington, D.C. Anna Moneymaker/Getty Images\n\nLiz Cheney told Leibovich that she \"disagreed\" with Walz's answer.\n\n\"I do think that that it's very important for us to recognize the extent ... [of] talking about Oct. 7 without mentioning Hamas by name, is not an accurate reflection of the challenges that ... we face and of the attack and the assault on Israel,\" she said.\n\nABC News' Ivan Pereira contributed to this report."
        },
        "article14": {
            "headline": "Trump takes shots at Harris' personality and policies at friendly town hall",
            "text": "'I let him talk, I'm gonna let her talk,' Trump says ahead of ABC News debate\n\nFormer President Donald Trump participated in another town hall Wednesday where he took several shots at his opponent Vice President Kamala Harris' record and continued to throw out falsehoods about her and his record in office in front of a friendly crowd in Harrisburg, Pennsylvania.\n\nAdvisers point to events like this as how Trump is preparing for next week’s ABC News debate in Philadelphia against Vice President Kamala Harris.\n\nThe former president, who often downplays the need for formal debate preparations, did offer some insight into how he will approach sharing the debate stage with Harris, saying he would limit his outbursts during an audience Q &A portion of the event which will air later this week.\n\n“When I had Biden, you and I had the same discussion. And I let him talk. I’m gonna let her talk,” Trump told Fox News host Sean Hannity when asked how he will respond to Harris when she tries to get under his skin.\n\n“There are those who say that Biden is smarter than she is. If that’s the case, we have a problem,” Trump said, attacking Harris’ intelligence earlier by claiming she has “no idea what the hell she’s doing.”\n\n“You can go in with all the strategy you want but you have to sort of feel it out as the debate is taking place,” he said, going on to talk about his multiple debate appearances.\n\n“Everyone has a plan until they get punched in the face” Trump quipped, quoting former boxing champion Mike Tyson.\n\nTrump zeroed in on what he characterized as Harris’ policy inconsistencies, something that advisers have encouraged him to focus on. He specifically highlighted her changed position on fracking in front of a crowd in one of the country’s top fossil fuel-producing states.\n\nFormer US President and Republican presidential candidate Donald Trump (R) takes part in a town hall moderated by Fox News broadcaster Sean Hannity at the New Holland Arena in Harrisburg, Pennsylvania, on September 4, 2024. (Photo by Mandel NGAN / AFP) (Photo by MANDEL NGAN/AFP via Getty Images) Mandel Ngan/AFP via Getty Images\n\n“She wants no fracking. In Pennsylvania, she wants no fracking. She said it 100 times, there will be no fracking. There will be no fracking. There will be no fracking. Then just recently, she said, ‘Yes, I could approve fracking.’” Trump continued, “Look, this is a woman who is dangerous. I don't think it's too smart, let's see.”\n\n“You can't take the chance. You have no choice. You've got to vote for me, even if you don't like me,” he said, arguing that Americans didn’t know enough about Harris.\n\nTrump held a town hall in Wisconsin last week with former Democratic congresswoman and presidential candidate Tulsi Gabbard. Gabbard was recently named to Trump’s presidential transition team and has been advising him during his debate preparations.\n\nWednesday’s town hall, which was taped in the afternoon before airing during Hannity’s regular 9 p.m. ET time slot, comes in lieu of a debate that Fox was attempting to hold tonight. While debate invitations were sent to both candidates, only Trump accepted as Harris campaign officials said future debates are contingent on Trump showing up to the ABC News debate next week.\n\n“I think he's a nice guy,” Trump said, pointing to Hannity. “But I would have preferred a debate.”\n\nThe former president and Hannity repeatedly criticized Harris’ lack of interviews as reasons to argue she’s unfit for office, pushing unfounded claims about her interview with CNN last week. However, while Trump sat down with Hannity for longer than Harris’ CNN interview, it was a friendly hour with the conservative TV host who rarely pushed back or pressed Trump on a number of topics.\n\nTrump was asked to detail the differences between his previous presidential campaigns.\n\n“It's not that different. It's still about the forgotten man and the forgotten woman. People are being treated horribly in this country.”\n\nTrump continued to spread anti-immigrant rhetoric, accusing Venezuelans of “taking over the whole town” in Aurora, Colorado, as he again promised to oversee the largest mass deportation operation in U.S. history.\n\n“Take a look at Aurora. In Colorado, where Venezuelans are taking over the whole town. They're taking over buildings, the whole town…They're knocking down doors and occupying apartments of people. The people are petrified. And it's getting worse and worse,\" Trump said, referring to a viral video that appeared to show an armed mob roaming around an apartment complex in Aurora.\n\nHowever, the Aurora Police Department vehemently denied accusations that the apartment complex is being run by a Venezuelan gang.\n\n“We've been talking to the residents here and learning from them to find out what exactly is going on, and there's definitely a different picture,\" Interim Police Chief Interim Heather Morris said in a Facebook video the department posted last week, while adding, \"I'm not saying that there's not gang members that don't live in this community.\"\n\nThe City of Aurora also provided clarity on the situation in a post on X, saying while there was a concern about a “small” presence of the Venezuelan gang members in Aurora, the city is taking the situation seriously. The city stressed that Aurora is a “safe community” and that reports of gang members are “isolated to a handful of problem properties alone.”\n\nTrump criticized Harris’s rhetoric after Hannity played a 2016 clip of Harris from a speech at a Los Angeles mosque, in which she urged the public not to use terms such as “radical Islamic terrorism” and “illegal alien.”\n\n“She wants to be politically correct, and we can't be politically correct,” Trump responded.\n\n“You need a president that's not going to be taking you into war. We won't have World War III when I'm elected, but with these clowns, you're going to end up having world war – it's going to be a war like no other.”\n\nHannity briefly mentioned at the top of his program the school shooting earlier in the day in Winder, Georgia, where two students and two teachers were killed and nine people were injured. Trump cited Hungary's Prime Minister Viktor Orban to tout his record on crime and national security.\n\n“Well, it's a sick and angry world for a lot of reasons, and we're going to make it better. We're going to heal our world. We're going to get rid of all these wars that are starting all over the place, and we're going to make it better,” Trump said.\n\n“You know, Victor Orban made a statement. They said, ‘Bring Trump back, and we won't have any problems.’ He was very strong about that.”\n\nTrump also took time to defend himself and his running mate, Ohio Sen. JD Vance, against Harris’ running mate Gov. Tim Walz’s argument that they’re “weird.” Trump fired back at that sentiment, poking fun at some of Walz’s quirks.\n\n“Something’s weird with that guy. He's a weird guy. JD is not weird. He's a solid rock. I happen to be a very solid rock,” said Trump. “We're not weird. We're other things, perhaps, but we're not weird. But he is a weird guy.”"
        },
        "article15": {
            "headline": "'I let him talk. I’m gonna let her talk,' Trump says ahead of ABC News debate",
            "text": "'I let him talk, I'm gonna let her talk,' Trump says ahead of ABC News debate\n\nFormer President Donald Trump participated in another town hall Wednesday where he took several shots at his opponent Vice President Kamala Harris' record and continued to throw out falsehoods about her and his record in office in front of a friendly crowd in Harrisburg, Pennsylvania.\n\nAdvisers point to events like this as how Trump is preparing for next week’s ABC News debate in Philadelphia against Vice President Kamala Harris.\n\nThe former president, who often downplays the need for formal debate preparations, did offer some insight into how he will approach sharing the debate stage with Harris, saying he would limit his outbursts during an audience Q &A portion of the event which will air later this week.\n\n“When I had Biden, you and I had the same discussion. And I let him talk. I’m gonna let her talk,” Trump told Fox News host Sean Hannity when asked how he will respond to Harris when she tries to get under his skin.\n\n“There are those who say that Biden is smarter than she is. If that’s the case, we have a problem,” Trump said, attacking Harris’ intelligence earlier by claiming she has “no idea what the hell she’s doing.”\n\n“You can go in with all the strategy you want but you have to sort of feel it out as the debate is taking place,” he said, going on to talk about his multiple debate appearances.\n\n“Everyone has a plan until they get punched in the face” Trump quipped, quoting former boxing champion Mike Tyson.\n\nTrump zeroed in on what he characterized as Harris’ policy inconsistencies, something that advisers have encouraged him to focus on. He specifically highlighted her changed position on fracking in front of a crowd in one of the country’s top fossil fuel-producing states.\n\nFormer US President and Republican presidential candidate Donald Trump (R) takes part in a town hall moderated by Fox News broadcaster Sean Hannity at the New Holland Arena in Harrisburg, Pennsylvania, on September 4, 2024. (Photo by Mandel NGAN / AFP) (Photo by MANDEL NGAN/AFP via Getty Images) Mandel Ngan/AFP via Getty Images\n\n“She wants no fracking. In Pennsylvania, she wants no fracking. She said it 100 times, there will be no fracking. There will be no fracking. There will be no fracking. Then just recently, she said, ‘Yes, I could approve fracking.’” Trump continued, “Look, this is a woman who is dangerous. I don't think it's too smart, let's see.”\n\n“You can't take the chance. You have no choice. You've got to vote for me, even if you don't like me,” he said, arguing that Americans didn’t know enough about Harris.\n\nTrump held a town hall in Wisconsin last week with former Democratic congresswoman and presidential candidate Tulsi Gabbard. Gabbard was recently named to Trump’s presidential transition team and has been advising him during his debate preparations.\n\nWednesday’s town hall, which was taped in the afternoon before airing during Hannity’s regular 9 p.m. ET time slot, comes in lieu of a debate that Fox was attempting to hold tonight. While debate invitations were sent to both candidates, only Trump accepted as Harris campaign officials said future debates are contingent on Trump showing up to the ABC News debate next week.\n\n“I think he's a nice guy,” Trump said, pointing to Hannity. “But I would have preferred a debate.”\n\nThe former president and Hannity repeatedly criticized Harris’ lack of interviews as reasons to argue she’s unfit for office, pushing unfounded claims about her interview with CNN last week. However, while Trump sat down with Hannity for longer than Harris’ CNN interview, it was a friendly hour with the conservative TV host who rarely pushed back or pressed Trump on a number of topics.\n\nTrump was asked to detail the differences between his previous presidential campaigns.\n\n“It's not that different. It's still about the forgotten man and the forgotten woman. People are being treated horribly in this country.”\n\nTrump continued to spread anti-immigrant rhetoric, accusing Venezuelans of “taking over the whole town” in Aurora, Colorado, as he again promised to oversee the largest mass deportation operation in U.S. history.\n\n“Take a look at Aurora. In Colorado, where Venezuelans are taking over the whole town. They're taking over buildings, the whole town…They're knocking down doors and occupying apartments of people. The people are petrified. And it's getting worse and worse,\" Trump said, referring to a viral video that appeared to show an armed mob roaming around an apartment complex in Aurora.\n\nHowever, the Aurora Police Department vehemently denied accusations that the apartment complex is being run by a Venezuelan gang.\n\n“We've been talking to the residents here and learning from them to find out what exactly is going on, and there's definitely a different picture,\" Interim Police Chief Interim Heather Morris said in a Facebook video the department posted last week, while adding, \"I'm not saying that there's not gang members that don't live in this community.\"\n\nThe City of Aurora also provided clarity on the situation in a post on X, saying while there was a concern about a “small” presence of the Venezuelan gang members in Aurora, the city is taking the situation seriously. The city stressed that Aurora is a “safe community” and that reports of gang members are “isolated to a handful of problem properties alone.”\n\nTrump criticized Harris’s rhetoric after Hannity played a 2016 clip of Harris from a speech at a Los Angeles mosque, in which she urged the public not to use terms such as “radical Islamic terrorism” and “illegal alien.”\n\n“She wants to be politically correct, and we can't be politically correct,” Trump responded.\n\n“You need a president that's not going to be taking you into war. We won't have World War III when I'm elected, but with these clowns, you're going to end up having world war – it's going to be a war like no other.”\n\nHannity briefly mentioned at the top of his program the school shooting earlier in the day in Winder, Georgia, where two students and two teachers were killed and nine people were injured. Trump cited Hungary's Prime Minister Viktor Orban to tout his record on crime and national security.\n\n“Well, it's a sick and angry world for a lot of reasons, and we're going to make it better. We're going to heal our world. We're going to get rid of all these wars that are starting all over the place, and we're going to make it better,” Trump said.\n\n“You know, Victor Orban made a statement. They said, ‘Bring Trump back, and we won't have any problems.’ He was very strong about that.”\n\nTrump also took time to defend himself and his running mate, Ohio Sen. JD Vance, against Harris’ running mate Gov. Tim Walz’s argument that they’re “weird.” Trump fired back at that sentiment, poking fun at some of Walz’s quirks.\n\n“Something’s weird with that guy. He's a weird guy. JD is not weird. He's a solid rock. I happen to be a very solid rock,” said Trump. “We're not weird. We're other things, perhaps, but we're not weird. But he is a weird guy.”"
        },
        "article16": {
            "headline": "Conflicting messages from Trump and his campaign highlighted in Arlington incident",
            "text": "Trump deputy campaign manager identified in Arlington National Cemetery dustup\n\ntoggle caption Anna Moneymaker/Getty Images\n\nOne of two staffers involved in the altercation at Arlington National Cemetery is a deputy campaign manager for Donald Trump’s reelection bid, NPR has learned. The former president insisted this week the incident did not happen, highlighting a growing disconnect between the messaging of the candidate and his campaign. NPR is identifying both staffers after the campaign’s conflicting responses to the incident last week outside Section 60 of the cemetery, where many casualties of Iraq and Afghanistan are buried.\n\nThe two staffers, according to a source with knowledge of the incident, are deputy campaign manager Justin Caporale and Michel Picard, a member of Trump’s advance team.\n\nSponsor Message\n\nCaporale is a one time aide to former first lady Melania Trump who left the White House to work for Florida Gov. Ron DeSantis before returning to the Trump campaign. He was also listed as the on-site contact and project manager for the Women for America First rally in Washington, D.C. on Jan. 6, 2021 where Trump urged the crowd to “stop the steal” before some of them stormed the U.S. Capitol.\n\nAfter Trump participated in a wreath laying ceremony on the third anniversary of the deadly bombing at Abbey Gate in Afghanistan that killed 13 U.S. service members, Trump visited Section 60 at the invitation of some family members and friends of the fallen soldiers.\n\nANC rules, that had been made clear to the Trump campaign in advance, say that only an official Arlington photographer can take pictures or film in Section 60. When an ANC employee tried to enforce the rules, she was verbally abused by the two Trump campaign operatives, according to a source with knowledge of the incident. Picard then pushed her out of the way according to two Pentagon officials.\n\nThe campaign’s conflicting messaging on the incident\n\nAfter NPR first reported the altercation last week, campaign spokesman Steven Cheung said they were “prepared to release footage” of the incident, and attacked the Arlington employee as someone “clearly suffering from a mental health episode.” Cheung also said they were granted access to have a photographer present, and pointed to a statement from Gold Star family members that invited Trump to attend the ceremony.\n\nSponsor Message\n\nThe campaign also released a TikTok video that included video footage from Section 60, including a smiling Trump flashing a thumbs up with family members at the gravesites. But other tombstones are visible in the picture, and at least one family of a fallen Green Beret has confirmed they did not give permission for his grave to be filmed or used in a campaign ad.\n\nThe Army released a statement last Thursday acknowledging that a cemetery employee “was abruptly pushed aside” and the campaign was warned ahead of time of the prohibition against photography and political activities at Arlington. The Army said the cemetery employee tried to de-escalate the situation after she was pushed, in hopes of not upsetting the Gold Star families in attendance.\n\nThe Army said a police report of the incident was filed, but that the employee had declined to press charges, and that the Army considered the matter closed, but added that “the ANC employee and her professionalism has been unfairly attacked.”\n\nWhen NPR emailed both Caporale and Picard, Cheung responded, “I see you've been emailing some of our team members…As the Army has said, they consider this matter closed. President Trump was there to support the Gold Star families and honor the sacrifices their loved ones made.”\n\nCheung also included a social media post that shows a Biden campaign ad from 2020 that used images of the then-vice president at the cemetery in 2010 .\n\nNeither Cheung, Picard or Caporale responded to emailed requests for comment as of publication time. Reached by phone, Caporale referred questions to Cheung. The Trump campaign has still not followed through on its pledge to release video of the incident, despite repeated requests from NPR.\n\nThis week, Trump contradicted his own campaign with a post on Truth Social falsely calling the confrontation a “made up story by Comrade Kamala and her misinformation squad” that attacked Harris and Biden for not attending the private ceremony.\n\nSponsor Message\n\nIn an interview on Sean Hannity’s radio show Tuesday, Trump reiterated the false assertion that nothing happened at the cemetery, questioning the motives of the unnamed employee and downplaying the accusations as attacks over “publicity.”\n\n“Do you notice that the person represented now doesn’t want to talk, he doesn’t want to speak or talk?” Trump asked, mislabeling the employee as male. “The nice thing, the beautiful thing, was all the parents and relatives got together and they said ‘That’s a false story, it was totally false.’”\n\nFormer President Trump polls well among veterans , and has many vocal supporters with military ties. Some of the family members who invited him to Arlington also spoke at the Republican National Convention, bashing Biden and vocally endorsing Trump.\n\n\"Joe Biden may have forgotten that our children died, but we have not forgotten — Donald Trump has not forgotten,\" said Cheryl Juels in Milwaukee at the RNC in July. Juels is the aunt of Sgt. Nicole Gee, one of the service members killed at Abbey Gate in 2021, during the chaotic U.S. withdrawal.\n\n\"Joe Biden owes the men and women that served in Afghanistan a debt of gratitude and an apology. Donald Trump loves this country and will never forget the sacrifice and bravery of our service members,\" she added. \"Join us in putting him back in the White House.\"\n\nBut those families do not have the power to suspend the rules at Arlington, where Section 60 is a fresh and on-going memorial to hundreds of recent war dead that, like the rest of the cemetery, is meant to be above politics.\n\nThe family of Master Sgt. Andrew Marckesano, a Green Beret who died by suicide after serving multiple combat tours and who is buried in Section 60, said according to their conversations with the cemetery, \"the Trump campaign staffers did not adhere to the rules that were set in place for this visit.\"\n\nSponsor Message\n\n\"We hope that those visiting this sacred site understand that there were real people who sacrificed for our freedom and that they are honored and respected and treated accordingly,\" they said in a statement.\n\nJimmy McCain, a US Marine whose father was the late senator John McCain, also condemned the visit .\n\nTrump has a history of controversial remarks about the military - he insulted Sen. John McCain for being a prisoner of war. He allegedly called dead soldiers \"suckers\" and \"losers,\" and recently stoked controversy for saying civilian Presidential Medal of Freedom recipients are much better than those who received the Medal of Honor — the highest military award in the country, often given posthumously.\n\n\n\nTrump’s conflicting messaging on the campaign trail\n\ntoggle caption Mandel Ngan/AFP via Getty Images\n\nThe incident at Arlington National Cemetery is the latest example of conflict between the messaging efforts of Trump’s campaign and the candidate himself since President Biden ended his reelection bid and Vice President Harris became the Democratic nominee.\n\nThe campaign’s attempts to use the bombing anniversary to attack Harris over the Afghanistan withdrawal, complete with videos from Gold Star family members blaming the administration for the deaths of their loved ones, has been overshadowed by the politicization of Arlington and its hallowed status.\n\nLast week, both Trump and campaign staff sought to clean up his stance on abortion rights and a ballot measure in his home state of Florida. Trump initially seemed to signal support for the proposed amendment that would enshrine abortion rights in the state constitution and posted that his second term would be “great for women and their reproductive rights.”\n\nAfter backlash from anti-abortion advocates and a statement from the campaign saying that Trump did not say how he would vote on the referendum, Trump eventually told a Fox News reporter he would vote against it.\n\nSponsor Message\n\nTrump has also publicly questioned the rules, format and fairness for next week’s debate even as his campaign accepted the conditions and has worked behind the scenes to iron out details.\n\nIn a town hall conversation with Fox News host Sean Hannity Wednesday, Trump called debate host ABC News “dishonest” and implied without evidence that Harris would get questions in advance.\n\nThe debate will be a pivotal moment for Trump to try and regain momentum against Harris, who has erased Trump’s onetime commanding lead in the polls in the seven key battleground states."
        },
        "article17": {
            "headline": "Trump plans New York press conference after hearing appeal arguments in sexual abuse case",
            "text": "WASHINGTON (AP) — Shortly after appearing in court for an appeal of a decision that found him liable for sexual abuse, Donald Trump stepped in front of television cameras Friday and brought up a string of past allegations of other acts of sexual misconduct, potentially reminding voters of incidents that were little-known or forgotten.\n\nThe former president has made hitting back at opponents and accusers a centerpiece of his political identity, but his performance at his namesake Manhattan office tower was startling even by Trump's combative standards.\n\nAt times, he seemed to relish using graphic language and characterizations of the case brought by advice columnist E. Jean Carroll, which could expose the former president to further legal challenges from Carroll's attorneys. His remarks were especially striking given that they came four days before Trump will debate Vice President Kamala Harris, with early voting about to begin in some parts of the country and Election Day just two months away.\n\nTrump is doing his best to stay in the public eye while Harris prepares for the debate in private, meeting with her advisers in Pittsburgh. That’s a reflection of their divergent campaign styles, with Trump frequently engaging with reporters — albeit often in friendly settings — while Harris has done just one interview and no news conferences since taking President Joe Biden’s place atop the Democratic ticket.\n\nHis team had billed Friday's appearance as a press conference and Trump repeatedly brought up Harris’ lack of news conferences. But Trump took no questions and instead talked about the cases against him for an hour while hardly mentioning any campaign issues.\n\n“I’m running for president, and I have all these cases all of a sudden come,” he said. “And they’re fake cases.”\n\nTrump’s campaign raised tens of millions of dollars off his previous indictments, convictions and appearances in court. But it’s unclear how focusing on his legal woes will help him now as he works to win over undecided voters — including independents and those on the fence in critical swing states, ahead of a critical debate on Tuesday that will likely draw tens of millions of viewers.\n\nTrump has disregarded his aides' advice to focus on policy\n\nTrump's trying to seize the political offensive by bringing up allegations against him recalled 2016 when, in the weeks before Election Day, he attempted to dismiss as simple “locker room talk” a recording of him bragging about grabbing, forcibly kissing and sexually assaulting women, which triggered subsequent allegations of misconduct by a string of women.\n\nBut on Friday, standing inside Trump Tower, where he lived for decades before moving to Florida, Trump had many moments that evoked a more distant past.\n\nHe suggested women have accused him of wrongdoing because he is famous. He made a trio of references to how he was already famous in some circles in the 1970s, and talked about his work in the real estate and construction worlds in the 1980s — before millions of today's voters were born. At one point, he referenced the New York Post's famous “Page Six” gossip section, whose writers have spent decades covering him, as being the internet of its day.\n\nTrump called Carroll's case against him “Monica Lewinsky Part II,” referencing the then-White House intern who had a sexual relationship with President Bill Clinton, and recalled an infamous dress that played a pivotal role in the late-1990s impeachment proceedings against Clinton.\n\nThe former president also repeatedly implied he would not have assaulted two of his accusers due to their looks. He said of a woman who has accused him of sexual misconduct on a plane in the 1970s “she would not have been the chosen one,” and of Carroll, “I never touched her. I would have had no interest in meeting her in any way, shape or form.”\n\nHarris, a former California attorney general, says frequently of her opponent's criminal record, “I know Donald Trump's type.” She had no public schedule as she continued debate preparation on Friday, but has built her campaign partly around the idea of prosecuting the case against him — and the accusations Trump brought up Friday could give her more lines of political attack.\n\nTrump’s supporters and aides have urged him to focus on policy contrasts with Harris instead of personal attacks during the final stretch of a race that remains extremely close.\n\nBut, as Trump spoke, two of his top political advisers were on a call with Republican members of Congress, criticizing the media as being too soft on Harris while saying they felt confident about the race for the White House. Instead, the former president was flanked by his lawyers, some of whom also spoke in defense of their client.\n\nTrump faces unprecedented criminal and civil jeopardy for a major candidate\n\nHis comments came after Trump was in court to hear his lawyers argue for overturning a jury's $5 million verdict finding him liable of sexually abusing Carroll in 1996.\n\nJuries now have twice now awarded Carroll huge sums for Trump's claiming she made up a story about him attacking her in a department store dressing room to help her sell a memoir. But that hasn’t stopped Trump from continuing to make nearly identical statements to reporters. On Friday, he said again that Carroll was telling a “made up, fabricated story.”\n\nCarroll’s lawyer, Roberta Kaplan, warned in March after a jury awarded Carroll another $83 million that she would continue to monitor Trump’s comments and would consider suing again if he kept it up. In a speedy response to his Friday comments at Trump Tower, Kaplan said in a statement, “I’ve said before and I’ll say it again: All options are on the table.\"\n\nIn the meantime, Trump faces unprecedented criminal and civil jeopardy for a major-party nominee.\n\nHe has separately been convicted on 34 felony counts in a New York state case related to hush money payments allegedly made to a porn actor. The judge in that case announced separately Friday that he would postpone sentencing until after Election Day on Nov. 5.\n\nTrump has also been ordered to pay steep civil fines for lying about his wealth for years.\n\nAnd he’s still contending with cases alleging his mishandling of classified documents, his actions after the 2020 election and his activities during the insurrection at the U.S. Capitol on Jan. 6, 2021 — though none are likely to go to trial prior to Election Day."
        },
        "article18": {
            "headline": "Right-Wing Influencers Like Tim Pool Allegedly Paid by Kremlin Influence Campaign",
            "text": "The U.S. Justice Department revealed a Russian influence campaign and charged two RT employees with two counts of conspiracy in an unsealed indictment on Wednesday. According to the indictment, two employees of the Kremlin-run media company RT spent $10 million on right-wing media personalities and poisoning the well of American discourse.\n\nThe two Russians, Kostiantyn Kalashnikov and Elena Afanasyeva funneled money into a Tennessee-based media company to get the job done. The indictment doesn’t name the company or the media personalities it hired, but it’s not hard to use clues in the court documents to figure out everyone involved. The unsealed indictment quotes the company’s description of itself on its own website as a “network of heterodox commentators that focus on Western political and cultural issues.”\n\nThere’s only one company based in Tennessee with that phrase on its website: TENET Media. TENET Media is an outlet that publishes on YouTube and other social media. It has paid for videos from people like Benny Johnson, Tim Pool, David Rubin, Matt Christiansen, and Lauren Southern.\n\nWhat kind of content did Kalashnikov and Afanasyeva get for their $10 million? “As alleged in today’s indictment, Russian state broadcaster RT and its employees, including the charged defendants, co-opted online commentators by funneling them nearly $10 million to pump pro-Russia propaganda and disinformation across social media to U.S. audiences,” Deputy Attorney General Lisa Monaco said in a statement.\n\nThe most watched video on TENET Media’s YouTube channel is a documentary from Southern about online dating. The second most popular is Southern talking about the great replacement conspiracy theory. Its most recent video is a 12-minute long low-effort rant from Benny Johnson about Kamala Harris. So far it has less than five thousand views.\n\nAccording to the indictment, Pool, Johnson, and the rest were making decent money churning out content for the site. In 2022, Tenet went looking for people to be the face of the operation. “‘For the right candidate we’re willing to pay around $1-2 million per year,’” they said, according to court records. That’s a lot of cash for videos that would go on to routinely net under ten thousand views.\n\nThe founders reached out to two commentators—believed to be Tim Pool and either Benny Johnson or David Rubin—and asked them how much they’d need to come work for them. “Founder-I advised that Commentator-I said ‘it would need to be closer to 5 million yearly for him to be interested,’ and that Commentator-2 said ‘it would take 100k per weekly episode to make it worth his while,’” the indictment said.\n\nThe indictment made clear that Pool, Rubin, Johnson, and the rest didn’t know that they were being sponsored by the Russians. The three have all released statements in the past 24 hours claiming that they, themselves, were victims.\n\n“We are disturbed by the allegations in today’s indictment, which make clear that myself and other influencers were victims in this alleged scheme,” Johnson said in a post on X.\n\n“These allegations clearly show that I and other commentators were the victims of this scheme,” Rubin said on X. “I knew absolutely nothing about any of this fraudulent activity. Period.”\n\nPool emphasized that the charges are allegations and, like the others, said he was a victim. “That being said, we still do not know what is true as these are only allegations,” Pool said in a post on X. “Putin is a scumbag, Russia sucks donkey balls.” He later deleted the post. Pool has been vocal in opposing U.S. support for Ukraine.\n\nAccording to the indictment, all three men made hundreds of thousands of dollars making videos for TENET media. One creator made $400,000 a month on top of a $100,000 signing bonus. Again, that’s a lot of cash for videos no one was watching.\n\nThe unsealed indictment was just one of several coordinated announcements from Washington on Wednesday aimed at striking back against Russia for election interference. The Treasury said it would sanction 10 individuals and two entities as part of the effort. In addition to the indictment, the DoJ announced the seizure of 32 internet domains it said spread disinformation using AI.\n\nDisinformation campaigns are a staple of modern geopolitics. Countries like the U.S., China, Russia, and Iran all spend money manipulating the media of their friends and rivals. In February of this year, Reuters reported that the U.S. military spread anti-vax propaganda in the Philippines during the pandemic with the goal of undermining China. Earlier this month, Microsoft accused Iran of running disinformation campaigns in the U.S.\n\nDisinformation campaigns are not always subtle and, if discovered, can undermine the intended message. Modern Russian campaigns are odd though, they’re often designed with the knowledge that they’ll be discovered. Russia isn’t always interested in convincing people of any one thing, it’s more about making everyone paranoid and distrustful. The knowledge that RT, and by extension the Kremlin, paid for Pool, Johnson, and Rubin to make videos is destabilizing in itself, regardless of the content they generate.\n\nReuters reached out to RT for comment on the indictment and RT gave them a statement that can be read as both a flippant joke and bizarre promise. “Three things are certain in life: death, taxes, and RT’s interference in the US elections,” RT told Reuters."
        },
        "article19": {
            "headline": "RFK Jr.'s fight to get off the ballot is causing chaos in North Carolina",
            "text": "RFK Jr. wants off North Carolina ballots to help Donald Trump win.\n\nThe legal battle could delay mail-in voting in a critical swing state, WRAL reported.\n\nKennedy is also trying to get off the ballot in other major swing states after endorsing Trump.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Go to newsletter preferences Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nMail-in voting for North Carolina, a critical swing state, could be delayed as the former presidential candidate Robert F. Kennedy Jr. fights to get his name taken off the ballots.\n\nWRAL reported ballots were supposed to start going out Friday — the state deadline. But the North Carolina Court of Appeals ordered a pause, telling officials to reprint ballots without Kennedy's name.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in ."
        },
        "article20": {
            "headline": "Liveblog zur US-Wahl 2024: Schweigegeldprozess: Trump-Strafe soll erst nach US-Wahl verkündet werden",
            "text": "Der russische Präsident Wladimir Putin hat angekündigt, im amerikanischen Präsidentenwahlkampf die demokratische Kandidatin Kamala Harris zu „unterstützen“. Dabei handelt es sich wohl um einen Witz, wie F.A.Z.-Korrespondent Friedrich Schmidt schreibt:\n\n\n\nSchon im Februar hatte Putin Joe Biden als vorzugswürdig gegenüber dem seinerzeit noch voraussichtlichen Kandidaten der Republikaner, Donald Trump, bezeichnet, da der Amtsinhaber „erfahrener“ und „vorhersehbar“ sei.\n\n\n\nIn Anspielung darauf sagte Putin am Donnerstag auf seinem alljährlichen Wirtschaftsforum in Wladiwostok in Russlands Fernem Osten, Biden sei, soweit man überhaupt von „Favoriten“ sprechen könne, da „nicht wir das zu bestimmen haben“, sondern das „amerikanische Volk“, Russlands „Favorit“ gewesen. Nachdem Biden nun nicht mehr „im Rennen“ sei, aber seinen Mitstreitern empfohlen habe, Harris zu unterstützen, „werden also auch wir das machen, werden wir sie unterstützen“, sagte Putin zur Erheiterung von Publikum und Moderatorin und lächelte dabei sarkastisch.\n\n\n\nDass Harris „ansteckend lacht“, zeige, „dass bei ihr alles gut ist“, fuhr Putin im selben Ton fort. Trump dagegen habe in dessen Präsidentschaft so viele „Beschränkungen und Sanktionen“ gegen Russland verhängt wie zuvor kein amerikanischer Präsident. „Wenn bei Frau Harris alles gut ist, unterlässt sie womöglich solche Handlungen“, sagte Putin. Letztlich habe „das amerikanische Volk die Wahl, und mir werden diese Wahl respektieren“.\n\n\n\nAm Mittwoch hat das amerikanische Finanzministerium neue Sanktionen gegen russische Staatsmedien wie den Sender RT, dessen Chefin Margarita Simonjan und weitere Personen aus dessen Umfeld verhängt und dies mit Versuchen begründet, die Präsidentenwahlen im November zu beeinflussen. Generalstaatsanwalt Merrick Garland sagte bei der Vorstellung von Vorwürfen gegen zwei demnach in Russland ansässige RT-Mitarbeiter, es gehe Moskau darum, die Unterstützung für die Ukraine zu diskreditieren.\n\n\n\nUnter anderem habe RT mit fast zehn Millionen Dollar ein Unternehmen im amerikanischen Bundesstaat Tennessee gegründet, um auch unter Mitwirkung heimischer Influencer Russlands Interessen verdeckt voranzutreiben. Laut dem Sender CNN gehen amerikanische Geheimdienste weiterhin davon aus, dass Moskau einer neuerlichen Präsidentschaft Trumps den Vorzug geben würde."
        },
        "article21": {
            "headline": "Kroger CEO vows $1B price cut on groceries if Albertsons merger closes",
            "text": "The Federal Trade Commission sued earlier this year to prevent the deal.\n\nA possible $24.6 billion deal between supermarket rivals, Kroger and Albertsons, has hit another roadblock with the U.S. government, but the CEO has pledged to cut prices by $1 billion on day one to try and save the proposed deal.\n\nAfter the U.S. government's request for a preliminary injunction that would block the deal, chief executive of the nation's third-largest general retailer Rodney McMullen took the stand in a federal courtroom in Oregon on Wednesday as part of a three week hearing to defend the merger with Albertsons.\n\nKroger CEO Rodney McMullen leaves federal court after testifying during a federal court hearing, Sept. 4, 2024, in Portland, Ore. Jenny Kane/AP\n\nMcMullen argued that the move would allow the company to drop prices and compete with bigger retail companies like Walmart, Amazon, and Costco.\n\nThe definitive merger agreement was first announced in October 2022 and last month the Federal Trade Commission, and states of Colorado and Washington, filed a lawsuit to stop the merger, arguing it would \"eliminate competition\" in the 22 states where the companies currently compete and raise grocery prices for millions during a time when Americans are already paying more due to high inflation on food.\n\nA Kroger grocery store. Jonathan Weiss/Adobe Stock\n\nOn Wednesday, McMullen said Albertsons prices are 10 to 12% higher than that of Kroger's and argued that the merged company could aim to shrink that gap in its new strategy to retain customers.\n\nIf combined, Albertsons and Kroger would control around 13% of U.S. grocery sales, which is still short of Walmart that currently controls nearly 22%.\n\nCincinnati-based Kroger operates 2,800 stores across 35 states, with brands including Ralphs, Smith's and Harris Teeter.\n\nBoise-based Albertsons operates 2,273 stores in 34 states, including brands like Safeway, Jewel Osco and Shaw's.\n\nAn Albertsons grocery store in Lafayette, La. Adobe Stock\n\nIf the deal does go through, it would be the largest grocery chain merger in U.S. history.\n\nFood prices continues to come up as a recurring topic for politicians, with Vice President Kamala Harris saying on the campaign trail that if elected President, she would crack down on prices.\n\nFormer President Donald Trump has campaigned on inflation and recently reminded the public that grocery prices increased by more than 20% under President Joe Biden.\n\nMore details will emerge from the multi-court hearing on the proposed grocery chain merger, which will include upcoming testimony from Albertsons CEO Vivek Sankaran."
        },
        "article22": {
            "headline": "Harris County Constable Deputy Shooting: Possible connection in deadly shooting revealed",
            "text": "HOUSTON - We’ve learned more about both the fallen officer and the suspect, who’s in a Galveston lockup tonight.\n\nRecords show both of them had their own security companies. While visiting the physical address of Corporal Husseini’s business, we spotted business partners and detectives.\n\nPREVIOUS COVERAGE: Harris County Precinct 4 Constable Deputy killed on the way to work, suspect now in custody\n\nDeputy Constable Maher Husseini\n\n\"I feel sad and angry about that, you know. This is senseless crime. There is no reason for it.\"\n\nA day after the tragic shooting that killed Harris County Precinct 4 Constable Deputy Maher Husseini, we spoke with one of his longtime friends and business partners.\n\nMustafa Abushalbak is the chief financial officer of Jaguar Security Company, located on the 3000 block of South Gessner Road, where Corporal Husseini was the founder and CEO. Abushalbak says Husseini had just left the office before he was killed, less than a mile away on Richmond and Fondren.\n\n\"This is a person driving his car to work. He's a constable. He helps protect the people. He came and shot him in the traffic light,\" said Abushalbak.\n\nFOX 26 Houston is now on the FOX LOCAL app available through Apple TV, Amazon FireTV, Roku, Google Android TV, Samsung TV, and Vizio!\n\nShortly before Abushalbak arrived, HPD detectives were seen in front of the office waiting to be let in - they stayed there for hours.\n\nFOX 26 has learned Husseini also owned American Protection Academy, a recently opened company that trained security professionals. That office is across the hallway.\n\nAn hour before, in Galveston, the suspect, Athir Samir Murady was escorted into the Galveston Police Department by officers, after leaving a nearby hospital following Tuesday’s shooting, chase, and arrest.\n\nAthir Samir Murady\n\nMurady’s name also showed up on the state security portal database - having several affiliations with private security companies and security-related firms. We asked Abushalbak if there were any connections the two men had in business.\n\n\"He came one time. One year ago. He came visit. He tried to take business from us in Dallas and New Orleans. Then he came apologize for that.\"\n\nAbushalbak says there were no other interactions with Athir Murady and Corporal Husseini or the business after that and then the shooting happened on Tuesday."
        },
        "article23": {
            "headline": "Donald Trump veut charger Elon Musk d’un « audit » du gouvernement américain pour le « réformer » en profondeur, s’il est élu",
            "text": "L’ancien président des Etats-Unis et candidat républicain à l’élection présidentielle Donald Trump s’adresse à l’Economic Club of New York, le 5 septembre 2024. DAVID DEE DELGADO / AFP\n\nS’il remporte l’élection du 5 novembre, le candidat républicain à la présidentielle américaine, Donald Trump, a annoncé, jeudi 5 septembre, qu’il chargerait le milliardaire Elon Musk, dont il est proche, d’un « audit » du gouvernement en vue de « réformes » en profondeur.\n\n« Sur les conseils d’Elon Musk (…) je mettrai sur pied une commission gouvernementale chargée de conduire un audit complet en termes financiers et de performances de la totalité du gouvernement fédéral, en vue de faire des recommandations pour des réformes draconiennes », a déclaré l’ancien président des Etats-Unis devant un club d’économistes et de milieux d’affaires, à New York.\n\nCe n’est pas la première fois que le tribun et businessman de 78 ans déclare qu’il souhaite voir M. Musk à ses côtés dans une éventuelle nouvelle administration, s’il est réélu le 5 novembre. Mais Donald Trump n’avait jamais été aussi précis sur les tâches qu’il souhaite confier au patron de Tesla, SpaceX et du réseau social X. « Nous devons le faire, nous ne pouvons pas continuer comme ça. Et Elon a accepté de prendre la tête de cette commission », a-t-il martelé.\n\nLire aussi | Article réservé à nos abonnés La « conversation » entre Elon Musk et Donald Trump commence par un fiasco Ajouter à vos sélections\n\nEn réaction à cette annonce, Elon Musk a écrit sur X avoir « hâte de servir l’Amérique si l’occasion se présente ». « Aucun salaire, aucun titre, aucune reconnaissance n’est nécessaire », a ajouté celui qui s’en prend régulièrement à la candidate démocrate Kamala Harris sur son réseau social et ne cache pas son soutien pour M. Trump.\n\nAttaques virulentes contre Kamala Harris\n\nJeudi, Donald Trump a de nouveau passé plus d’une heure à pilonner le programme de sa concurrente démocrate et la « catastrophe économique » provoquée selon lui par le gouvernement du président Joe Biden. « Nous sommes en crise économique, une nation faillie, une nation en grave déclin », a une nouvelle fois estimé l’ancien dirigeant américain, qui n’a de cesse depuis une décennie de peindre en noir la première puissance mondiale.\n\nLire aussi | Article réservé à nos abonnés Avec le soutien d’Elon Musk à Trump, X pourrait plus que jamais devenir un outil de campagne des républicains Ajouter à vos sélections\n\nL’actuelle vice-présidente et candidate à l’élection « veut quatre années de plus pour mettre en œuvre un programme de gauche radicale qui fait peser une menace fondamentale sur la prospérité de chaque famille américaine et sur l’Amérique en tant que telle », a encore accusé M. Trump. Développant dans un discours décousu quelques axes de ce que serait son programme économique, il a également promis de faire « des Etats-Unis la capitale mondiale du bitcoin et des cryptomonnaies ».\n\nTandis que M. Trump s’exprimait à New York, à moins d’une semaine d’un débat très attendu le 10 septembre avec sa rivale, cette dernière est arrivée en Pennsylvanie, peut-être l’Etat le plus crucial de l’élection présidentielle. Donald Trump s’y était imposé d’un rien en 2016 et Joe Biden sur le fil en 2020.\n\nLire aussi | Article réservé à nos abonnés Elon Musk, acteur politique de la droite extrême, puissance X Ajouter à vos sélections"
        },
        "article24": {
            "headline": "“Harris and Walz, intentionally or not, are projecting something different: a sitcom...",
            "text": "Advertise here with Carbon Ads\n\nThis site is made possible by member support. ❤️\n\nBig thanks to Arcustech for hosting the site and offering amazing tech support.\n\nWhen you buy through links on kottke.org, I may earn an affiliate commission. Thanks for supporting the site!\n\nkottke.org. home of fine hypertext products since 1998.\n\n🍔 💀 📸 😭 🕳️ 🤠 🎬 🥔"
        },
        "article25": {
            "headline": "Das sind die Steuerpläne von Kamala Harris",
            "text": "Steuerpolitik ist ins Zentrum des amerikanischen Wahlkampfs geraten. Die demokratische Spitzenkandidatin Kamala Harris preschte in dem Wettstreit der Wahlgeschenke nun mit dem Vorschlag vor, die Reichen deutlich weniger zur Kasse zu bitten als es Joe Biden beabsichtigt hatte. Sie will realisierte Kapitalerträge nur noch mit 28 Prozent besteuern, gut 10 Prozentpunkte weniger als Biden. Die Abgrenzung folgt offenkundig auf Meinungsumfragen, in den Harris’ Widersacher Trump höhere Kompetenz in der Wirtschaftspolitik zugebilligt wird."
        },
        "article26": {
            "headline": "Trump gets criminal sentencing delayed till after presidential election",
            "text": "Trump gets criminal sentencing delayed till after presidential election\n\ntoggle caption Spencer Platt/Getty Images\n\nA New York judge on Friday delayed the sentencing in a criminal case against former President Donald Trump in order to ensure the court is seen as politically impartial.\n\nJudge Juan Merchan set the new sentencing date for Nov. 26, a few weeks after the election. Trump was convicted of falsifying business records to hide payments to an adult film star.\n\n“The imposition of sentence will be adjourned to avoid any appearance—however unwarranted—that the proceeding has been affected by or seeks to affect the approaching Presidential election in which the Defendant is a candidate,” Merchan said in his decision. “The Court is a fair, impartial, and apolitical institution.”\n\nSponsor Message\n\nMerchan also postponed consideration on whether to overturn the criminal conviction in light of a recent Supreme Court decision on presidential immunity and other evidence. That hearing is now set for Nov. 12.\n\nThe Supreme Court decision on July 1 came after Trump was convicted in New York — but before he was sentenced. The timing threw into disarray what was already an unprecedented felony conviction against a former president and current Republican presidential nominee.\n\nTrump’s lawyers say the Supreme Court decision means his case, brought by Manhattan District Attorney Alvin Bragg, should be cleared entirely.\n\n\"The Manhattan D.A. Witch Hunt has been postponed because everyone realizes that there was NO CASE, I DID NOTHING WRONG!\" Trump posted on the Truth Social website. \"It is a political attack against me.\"\n\nTrump's legal team argued that various testimony, such as that of former White House employees, and evidence, like statements made while he was president, violate the Supreme Court ruling that decided presidents have immunity for official acts they take in office.\n\nHis lawyers have spent the summer trying to blunt the case’s impact on the election, in part by accusing Merchan of political bias. They’ve asked Merchan to overturn the conviction, appealed it, sought to delay the sentencing until after the election, and remove Merchan and move the case to federal jurisdiction.\n\nSponsor Message\n\nA spokeswoman for the district attorney, Danielle Filson, said the DA's office \"stands ready for sentencing on the new date set by the court.\"\n\n\"A jury of 12 New Yorkers swiftly and unanimously convicted Donald Trump of 34 felony counts,\" she said in a statement.\n\nFundraising tool\n\nNew York jurors in May unanimously agreed that Trump falsified business records to conceal a $130,000 hush money payment to adult-film star Stormy Daniels to influence the 2016 presidential contest.\n\nEven without a delay in his sentence, Trump has sought to use the conviction as a fundraising tool. Within 24 hours of the guilty verdict, Trump’s campaign boasted of raising millions of dollars. Since officially being named GOP presidential nominee, he has continued to discuss the trials at various campaign events.\n\nThe jury heard from 22 witnesses during about four weeks of testimony in Manhattan’s criminal court. Jurors also weighed other evidence — mostly documents like phone records, invoices and checks to Michael Cohen, Trump’s once-loyal “fixer,” who paid Daniels to keep her story of an alleged affair with the former president quiet.\n\nThe facts of the payments and invoices labeled as legal services were not in dispute.\n\nWhat prosecutors needed to prove was that Trump falsified the records in order to further another crime — in this case, violating the New York election law that makes it a crime for “any two or more persons [to] conspire to promote or prevent the election of any person to a public office by unlawful means.”\n\nThe jurors were able to choose whether those unlawful means were violating the Federal Election Campaign Act, falsifying tax returns or falsifying other business records.\n\nThe verdict came more than a year after a grand jury indicted Trump on March 30, 2023, marking the first time a former or sitting president faced criminal charges.\n\n—With assistance from Franco Ordoñez."
        },
        "article27": {
            "headline": "US-Wahlkampf: US-Republikanerin Liz Cheney will Demokratin Harris wählen",
            "text": "Die prominente US-Republikanerin Liz Cheney will bei der Präsidentenwahl im November für die demokratische Präsidentschaftskandidatin Kamala Harris stimmen. «Als Konservative, als jemand, der an die Verfassung glaubt und der sie etwas bedeutet, habe ich gründlich nachgedacht. Und wegen der Gefahr, die von Donald Trump ausgeht, stimme ich nicht nur nicht für Donald Trump, sondern ich werde Kamala Harris wählen», sagte die 58-Jährige bei einer Veranstaltung an der Duke-Universität in North Carolina, wie auf Videos zu sehen war. Cheney gilt seit einigen Jahren als große Kritikerin des früheren republikanischen US-Präsidenten Trump.\n\nCheney erinnert an Bedeutung der Swing States\n\n«Ich glaube nicht, dass wir uns den Luxus leisten können, die Namen anderer Kandidaten auf den Wahlzettel zu schreiben, vor allem nicht in den Swing States», sagte die Republikanerin. Damit machte sie ihre Position deutlich, wonach es nicht reicht, Trump nur einfach nicht zu wählen, um ihn zu verhindern. Während die meisten der 50 Bundesstaaten fest den Republikanern oder den Demokraten zugerechnet werden, sind einige wenige politisch hart umkämpft. Sie nennen sich Swing States.\n\nEnge Rennen werden neben Pennsylvania auch in Arizona, Georgia, Michigan, Nevada, North Carolina und Wisconsin erwartet. Sie gelten als wahlentscheidend - hier kommt es auf jede Stimme an. Bei der Präsidentenwahl am 5. November tritt die Demokratin Harris gegen ihren republikanischen Kontrahenten Trump an. Umfragen sagen ein Kopf-an-Kopf-Rennen voraus.\n\nCheney wurde in der Partei zur Außenseiterin\n\nLiz Cheney ist die Tochter des früheren US-Vizepräsidenten Dick Cheney. Die erzkonservative Politikerin gilt als lauteste Trump-Kritikerin unter den Republikanern. Dafür hat sie einen hohen Preis gezahlt. Sie verlor ihre Führungsrolle innerhalb der Partei und schließlich auch ihren Sitz im Repräsentantenhaus. Im Untersuchungsausschusses zum Angriff auf das US-Kapitol nahm sie eine führende Rolle ein und warnte immer wieder davor, dass von Trump eine Gefahr für die Demokratie ausgehe. Cheney hatte sich erst nach der Kapitol-Attacke offen gegen Trump gestellt. Zuvor unterstützte sie seine Politik weitgehend.\n\nEs war erwartet worden, dass Cheney sich in diesen Tagen zur Wahl positionieren würde. Während des Parteitags der Demokraten in Chicago im August gab es auch das Gerücht, dass die Republikanerin dort auftreten könnte. Dies tat sie letztlich aber nicht. Ihr Parteifreund Adam Kinzinger, der neben Cheney das einzige republikanische Mitglied im Kapitol-Ausschuss war, hielt allerdings in Chicago eine Rede.\n\n© dpa-infocom, dpa:240905-930-223361/1"
        },
        "article28": {
            "headline": "The Harris campaign posted a TikTok of Donald Trump talking about his...",
            "text": "Advertise here with Carbon Ads\n\nThis site is made possible by member support. ❤️\n\nBig thanks to Arcustech for hosting the site and offering amazing tech support.\n\nWhen you buy through links on kottke.org, I may earn an affiliate commission. Thanks for supporting the site!\n\nkottke.org. home of fine hypertext products since 1998.\n\n🍔 💀 📸 😭 🕳️ 🤠 🎬 🥔"
        },
        "article29": {
            "headline": "USA: Regeln für Duell zwischen Trump und Harris stehen fest",
            "text": "US-Wahlkampf Regeln für Duell zwischen Trump und Harris stehen fest Stand: 05.09.2024 07:44 Uhr\n\nNach langem Hin und Her haben sich die Präsidentschaftskandidaten Trump und Harris auf die Regeln für das erste TV-Duell geeinigt. Offenbar gab das Harris-Lager nach. Dafür bekommt die Demokratin neue Unterstützung aus den republikanischen Reihen.\n\nDie demokratische Präsidentschaftskandidatin Kamala Harris und ihr Kontrahent Donald Trump haben sich auf die Regeln für das mit Spannungen erwartete erste TV-Duell geeinigt. Der Sender ABC veröffentlichte die Bedingungen für das Fernsehformat.\n\nVorausgegangen war ein Streit über die Mikrofone. Konkret ging es um die Frage, ob diese stumm geschaltet werden, wenn der politische Gegner spricht. Ein Sprecher des Wahlkampfteams der Demokratin Harris hatte vergangene Woche mitgeteilt, dass man es bevorzuge, dass die Mikrofone beider Kandidaten während der gesamten Übertragung angeschaltet blieben. Trump hatte sich darüber aufgeregt und indirekt damit gedroht, die ganze TV-Debatte abzublasen.\n\nEs scheint nun eine Einigung zu geben: So sollen während des TV-Duells die Mikrofone desjenigen, der gerade nicht spricht, stummgeschaltet werden. Dabei hat nun offenbar Harris klein beigegeben.\n\nSchlüsse aus letztem Duell gegen Biden\n\nDie Republikaner dürften aus dem TV-Duell mit dem damaligen demokratischen Präsidentschaftsbewerber, US-Präsident Joe Biden, im Juni gelernt haben. Auch damals waren die Mikrofone desjenigen, der gerade nicht sprach, stummgeschaltet. Nach der Debatte kamen Beobachter aber zu dem Schluss, dass Trump die stumm geschalteten Mikros eher geholfen hätten, weil der 78-Jährige so kontrollierter gewirkt habe.\n\nDer Sender ABC kündigte an, dass die Debatte 90 Minuten dauern werde, zwei Werbepausen seien geplant. Es soll keine Eröffnungsstatements geben, die Schlusserklärungen der Kandidaten sollen zwei Minuten dauern. \"Requisiten oder vorformulierte Notizen sind auf der Bühne nicht erlaubt\", teilte ABC weiter mit. Harris und Trump würden einen Stift, einen Block Papier und eine Flasche Wasser erhalten.\n\nTrump säte bereits vorab Zweifel an der Unparteilichkeit des Senders. \"ABC ist der schlechteste Sender, wenn es um Fairness geht\", sagte Trump im Gespräch beim Senders Fox News. Ohne Belege zu nennen, behauptete Trump, er habe gehört, Harris würde die Fragen von ABC vorab bekommen. Die Debatte findet am 10. September statt.\n\nLiz Cheney und Jimmy McCain wollen für Harris stimmen\n\nBei der Präsidentenwahl am 5. November läuft es auf ein Kopf-an-Kopf-Rennen zwischen Harris und Trump hinaus - in Umfragen liegen sie etwa gleichauf. Nun hat sich auch die prominente US-Republikanerin Liz Cheney für Harris ausgesprochen. Bei der Präsidentenwahl im November wolle sie für die demokratische Präsidentschaftskandidatin stimmen.\n\n\"Als Konservative, als jemand, der an die Verfassung glaubt und der sie etwas bedeutet, habe ich gründlich nachgedacht. Und wegen der Gefahr, die von Donald Trump ausgeht, stimme ich nicht nur nicht für Donald Trump, sondern ich werde Kamala Harris wählen\", sagte die 58-Jährige bei einer Veranstaltung an der Duke-Universität in North Carolina. Cheney gilt seit einigen Jahren als große Kritikerin des früheren republikanischen US-Präsidenten Trump.\n\nAuch Jimmy McCain hat sich als Demokrat registriert und will bei der US-Wahl im November für Harris stimmen. Er ist ein Sohn des früheren republikanischen Präsidentschaftskandidaten John McCain. Der Schritt wurde als wertvolles Zeichen der Unterstützung für die Demokraten wahrgenommen."
        },
        "article30": {
            "headline": "US-Wahlkampf: Trump und Harris einigen sich auf Regeln für TV-Duell",
            "text": "Die demokratische Präsidentschaftskandidatin Kamala Harris und ihr Kontrahent Donald Trump haben sich auf die Regeln für das bevorstehende TV-Duell geeinigt - doch der Republikaner sät schon vorab Zweifel an der Unparteilichkeit des Senders, der die Debatte austrägt. «ABC ist der schlechteste Sender, wenn es um Fairness geht», sagte Trump im Gespräch mit dem Talkmaster Sean Hannity des Senders Fox News. Ohne Belege zu nennen, behauptete Trump, er «habe gehört» Harris würde die Fragen von ABC vorab bekommen.\n\nHarris zieht im Mikrofon-Streit den Kürzeren\n\nZuvor hatte ABC die Regeln für das mit Spannung erwartete erste Fernsehduell zwischen Trump und Harris veröffentlicht. Vorausgegangen war ein Streit über die Mikrofone. Konkret ging es um die Frage, ob diese stumm geschaltet werden, wenn der politische Gegner spricht. Hier scheint es nun eine Einigung zu geben: So sollen während des TV-Duells am 10. September (Ortszeit/11. September MESZ) die Mikrofone desjenigen, der gerade nicht spricht, stummgeschaltet werden.\n\nDas heißt, Harris hat klein beigegeben. Sie wollte, dass die Mikrofone beider Kandidaten während der gesamten Übertragung angeschaltet bleiben. Ihr Team ließ wissen, dass man darauf setze, dass sich Trump nicht «90 Minuten lang präsidial verhalten kann». Nun schrieb ihr Wahlkampfteam an den Sender ABC, dass das nun vereinbarte Format die 59-Jährige benachteilige. Ungeachtet der Bedenken stimme man aber den Regeln zu, da man fürchte, dass Trump sonst das TV-Duell abgesagt hätte, hieß es in dem Brief, der US-Medien vorlag.\n\nAn dieser Stelle ist ein externer Inhalt eingebunden Zum Anschauen benötigen wir Ihre Zustimmung Bitte aktivieren Sie JavaScript damit Sie diesen Inhalt anzeigen können. Weiter\n\nTV-Duell zwischen Biden und Trump wirkt nach\n\nTrump dürfte aus dem TV-Duell mit dem damaligen demokratischen Präsidentschaftsbewerber, US-Präsident Joe Biden, im Juni gelernt haben. Damals waren die Mikrofone desjenigen, der gerade nicht sprach, stummgeschaltet. Die Stummschaltung soll Berichten zufolge auf Bidens Team zurückgegangen sein. Damit hätten die Demokraten verhindern wollen, dass Trump den 81 Jahre alten Demokraten ständig unterbreche. Nach der Debatte kamen Beobachter aber zu dem Schluss, dass Trump die stumm geschalteten Mikros eher geholfen hätten, weil der 78-Jährige so kontrollierter gewirkt habe. Bidens Auftritt hingegen war ein Desaster - und hatte seinen Rückzug aus dem Rennen zur Folge.\n\nTrump hatte sich darüber aufgeregt, dass Harris diese Regeln nun ändern wollte und indirekt damit gedroht, die ganze TV-Debatte abzublasen. Die damalige Debatte zwischen Trump und Biden wurde vom als liberal geltenden US-Sender CNN ausgerichtet, nun ist ABC an der Reihe. Trump nannte den Sender im Gespräch mit Hannity «unehrlich» und verwies auf eine Freundschaft zwischen Harris und einer Managerin des Senders. Der Republikaner sagte, er habe nur zugestimmt, weil Harris' Team auf den Sender bestanden habe. Der 78-Jährige hatte der Debatte bereits vor Monaten zugestimmt, damals war Biden noch im Rennen.\n\nStift, Papier und Wasser sind erlaubt\n\nABC kündigte nun an, dass die Debatte 90 Minuten dauern werde, zwei Werbepausen seien geplant. Es soll keine Eröffnungsstatements geben, die Schlusserklärungen der Kandidaten sollen zwei Minuten dauern. «Requisiten oder vorformulierte Notizen sind auf der Bühne nicht erlaubt», teilte ABC weiter mit. Harris und Trump würden einen Stift, einen Block Papier und eine Flasche Wasser erhalten. Trump behauptete nun in der Sendung bei Fox News, dass Harris gefordert habe, Notizen mit in das Duell nehmen zu dürfen.\n\nAn dieser Stelle ist ein externer Inhalt eingebunden Zum Anschauen benötigen wir Ihre Zustimmung Bitte aktivieren Sie JavaScript damit Sie diesen Inhalt anzeigen können. Weiter\n\nTownhall bei Fox News ohne Zuschauerfragen\n\nBei Trumps Gespräch mit Hannity am Mittwochabend (Ortszeit) handelte es sich um eine sogenannte Townhall. Bei einem solchen Format sind auch Fragen aus dem Publikum zugelassen. In der rund einstündigen Sendung auf Fox News, die im umkämpften Bundesstaat Pennsylvania aufgezeichnet wurde, kam aber kein Zuschauer zu Wort. «The Hill» berichtete, entsprechende Zuschauerfragen an Trump sollten am Donnerstag ausgestrahlt werden. In der Sendung am Mittwoch lobte Hannity den republikanischen Kandidaten über den grünen Klee. Er sagte etwa: «Sie haben einen hohen Preis dafür gezahlt, dass Sie in die politische Arena eingestiegen sind.» Trump würde von der Justiz verfolgt, obwohl er sich eigentlich ein schönes Leben machen könnte, sagte Hannity.\n\nFox News war eine Zeit lang etwas von Trump abgerückt - und unterstützte eher den damaligen republikanischen Präsidentschaftsbewerber Ron DeSantis. Mittlerweile steht der Sender aber wieder eisern hinter Trump. Aktuell ist nicht geplant, dass Fox News eine TV-Debatte im Wahlkampf ausrichtet. Es könnte durchaus sein, dass die Debatte auf ABC die einzige zwischen Trump und Harris bleiben wird. Nach Bidens Ausstieg aus dem Rennen war der ganze Plan für die ausgehandelten TV-Debatten über den Haufen geworfen worden.\n\nKnappes Rennen erwartet\n\nBei der Präsidentenwahl am 5. November läuft es auf ein Kopf-an-Kopf-Rennen zwischen Harris und Trump hinaus - in Umfragen liegen sie etwa gleichauf. Der geringe Abstand zwischen beiden Kandidaten liegt im Bereich der Fehlertoleranz. Allerdings hat das Rennen mit Harris' Übernahme der Kandidatur neuen Schwung gewonnen. Trump hatte der Wechsel bei den Demokraten augenscheinlich etwas unvermittelt getroffen - er schien sich auf seinen politischen Erzfeind Biden eingeschossen zu haben und arbeitet nun an einer neuen Strategie. Er wirft Harris vor, eine radikale Linke zu sein.\n\nAm Mittwochabend (Ortszeit) meldete sich eine altbekannte Trump-Kritikerin zu Wort: Die Republikanerin Liz Cheney kündigte an, bei der Wahl für Harris stimmen zu wollen. Die Ansage ist keine wirkliche Überraschung. Dass eingefleischte Republikaner aber öffentlich dazu aufrufen, Demokraten zu wählen, ist schon sehr ungewöhnlich. Gleichzeitig freute Trump sich darüber, dass der Bruder des demokratischen Vizekandidaten Tim Walz sich kritisch über diesen geäußert hatte. Entsprechende Facebook-Posts von Jeff Walz hatten zuletzt für Aufmerksamkeit gesorgt.\n\n© dpa-infocom, dpa:240905-930-223368/4"
        },
        "article31": {
            "headline": "Präsidentenwahl in den USA: Putin unterstützt angeblich Harris im US-Wahlkampf",
            "text": "Wladiwostok (dpa) – Vor der Präsidentenwahl in den USA hat Kremlchef Wladimir Putin seine angebliche Unterstützung für Kandidatin Kamala Harris erklärt. Die US-Politikerin habe so ein ausdrucksstarkes und «ansteckendes Lachen», das zeuge davon, dass für sie alles gut sei, sagte Putin beim Östlichen Wirtschaftsforum in Wladiwostok am Pazifik.\n\nEr habe immer gesagt, dass er US-Präsident Joe Biden favorisiere. Putin hatte gelobt, dass Biden berechenbarer sei als sein Vorgänger Donald Trump. Da Biden aus dem Wahlkampf herausgenommen worden sei und sich nun für Harris einsetze, «werden wir sie auch unterstützen». Die Wahl sei aber beim US-amerikanischen Volk, sagte Putin.\n\nDer 71-Jährige äußerte sich im Beisein von Malaysias Regierungschef Anwar Ibrahim bei einer Plenarsitzung zu Fragen des Welthandels und zur internationalen Politik. Der Kremlchef kritisierte, dass besonders auch unter Trump US-Sanktionen gegen Russland erlassen worden seien. «Trump hat so viele Beschränkungen und Sanktionen gegen Russland verhängt, wie kein Präsident vor ihm. Und wenn es Frau Harris gut geht, wird sie vielleicht von dieser Art von Maßnahmen absehen», sagt er unter Hinweis auf ihr Lachen.\n\nWashington: Putin soll sich aus unseren Wahlen heraushalten\n\n«Herr Putin sollte aufhören, über unsere Wahlen zu sprechen», sagte der Kommunikationsdirektor des Nationalen Sicherheitsrates, John Kirby, angesprochen auf Putins Äußerung. Er solle niemanden bevorzugen. Nur die amerikanischen Wählerinnen und Wählern würden entscheiden, wer der nächste US-Präsident werde. «Wir würden es sehr zu schätzen wissen, wenn Herr Putin aufhören würde, über unsere Wahlen zu reden und aufhören würde, sich in sie einzumischen», so Kirby weiter.\n\nDie US-Regierung wirft Russland eine Einmischung in die bevorstehende Präsidentenwahl im November vor. Die USA belegten am Mittwoch mehrere Personen und Organisationen mit Sanktionen, darunter Vertreter des staatlichen russischen Senders RT (früher Russia Today), wie das Finanzministerium und Justizminister Merrick Garland in Washington mitteilten. Garland sagte, der innere Kreis rund um Putin habe russische PR-Firmen angewiesen, «Desinformation und staatlich geförderte Narrative als Teil einer Kampagne zur Beeinflussung der US-Präsidentschaftswahlen 2024 zu fördern».\n\nUSA werfen Russland Wahleinmischung vor\n\nSchon bei früheren US-Wahlen hatte sich Moskau nach Angaben offizieller amerikanischer Stellen eingemischt. Nach Ansicht der US-Geheimdienste setzte sich Russland bei der Wahl 2020 für den Republikaner Trump ein und bemühte sich, dem Demokraten Biden zu schaden. Moskau habe den Ausgang der Wahl beeinflussen und Unfrieden im Land säen wollen, hieß es in einem veröffentlichten Geheimdienst-Bericht.\n\nAuch bei der Wahl 2016 hatte Russland nach Überzeugung der US-Sicherheitsbehörden zugunsten des Kandidaten Trump interveniert, um die Demokratin Hillary Clinton auszubremsen. Ein Sonderermittler untersuchte später mögliche illegale Absprachen zwischen Russland und Trumps Team. Dafür gab es keine ausreichenden Hinweise.\n\n© dpa-infocom, dpa:240905-930-223749/2"
        },
        "article32": {
            "headline": "US-Demokratin Harris bekommt Unterstützung prominenter Republikaner",
            "text": "US-Republikaner für Harris Unterstützung aus dem gegnerischen Lager Stand: 07.09.2024 01:53 Uhr\n\nNicht alle Republikaner unterstützen ihren US-Präsidentschaftskandidaten - einige warnen sogar vor Trump. Und manche gehen noch weiter: Sie unterstützen öffentlich seine Gegnerin Harris. Ist das ein Grund zur Sorge für Trump?\n\nSie werde alles tun, um die Rückkehr von Donald Trump ins Weiße Haus zu verhindern, sagt Liz Cheney seit Monaten. Und nun hat die prominente Republikanerin angekündigt, nicht einfach nur nicht für Donald Trump zu stimmen, sondern seine Gegnerin, die Demokratin Kamala Harris, im Rennen ums Weiße Haus zu unterstützen - aufgrund der Gefahr, die Donald Trump darstelle.\n\nDie Tochter von Ex-Vize-Präsident Dick Cheney hat nun außerdem erklärt, dass auch ihr Vater für Kamala Harris stimmen werde. Liz Cheney hatte sich seit dem Angriff auf das US-Kapitol 2021 offen gegen Trump gestellt, verlor deshalb am Ende ihre Führungsrolle in der republikanischen Partei und ihren Sitz im Abgeordnetenhaus. Liz Cheney war eine von nur zwei Republikanern im Untersuchungsausschuss zum Sturm auf das US-Kapitol.\n\nLiz Cheney (links) und ihr Vater (Archivbild aus August 2022): Dick Cheney war unter George W. Bush von 2001 bis 2009 Vize-Präsident der USA.\n\nRepublikaner auf dem Demokraten-Parteitag\n\nDer zweite war Adam Kinzinger. Auch der ehemalige Abgeordnete warnt seitdem vor Trump und unterstützt Harris öffentlich. In der ABC-Late Night Show Jimmy Kimmel sagte Kinzinger vor einigen Tagen, seine Partei sei aus den Fugen geraten und verteidige die Demokratie nicht mehr.\n\nAuf dem Parteitag der Demokraten trat Kinzinger auf, als einer von mehreren republikanischen Rednern. Der ehemalige Vize-Gouverneur von Georgia, Geoff Duncan, nutzte die Bühne, um an seine Parteifreunde und an unentschlossene Wähler zu appellieren, Harris zu wählen. Die republikanische Partei sei nicht mehr bürgerlich oder konservativ. Sie sei chaotisch und verrückt. Das einzige was übrig bleibe, sei Trump fallenzulassen - \"Dump Trump\", so Duncan.\n\nDer republikanische Ex-Kongressabgeordnete Adam Kinzinger spricht auf dem Parteitag der Demokraten. Auch Trumps ehemalige Pressesprecherin Stephanie Grisham hielt dort eine Rede.\n\nBeispiellos - und wahlentscheidend?\n\nAndere Republikaner wie Trumps damaliger Vizepräsident, Mike Pence, verwehren Trump ihre Unterstützung, gehen aber nicht so weit, dazu aufzurufen, Harris zu wählen. Dass namhafte Republikaner wie Liz Cheney das tun, sei absolut beispiellos in den USA, sagt Politikwissenschaftler Chris Edelson von der American University in Washington.\n\nDiese einzigartige Situation könne einen Einfluss auf das Wahlergebnis haben, vor allem mit Blick auf die wahlentscheidenden Swing States, in denen Trump und Harris in Umfragen sehr eng beieinanderliegen, so Edelson. Selbst wenn Liz Cheney in einem Swing State - Bundesstaaten, die mal republikanisch, mal demokratisch wählen und deshalb besonders umkämpft sind - nur ein paar Tausend Wähler beeinflusse, könne das den Unterschied ausmachen. Erfahrungen aus anderen Ländern wiesen darauf hin.\n\nParallelen zur Frankreich-Wahl 2017\n\nPolitikwissenschaftler Edelson erinnert an 2017, als Emmanuel Macron in Frankreich das Präsidentschaftsrennen gegen die Rechtspopulistin Marine LePen gewann. Edelson sieht Parallelen zu der momentanen Situation in den USA. In normalen Zeiten unterstützten Republikaner Republikaner und Demokraten Demokraten. Die Situation jetzt sei ein Signal, das den Wählern sage, dass etwas sehr Ungewöhnliches passiere.\n\n\"Es ist wie in Frankreich im Jahr 2017, als Konservative Macron und seine Partei gegen Le Pen unterstützt haben. Es gibt Anzeichen dafür, dass dies einen Effekt hatte\", so Edelson. Wie groß der Effekt am Ende tatsächlich sein wird, sei nicht vorherzusehen. Aber, wenn er Trump wäre, sagt der Politikwissenschaftler, würde er sich Sorgen machen."
        },
        "article33": {
            "headline": "Fact-Checking the Viral ‘Walz’s for Trump’ Photo",
            "text": "MINNEAPOLIS — A sister of Democratic vice presidential nominee Tim Walz says she doesn’t recognize the people wearing “Nebraska Walz’s for Trump” T-shirts in a photo that is making the rounds on social media. It turns out they are distant cousins.\n\nThe photo shows eight smiling people wearing navy pro-Trump shirts, underneath a \"Trump 2024 — Take America Back” sign. The photo was eventually reposted by former President Donald Trump, who wrote on his Truth Social platform: “It is a Great Honor to have your Endorsement. I look forward to meeting you soon!”\n\nThe photo was first posted on X by Charles Herbster, a former candidate for governor in Nebraska who had Trump’s endorsement in the 2022 campaign. Herbster’s spokesperson, Rod Edwards, said the people in the photo are cousins to the Minnesota governor, who is now Kamala Harris’ running mate.\n\n“The family in the picture are the descendants of Francis Walz, who was brother to Tim Walz’s grandfather,” Edwards said. “They’re all Walzes and spouses.”\n\nThe descendants of Francis Walz confirmed their relationship to Tim Walz in a text message to The Associated Press.\n\n“Shortly after Governor Tim Walz was named the Democrat Party Vice Presidential nominee, our family had a get-together. We had t-shirts made to show support for President Trump and J.D. Vance and took a group picture. That photo was shared with friends, and when we were asked for permission to post the picture, we agreed,” the written statement said.\n\n“The picture is real. The shirts are real. We are the Nebraska Walz family and we are related to Gov. Tim Walz, our grandfathers were brothers. The message on the shirts speaks for itself, “Nebraska Walzs for Trump.”\n\nWalz’s sister, Sandy Dietrich, of Alliance, Nebraska, said she suspected it might be people from that branch of the family. Dietrich and Walz’s father, James Walz, died of lung cancer in 1984 when the future congressman and Minnesota governor was just a teenager. His father had been the school superintendent in Valentine, Nebraska.\n\n“We weren’t close with them. We didn’t know them,” she said.\n\nDietrich declined to comment on their distant cousins’ opposition to her brother and referred to herself and her family as “Democrats for Tim.”\n\n“I know who I’m voting for. That’s all I can control,” she said.\n\nBut Tim Walz’s other surviving sibling is not behind his candidacy.\n\nIn recent days, the New York Post has reported on Facebook comments from the governor’s older brother, Jeff Walz of Freeport, Florida, in which he said of his younger sibling: “The stories I could tell. Not the type of character you want making decisions about your future.” The 67-year-old also wrote that he was “100% opposed to all his ideology” and had thought about endorsing Trump, the Post reported.\n\nIn comments published Wednesday by NewsNation, Jeff Walz said that he was still irked he learned on the radio that his brother would be Harris’ running mate, but that he didn’t intend to influence the political debate and doesn’t want to be involved with anybody’s campaign.\n\nJeff Walz told NewsNation that he and the 60-year-old governor have not spoken since the funeral of their younger brother, Craig Walz, in 2016, aside from a brief phone call last month through their mother. He told NewsNation that what he was referring to in his post by “stories” were from their childhood.\n\n“Nobody wanted to sit with him, because he had car sickness and would always throw up on us, that sort of thing,” Jeff Walz said. “There’s really nothing else hidden behind there. People are assuming something else. There’s other stories like that, but I think that probably gives you the gist of it.”\n\nHe also told NewsNation that he would make no further statements on the subject. He did not immediately return messages left Wednesday by the AP.\n\n—Associated Press writers Randy Herschaft and Jennifer Farrar in New York contributed to this report."
        },
        "article34": {
            "headline": "LICHTMAN PREDICTS HARRIS WIN",
            "text": "THE famed \"Nostradamus of Elections\" has shared his final prediction for who the next president will be.\n\nAllan Lichtman, who accurately predicted Donald Trump's 2016 victory, shared who he think will win the upcoming race - and why.\n\n3 Allan Lichtman reveals Donald Trump will not win the presidential election Credit: Getty\n\n3 The historian explained the reasoning behind his Kamala Harris prediction Credit: Getty\n\n3 Allan Lichtman has a near-perfect prediction record for U.S. presidential elections since 1984 Credit: The U.S. Sun\n\n\"Kamala Harris will be the next president of the United States,\" Lichtman told The New York Times.\n\n\"At least, that's my prediction for this race,\" he added.\n\nThe historian has become famous for his Keys to the White House method which uses 13 point true or false questions about the election race to form his near-perfect predictions.\n\n“The keys absolutely will work. They are the constant northern star of political prediction,” Lichtman said.\n\nIf all 13 questions or statements, also known as \"keys\", are found to be true, then the system predicts than the incumbent will win the election.\n\nSuch questions include if there is a \"charismatic incumbent\" and if there is currently a \"strong short-term economy.\"\n\nWhile Harris is not technically the incumbent president, she can be viewed as such for the sake of Lichtman's system as the current VP in the current presidential branch,\n\nLichtman's key system predicts the incumbent party will win eight or more of the 13 statements are true.\n\nHe said the Harris campaign has eight \"true\" keys, meaning she is predicted to win in a still-close race.\n\n\n\nBut Lichtman has not shared his decision on two of the 13 keys - for if there is a major foreign policy failure, or a foreign policy success.\n\n\n\nThe historian these keys could rapidly change due to the government's handling of the war in Gaza. Lichtman explained that even if these two keys flipped to Trump, he would still not be predicted to win as that would add up to five false answers.\n\nThe historian believes that one of the reasons Harris is likely to win in 2023, is the Democratic Party's move to throw their support behind her and avoid a Primary after Joe Biden dropped out.\n\n\"The Democrats finally got smart and united overwhelmingly behind Vice President Harris,\" he told the Times.\n\nTrump reveals reason he agreed to strict Kamala Harris debate rules as ABC showdown to include muted mics & no audience\n\nThis meant Lichtman the key statement, \"There is no primary contest for the incumbent party nomination,\" is true.\n\nOther true keys have included no third party challenger, a strong short term economy, major policy changes, and stronger long-term economic growth in the last two terms of Biden's tenure.\n\nIn fact, Lichtman's only confident false answers were for the midterm gains key, as the Democrats lost House seats, the incumbency key, as Biden is not running for re-election, and the incumbent charisma key.\n\nLichtman noted two keys that could swing either way.\n\nThe other keys that swung in Harris's favor were no major social unrest and no White House scandal.\n\nThe 13 Keys to the White House HISTORIAN Allan Lichtman predicts the winner of presidential elections by using his algorithm that consists of 13 true or false statements. If six or more statements are false, then the incumbent is set to lose the next election: The incumbent party has more seats in the House of Representatives after the midterm elections compared with the previous set of elections\n\nThere is no primary contest for the incumbent party nomination\n\nThe incumbent president is seeking a second term\n\nThere's no significant third-party challenge\n\nStrong short-term economy\n\nStrong long-term economy\n\nMajor policy change enacted by the incumbent administration\n\nNo social unrest\n\nNo scandal\n\nNo major foreign policy or military failure\n\nMajor foreign policy or military success\n\nCharismatic incumbent\n\nUncharismatic challenger\n\nPOLLS AT ODDS\n\nLichtman's prediction has clashed with the current forecast on prediction market Polymarket.\n\nThe prediction market has placed Trump's odds slightly over Harris at 53%.\n\nOther polling data has painted a tight picture between the two candidates.\n\nHarris has appeared to lead by around two points in the data from RealClear Polling.\n\nThe rivals have split polls in key swing states.\n\nPolling has currently projected Trump to triumph in Arizona and North Carolina.\n\nThis data has also forecast Harris to take Michigan, Georgia, Nevada, and Wisconsin.\n\nTrump and Harris are currently tied in Pennsylvania polls.\n\nPAST PREDICTIONS\n\nLichtman has correctly predicted every U.S. presidential election from 1984 barring one.\n\nIn 2000, he said Al Gore would win the popular vote, which happened, but George W. Bush took the White House after the controversial Supreme Court recount in Florida.\n\nLichtman has stood by his prediction and claimed Gore lost because of improper ballot counting in the state.\n\nAside from this, the scholar's theory correctly predicted the infamous wins of presidents like Ronald Reagan's second term, Barack Obama's triumphs, and Biden's 2020 victory.\n\nLichtman previously told The U.S. Sun that Republicans had a lot to worry about for November's election."
        },
        "article35": {
            "headline": "JD Vance says school shootings are a 'fact of life,' calls for better security",
            "text": "JD Vance says he laments that school shootings are a 'fact of life' and calls for better security\n\nPHOENIX (AP) — Republican vice presidential nominee JD Vance said Thursday that he lamented that school shootings are a “fact of life\" and argued the U.S. needs to harden security to prevent more carnage like the shooting this week that left four dead in Georgia.\n\n“If these psychos are going to go after our kids we’ve got to be prepared for it,” Vance said at a rally in Phoenix. “We don’t have to like the reality that we live in, but it is the reality we live in. We’ve got to deal with it.”\n\nThe Ohio senator was asked by a journalist what can be done to stop school shootings. He said further restricting access to guns, as many Democrats advocate, won’t end them, noting they happen in states with both lax and strict gun laws. He touted efforts in Congress to give schools more money for security.\n\n“I don’t like that this is a fact of life,” Vance said. “But if you are a psycho and you want to make headlines, you realize that our schools are soft targets. And we have got to bolster security at our schools. We’ve got to bolster security so if a psycho wants to walk through the front door and kill a bunch of children they’re not able.”\n\nVance said he doesn't like the idea of his own kids going to a school with hardened security, “but that's increasingly the reality that we live in.”\n\nHe called the shooting in Georgia an “awful tragedy,\" and said the families in Winder, Georgia, need prayers and sympathy.\n\nEarlier this year, Vice President Kamala Harris, the Democratic presidential nominee, toured the bloodstained Florida classroom building where the 2018 Parkland high school massacre happened. She then announced a program to assist states that have laws allowing police to temporarily seize guns from people judges have found to be dangerous.\n\nHarris, who leads the new White House Office of Gun Violence Prevention, has supported both stronger gun controls, such as banning sales of AR-15 and similar rifles, and better school security, like making sure classroom doors don't lock from the outside as they did in Parkland."
        },
        "article36": {
            "headline": "‘What the Hell’: What House Slams Trump’s Incoherent Child Care Response",
            "text": "Former President Donald Trump, a father of five, was asked on Thursday what he would do to lower the cost of child care should he win in November — and his answer was baffling.\n\nFollowing a speech at the Economic Club of New York, Trump was asked what specific legislation he would pursue to help lower the cost of child care for working parents. His response was a lengthy, utterly incoherent word salad that seemed to suggest widespread tariffs would solve the problem.\n\n“It’s a very important issue. But I think when you talk about the kind of numbers that I’m talking about, that, because, look, child care is child care. It’s something you know you have to have it, in this country you have to have it,” Trump said.\n\nThe former president then rambled about taxes on foreign countries. “But when you talk about those numbers compared to the type of numbers I’m talking about by taxing foreign nations at levels that they’re not used to, but they’ll get used to it very quickly,” he added.\n\nDonald Trump’s answer on how he will make childcare more affordable: pic.twitter.com/Hwu7R5aIt6 — Acyn (@Acyn) September 5, 2024\n\nBoth the White House and Vice President Kamala Harris’ campaign mocked the response from Trump.\n\n“If you have any idea what the hell that answer means, you’re a better detective than I am, because these tariffs that he wants to apply across the board would amount to a $4,000 tax increase on working families,” White House Senior Deputy Press Secretary Andrew Bates told MSNBC on Friday.\n\nThe Harris campaign tweeted a clip of the moment from their official X account.\n\nRising costs of child care and child rearing have become a flagship issue for the Harris campaign. The vice president has promised the return of the expanded child tax credit, and a $6,000 tax credit for the parents of newborn children.\n\nBy contrast, the Republican ticket has struggled to produce an answer on child rearing and reproduction that doesn’t sound like it was ripped from a Men’s Rights Activism forum.\n\nOn Wednesday, Trump’s vice presidential candidate J.D. Vance was asked how he would lower the cost of childcare during a Turning Point USA event. He suggested getting family to help, as if struggling Americans haven’t already been doing this to the extent that they are able. Trending Cedric Bixler-Zavala Slams Linkin Park's Emily Armstrong Over Alleged Danny Masterson Support Trump Bashes His Lawyers During Wild E. Jean Carroll Rant Spotify Wins Copyright Infringement Lawsuit Over Eminem Royalties Due to Legal Loophole Rich Homie Quan, Atlanta Rap Staple, Dead at 33\n\n“I think one of the things that we can do is make it easier for families to choose whatever model they want, right? So one of the ways that you might be able to relieve a little bit of pressure on people who are paying so much for day care is … maybe grandma and grandpa [want] to help out a little bit more, or maybe there’s an aunt or uncle that wants to help out a little bit more. If that happens, you relieve some of the pressure on all the resources that we’re spending on day care,” Vance responded.\n\nKirk: What can we do about lowering the cost of daycare? pic.twitter.com/YIS68cXKw4 — Acyn (@Acyn) September 5, 2024\n\nThe response echoed past remarks from Vance where he agreed that the “whole purpose” of post-menopausal women is to help other women raise their children."
        },
        "article37": {
            "headline": "Trump Tries to Convince America He’s Not Weird and Totally Normal at Town Hall",
            "text": "Donald Trump proved to be exceptionally prickly when discussing his opponent Vice President Kamala Harris‘ running mate, Minnesota Gov. Tim Walz, during a town hall in Harrisburg, Pennsylvania.\n\nWhen speaking to Sean Hannity for the Fox News event, Trump boasted about reports that the governor’s family members had endorsed him. Soon, however, the former president — who has grown increasingly frustrated over Democrats’ “weird” line of attack aimed at him and his VP pick, J.D. Vance — took the opportunity to air out his grievances over the highly effective trash-talking.\n\n“J.D. is not weird. He’s a solid rock. I happen to be a very solid rock. We’re not weird. We’re other things, perhaps, but we’re not weird,” Trump insisted.\n\n“But he is a weird guy. He walks on the stage, there’s something wrong with that guy, and he called me ‘weird,'” he continued, fixating on Walz. “And then the fake-news media picks it up. That was the word of the day. ‘Weird. Weird. Weird.’ They were all going — but we’re not weird guys; we’re very solid people who want their country to be great again. It’s very simple.”\n\nhttps://twitter.com/KamalaHQ/status/1831503308067950722\n\nSources previously told Rolling Stone that Trump has complained to advisers and confidants about how much attention the Democrats and Team Harris’ “weird” attacks have garnered in the media — including on his generally friendly network of choice, Fox News. Trending Rich Homie Quan, Atlanta Rap Staple, Dead at 33 Linkin Park Unveil Emily Armstrong as New Co-Vocalist, Announce 2024 World Tour and Album Spotify Wins Copyright Infringement Lawsuit Over Eminem Royalties Due to Legal Loophole Ron DeSantis, Heritage Foundation Team Up to Kill Florida Abortion Measure\n\nLast month, Trump even went so far as to accuse Harris’ campaign of colluding with the media to call him “weird.” The former president baselessly claimed, “They’re weird! You know what they do? They work with the press on coming up with the sound bite.”\n\nAs Harris’ campaign quickly gains momentum — scooping up major endorsements and millions in fundraising dollars — Trump has responded by freaking out over her crowd sizes and increasing his hateful rhetoric."
        },
        "article38": {
            "headline": "Details on Georgia school shooting suspect. And, Russian media hired U.S. influencers",
            "text": "Details on Georgia school shooting suspect. And, Russian media hired U.S. influencers\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\n\n\nToday's top stories\n\nThe FBI had prior warning about the 14-year-old accused of fatally shooting two students and two teachers and injuring nine others at Apalachee High School in Winder, Ga., the agency said on X. Authorities received several anonymous tips in May 2023 about online threats to commit a school shooting at an unidentified location and time. Those threats contained images of guns. The FBI says it identified and interviewed the then-13-year-old suspect and his father. The father said they had hunting guns but the teen didn’t have unsupervised access to them. The boy denied making the online threats. The sheriff’s office alerted local schools to monitor him, but there was no probable cause for arrest or additional law enforcement action at the time. Georgia Bureau of Investigation Director Chris Hosey said the teen would be charged with murder and tried as an adult.\n\ntoggle caption Christian Monterrosa/AFP via Getty Images\n\nLawyers for former President Donald Trump and the Justice Department are set to appear in a federal courtroom today for what could be the last hearing in his election interference case before the November election. This year, voters will decide the winner of the presidency — and, by extension, Trump’s legal fate. A D.C. grand jury indictment accused Trump of actions resulting in the violent siege at the U.S. Capitol on Jan. 6, 2021. If he reclaims the White House, he’s expected to direct new Justice Department leaders to drop the landmark case.\n\n\n\nSponsor Message\n\n🎧 Trump claims the new indictment is election interference, saying it violates a DOJ policy about taking big steps too close to an election, NPR’s Carrie Johnson tells Up First. Judge Tanya Chutkan will need to figure out how to draw the line between which of Trump’s actions in the White House were part of his presidential duties and which were made as a candidate for office. Johnson says there’s no way this will be resolved before the election and it might not go to trial until next year due to the possibility of the Supreme Court's involvement.\n\nFederal officials are accusing Russia of using unwitting right-wing American influencers to spread Kremlin propaganda ahead of the November presidential election. Yesterday, the Justice Department charged two employees of RT, Russian state media, in the scheme. Investigators say they helped publish online videos that racked up 16 million views on YouTube and other social media platforms. The staffers named in the indictment are Kostiantyn Kalashnikov and Elena Afanasyeva.\n\n\n\n🎧 The goal seems to be amplifying topics like immigration, inflation and undermining support for Ukraine without indication that RT was behind the videos, NPR’s Shannon Bond says. The indictment says the employees funneled nearly $10 million to a Tennessee company to make the alleged scheme work. The company was not named, but details match one called Tenet Media. The Russian employees allegedly had a good deal of control over the content, allowing them to push for very specific angles that echoed Kremlin narratives.\n\nSponsor Message\n\nToday's listen\n\ntoggle caption Terry Wyatt/Getty Images North America\n\nGrammy-winning folk duo Gillian Welch and David Rawlings have made a career singing about hard times. Now, they’re living one of their songs. Four years ago, a tornado destroyed their Nashville recording studio, flipping their career and lives upside down. But they’ve turned disaster into inspiration with their new album Woodland, named after their once-shattered studio. “To not go crazy we had to actually make some art or we would just forget what type of people we were,” Welch said on Morning Edition.\n\n\n\n🎧 Listen to some of their new music and learn what inspired them.\n\nPicture show\n\ntoggle caption David Herasimtschuk\n\nFor the last decade, photographer David Herasimtschuk has captured images of forests across the Pacific Northwest, documenting the inhabitants of the last remaining old-growth ecosystems. From salamanders and salmon to bears and mountain lions, his photos illustrate not only the beauty of the forests and the creatures that call it home but also the symbiotic relationships that are vital to the planet’s welfare.\n\n\n\n📷 See photos of America’s last remaining old-growth forests and read about Herasimtschuk's efforts to educate people about the importance of its preservation.\n\n3 things to know before you go\n\ntoggle caption Frank Franklin/AP/AP\n\nAustralian breakdancer Raygun has apologized for the backlash her Paris Olympic Games performance brought against the breakdancing community. Former Rep. Liz Cheney, a Wyoming Republican whose criticism of Trump cost her her congressional seat, said she will be voting for Vice President Harris in the November elections. Diana Oganesyan went viral after an air siren, used to warn Ukraine of Russian attacks, began to wail and the young singer spontaneously started to harmonize with the alarm.\n\nThis newsletter was edited by Suzanne Nuyen."
        },
        "article39": {
            "headline": "How will the US economy shape its presidential election?",
            "text": "With two months to go before the US presidential election, the candidates are outlining their vision for the world’s biggest economy.\n\nDemocratic candidate Kamala Harris says she plans to raise taxes on corporations and the wealthy while the Republican hopeful Donald Trump says he’ll slash what he says is unnecessary federal spending.\n\nThe economy and inflation are top priorities for voters as many are struggling to make ends meet.\n\nSo how will the state of the economy play into the election in November?\n\nPresenter: James Bays\n\nGuests\n\nEric Ham – political analyst\n\nRobert Scott – independent economist\n\nDimitris Valatsas – chief economist and founding partner at Aurora Macro Strategies"
        },
        "article40": {
            "headline": "The guessing game over Kamala Harris’s foreign policy",
            "text": "is a senior correspondent at Vox covering foreign policy and world news with a focus on the future of international conflict. He is the author of the 2018 book, Invisible Countries: Journeys to the Edge of Nationhood , an exploration of border conflicts, unrecognized countries, and changes to the world map.\n\nUkrainian President Volodymyr Zelenskyy and US Vice President Kamala Harris shake hands at the end of a press conference at the Munich Security Conference on February 17, 2024. Tobias Schwarz/AFP via Getty Images\n\nIs Vice President Kamala Harris a “human rights hawk,” who would use American power to promote democracy and freedom abroad? Or is she a “pragmatic internationalist” who would back gingerly away from American hegemony?\n\n\n\nIs she poised to end an era of American hubris and restore humility to our foreign policy? Or does her forceful rhetoric on America’s role in the world reveal an “inner Reagan”?\n\nTwo months out from the presidential election, there’s rampant speculation about what a “Harris doctrine” for foreign policy could look like, but it often seems to reveal more about what the person doing the speculating wants (or doesn’t want) in the next president than any particular worldview articulated by Harris.\n\nIt’s not that the vice president doesn’t have a track record to examine. While some coverage has portrayed her as something of a foreign-policy neophyte, she would come into office with more global experience than Bill Clinton, George W. Bush, Barack Obama, or Donald Trump had.\n\nAs vice president, she has met with dozens of world leaders, represented the US at global gatherings, and attended the president’s daily intelligence briefings. In her Democratic National Convention address, she touted the fact that she had been the one to brief Ukrainian President Volodymyr Zelenskyy on US intelligence about the looming Russian invasion in Munich just days before it occurred in 2022.\n\nThe administration has also noted her role in the recent prisoner swap with Russia. She also was involved in US efforts to strengthen alliances in Southeast Asia, particularly with the Philippines. And though she was not the “border czar” she’s sometimes portrayed as in attack ads, she did lead the administration’s efforts to address the “root causes” of migration through aid to Central America.\n\nWhat’s harder to pin down is how she might differ from the Biden administration, which is what all the “Harris doctrine” speculation is trying to pin down. When it comes to that, the analysis often comes down to — to use the buzzword of the moment — vibes.\n\nSame message, new tone\n\nIn a recent Time feature on Harris’s record on Ukraine, Ukrainian officials acknowledged she had been engaged on the issue and showed sympathy for the country’s plight, but one official described it as feeling like “formal sympathy, following protocol.”\n\nIn a recent episode of The Ezra Klein Show podcast, the host speculated that as the child of immigrants with a more global perspective, Harris “does not have that identification” with Israel that Americans of Joe Biden’s generation do. But that’s not quite how Harris has described her own upbringing. In a 2017 speech to the right-leaning American Israel Public Affairs Committee (AIPAC) she reminisced that as a child in the Bay Area, she collected donations for the Jewish National Fund to plant trees in Israel. In 2019, the Jewish Telegraphic Agency described her Senate record as “more AIPAC than J Street,” referring to the more left-leaning “pro peace” lobbying group.\n\nWhen it comes to how Harris might differ, even subtly, from Biden, perhaps no issue, foreign or domestic, has gotten more attention than the war in Gaza.\n\nHalie Soifer, who worked as national security adviser to Harris in the Senate and is now the director of the Jewish Democratic Council of America, told Vox that when it comes to policy on Israel and Gaza, there is little daylight between the two.\n\n“I think the policy will not change,” she said. “What we have seen is some distinction when it comes to the way they speak about the conflict, with Vice President Harris not only reiterating her commitment to Israel and its security, but also expressing a larger degree of empathy with innocent Palestinian civilians.”\n\nThis was reflected in pointed remarks Harris made calling for a ceasefire at a civil rights commemoration in Selma, Alabama, in March (remarks that were reportedly watered down by administration officials) as well as in her convention speech. As my colleague Zack Beauchamp wrote, that speech did not differ particularly from Biden’s talking points but did, rhetorically at least, present “Palestinian aspirations for self-determination as the moral climax of her discussion of the issue.”\n\nSlate’s Fred Kaplan reports that sources close to Harris say she “privately disagrees with [Biden’s] formulation of world politics as a contest between democracy and autocracy … and sees that as oversimplifying and even misleading, given the kinds of allies that we’re sometimes forced to choose.” The Biden administration has been criticized by some observers for paying attention to the “global south” mainly in the context of competition with Russia and China.\n\nPerhaps reflecting some desire to move beyond this framing, Harris remarked at the Munich Security Conference earlier this year that when visiting countries in Africa, she was constantly asked, “‘Are you here because of China?’ And my answer was, ‘No, we are here because of the people on the continent of Africa.’”\n\nWhy campaign promises can’t tell us much about Harris’s real policies\n\nIt’s also quite possible that Harris’s worldview and foreign policy rhetoric are simply evolving. The senator who, in 2020, said, “I unequivocally agree with the goal of reducing the defense budget and redirecting funding to communities in need” is now the vice president who vows to “ensure America always has the strongest, most lethal fighting force in the world.”\n\nUltimately, campaign rhetoric will only tell you so much about how a president will conduct foreign policy. Some analysts have noted that, as a senator, Harris was in favor of cutting support for Saudi Arabia’s war in Yemen, and called for “fundamentally reevaluating” the US-Saudi relationship as a candidate in 2020. But then again, Biden promised on the campaign trail to make Saudi Crown Prince Mohamed Bin Salman a “pariah” before putting cooperation with the country at the center of his Middle East policy.\n\nIt’s not just that campaign talk is cheap, it’s that, as the noted international relations theorist Mike Tyson put it, everyone has a plan until they get punched in the mouth.\n\nGeorge W. Bush came into office promising a “humble” foreign policy that eschewed nation-building crusades. 9/11 changed that.\n\nObama first distinguished himself as an opponent of US militarism in the Middle East but will be remembered for expanding the US drone war, the raid that killed Osama Bin Laden, and helping to overthrow the government of Libya.\n\nBiden’s foreign policy legacy will be determined in large part by his response to the Russian invasion of Ukraine and the October 7 attacks.\n\n“Foreign policy priorities, in every administration, are largely dictated by events,” Soifer said.\n\nIf there is a “Harris doctrine,” we’ll learn what it is only if we see her as president."
        },
        "article41": {
            "headline": "Doug Emhoff Addresses Donald Trump’s Attacks on Kamala Harris: ‘It’s a Distraction’",
            "text": "Doug Emhoff made his first appeared as a guest on Jimmy Kimmel Live last night and took the opportunity to respond to Donald Trump‘s many attacks on his wife Kamala Harris.\n\nHost Jimmy Kimmel jokingly asked Emhoff, “What was your reaction when your wife turned Black? Were you surprised?”\n\n“All that stuff, you know, it’s a distraction,” Emhoff replied. “We can joke about it, but it’s literally a distraction, so all the insults, all the things coming at her, coming at me, coming at our family, it’s really a distraction from what they are trying to do.”\n\nEmhoff told Kimmel that Harris’ presidential campaign has completely changed their lives. “It’s like being shot out of a cannon,” he said. “That day when she got the call and I of course was stuck here in LA and didn’t hear about it for 30 or 40 minutes, since that moment it’s just been hustle, hustle, hustle.” He added that there’s “almost no happy couple time anymore” because Harris is focused on winning the election.\n\nElsewhere in the 15-minute interview, Emhoff talked about growing up in Los Angeles, working at McDonald’s in high school, and what it’s been like being the country’s first-ever Second Gentleman. He confirmed that he has not been part of Harris’ debate prep nor her selection of Tim Walz as her running mate.\n\n“The last thing I am going to do is give her advice on something she is really awesome at,” he told Kimmel. “If she asks me something I will let her know what I think, but we really try to keep that separate because we really want to be there for each other, our family, our kids, all that stuff.”\n\nEmhoff did note that he expects Harris to win the upcoming debate with no issues. “As she is preparing for the debate, somebody asked me, ‘Well what is it like debating her? You are both trial lawyers. Have you ever?'” Emhoff recounted. “I said, ‘No, I have never won one.’ And so I am looking forward to this.” Trending Cedric Bixler-Zavala Slams Linkin Park's Emily Armstrong Over Alleged Danny Masterson Support Trump Bashes His Lawyers During Wild E. Jean Carroll Rant Rich Homie Quan, Atlanta Rap Staple, Dead at 33 Spotify Wins Copyright Infringement Lawsuit Over Eminem Royalties Due to Legal Loophole\n\nEmhoff also discussed his role as Second Gentleman, in which he has become an advocate for gender equality and has stood up against the rise of anti-Semitism. “I was a Hollywood lawyer,” he said. “I was an entertainment lawyer right here in this community for 30 years. I loved it, every minute of it, and it was a little jarring to go from that to get put on the Biden Harris ticket and spend all that time getting them elected. Then it’s like, ‘Okay what do you do now?'”\n\nHarris and Trump will hold their first debate in Philadelphia on Sept. 10. The debate will air on ABC News."
        },
        "article42": {
            "headline": "Trump, Harris begin post-Labor Day sprint...",
            "text": "ANALYSIS — Former President Donald Trump and Vice President Kamala Harris described each other as a threat to voters’ wallets and constitutional rights during their first campaign stops since Labor Day.\n\nTrump, the Republican nominee, opted for the bigger splash, taping a town hall in swing-state Pennsylvania that aired in prime time on Fox News. (Though billed as a town hall, only the host asked questions, not voters seated in the New Holland Arena, which was lined with sections of empty seats.)\n\nHarris made a campaign stop in New Hampshire, a state the Democratic nominee has won every cycle since 2004.\n\nThe nominees were back on the campaign trail as new polling further solidified both camps’ assessments that the race likely will be extremely close in November.\n\nCNN-SSRS polling released Wednesday morning showed that neither Trump nor Harris has a clear path to the White House, with both candidates running close in the battleground states that likely will decide the election.\n\nHarris led in both Georgia and Nevada by a single point, 48 percent to 47 percent. They were tied in Pennsylvania. Harris had larger leads in Wisconsin (6 percentage points) and Michigan (5 points). Trump led 49 percent to 44 percent in Arizona, according to the polling, which had a 4.9 percent margin of error.\n\nHere are four takeaways from their campaign stops, with 60 days to go until Election Day.\n\n‘We have a little lead’\n\nDespite the CNN polling released earlier Wednesday, Trump continued to dismiss polls that suggest the race has swung since President Joe Biden ended his bid for another term.\n\n“I hear the polls are close, and we have a little lead. I just find it hard to believe. First of all, they’ve been so bad,” Trump told Fox commentator and host Sean Hannity.\n\n“They’ve done such a bad job. But that’s why the enthusiasm is so bad,” Trump said, falsely suggesting that there has been no surge in excitement among Democratic voters since Harris ascended to the top of the ticket.\n\nBut when Republican-leaning polling firms like Rasmussen release surveys putting him comfortably ahead nationally, Trump pushes them hard on social media. What’s more, the former president appeared to miss an opportunity to appeal directly to grieving voters in what Inside Elections with Nathan L. Gonzales calls a toss-up state after a 14-year-old student killed four people Wednesday at a high school in Georgia.\n\n“We had this shooting today in Georgia,” Hannity noted at the start of the program. Trump replied, “Right.” And when Hannity said Americans were sending prayers to the families and victims, Trump said nothing. Georgia is among the key swing states that analysts expect will decide the election.\n\n‘How nice our criminals are’\n\nAmid calls from some Republican lawmakers for Trump to stick to several policy issues — chiefly illegal immigration and the Biden economic record — the former president got one of his biggest applause lines on the former.\n\n“We have to do the largest deportation in … history,” Trump told Hannity, with the Fox commentator calling those who have crossed the U.S.-Mexico border illegally “unvetted Harris-Biden illegal immigrants.” The crowd in Harrisburg, Pa., roared.\n\nTrump continued to call Harris “the border czar, whether you like it or not” — a title White House officials have said Biden never gave his No. 2; they contend he put her in charge of diplomatic efforts to address the root causes of illegal border crossings.\n\n“Even if you don’t want to use that term, she was in charge of the border. It’s the worst border in the history of the world,” Trump said, ignoring federal law enforcement agencies’ data that White House and Harris campaign officials have pointed to for weeks showing that border crossings have been declining. In fact, in late June, administration officials said illegal crossings were down 40 percent since Biden took office in January 2021.\n\nHannity did not ask Trump about Harris’ sharp criticism of the effort he spearheaded that led to Republican senators tanking an immigration and border package that one of the most conservative Republicans, Sen. James Lankford of Oklahoma, had negotiated with Democrats and the White House.\n\nTrump’s actions to sink that deal have become Harris’ go-to retort when Trump and other Republicans slam her with the “border czar” line.\n\nTrump, who is a convicted felon awaiting sentencing in a New York business fraud case, falsely described the United States as being overrun by illegal migrants who were murderers, drug dealers and “woman traffickers” back home. Then came one of the night’s oddest lines, especially from Trump, who has said negative things about those convicted of violent crimes in major cities with Democratic local and state officials.\n\n“Our criminals are nice people by comparison,” he said to cheers. “We’re showing how nice our criminals are.”\n\n‘Opportunity economy’\n\nHarris used her campaign event in North Hampton, N.H., to announce her latest economic proposal amid Republican criticism — including from Trump — that she had both been complicit in what they call poorly crafted policy under Biden and her lack of a plan of her own.\n\nThe Democratic nominee laid out a proposal to expand the small-business tax deduction from $5,000 to $50,000, part of what she described as “building an opportunity economy.”\n\n“I believe America’s small businesses are an essential foundation to our entire economy. Think about it … small businesses in our country employ half of all private-sector employees,” she said. “They generate revenue that helps pave our roads and pay our teachers.”\n\nIn a clip-and-save moment, she also set a goal of 25 million small-business applications during her four-year term, if elected in November. Harris described her plan as “essentially a tax cut for starting a small business.”\n\nThe vice president’s campaign touted analyses from financial firm Goldman Sachs that estimated, should Democrats sweep both chambers of Congress and the White House, job growth would be 10,000 better per month than if Trump won with a divided Congress — and 30,000 higher per month under a GOP sweep.\n\nBut the Trump campaign described her announcement as a “sham small business ‘plan.’” In a statement, his campaign contended that “Kamala’s $20 billion plan is just another cog in the wheel of her multi-trillion-dollar tax-and-spending scheme that would add trillions to the debt and drive costs up even higher.”\n\nHarris is attempting to pivot to the middle, while Trump’s campaign wants to paint her as a progressive pretending to be a populist.\n\n‘They don’t trust women’\n\nHarris’ stop in the Granite State was not all about her small-business proposals — she also again went right after Trump.\n\nA rally-goer appeared to yell out, “Lock him up,” referring to the once-convicted and twice-impeached Trump’s legal cases. Harris did not venture into the legal realm, however.\n\n“The courts are going to handle that, and we will handle November,” she fired back, to loud applause. “How about that?” Later, she accused Trump of aiming to “terminate the Constitution.”\n\nShe accused the former president of “gaslighting” voters on the end of federal abortion rights, noting that he had appointed three of the Supreme Court’s six right-leaning justices who voted to do so.\n\nShe alleged that Trump would, if elected, create a “national anti-abortion coordinator, which would force states … to report on women’s miscarriages and abortions,” she said, adding of Republicans: “They don’t trust women.”\n\n“Ours is a fight for the future,” she said. “And it is a fight for freedom.”\n\nTrump often refers to “radical” and “extreme” Democrats. Harris wants to flip that charge on him."
        },
        "article43": {
            "headline": "Kamala Harris is pro-business, Mark Cuban says",
            "text": "In This Story GS\n\nVice President Kamala Harris is looking to be a business-friendly presidential candidate, at least when compared with President Joe Biden.\n\n\n\nNvidia stock is navigating one of its most turbulent weeks ever CC Share Subtitles Off\n\nEnglish view video Nvidia stock is navigating one of its most turbulent weeks ever\n\nNvidia stock is navigating one of its most turbulent weeks ever CC Share Subtitles Off\n\nEnglish Nvidia stock is navigating one of its most turbulent weeks ever\n\nBillionaire businessman Mark Cuban said in an interview with CNBC Thursday that Harris, despite trying to remain respectful of Biden as she campaigns for the upcoming election, is a markedly different candidate from the current president.\n\nAdvertisement\n\n“Kamala Harris is pro-business,” Cuban said. “This is Kamala Harris’ campaign, it’s not Joe Biden’s campaign.”\n\nAdvertisement\n\nWhen it comes to business, “she’s going center 100%,” he added.\n\nAlthough Harris is “starting from the Biden plan as a starting point,” Cuban said, “that’s not necessarily her ending point.”\n\nAdvertisement\n\nOn Wednesday, the Democratic presidential hopeful unveiled a proposed 28% tax on long-term capital gains for households making $1 million or more a year — the top 0.3% of all households in the country. That falls well below the 39.6% rate Biden laid out in his 2025 fiscal year budget. These tax plans would levy a charge when investors profit profit from the sale of capital assets, like stocks or bond.s\n\nBiden had also proposed a minimum tax on unrealized capital gains, or unsold assets that have increased in value. That is where Biden and Harris’ policies diverge even further, according to Cuban.\n\nAdvertisement\n\nCuban underscored that under Harris, “it’s not going to happen.” He said that in several discussions with the Harris campaign, they have underscored that that is not the direction the vice president is looking to head in.\n\n“I’m not going to speak for the vice president, she makes the final decision,” Cuban told CNBC. “I’m talking to these folks three, four times a week, having back-and-forth conversations, and their verbatim words to me is, ‘That’s not where we want to go.’”\n\nAdvertisement\n\nHarris would also push to raise the corporate tax rate to 28% from its current 21%, Harris campaign spokesman James Singer told NBC News last month — in contrast with Republican presidential nominee Donald Trump’s promises to lower the rate.\n\nThe vice president’s economic plan includes proposals to restore the expanded Child Tax Credit, create a new tax credit that would give low-income or middle-income families with a newborn child $6,000, and slash taxes by up to $1,500 for low-income individuals. She has also pledged to take aim at high prescription drug prices, expensive grocery bills, and Wall Street’s homebuying spree.\n\nAdvertisement\n\nGoldman Sachs said in a research note that a Harris victory and Democratic sweep would be a boon to the U.S. economy, thanks to new spending and tax credits aimed at middle-income Americans.\n\n— Will Gavin contributed to this article."
        },
        "article44": {
            "headline": "Putin says Russia will ‘support’ Harris in US election",
            "text": "NewsFeed Putin says Russia will ‘support’ Harris in US election\n\nRussian President Vladimir Putin said, in an interview, that he will support US Vice President Kamala Harris in the November presidential election."
        },
        "article45": {
            "headline": "Republican Liz Cheney backs Harris, citing ‘danger’ of Trump win",
            "text": "Cheney, one of Trump’s fiercest critics after 2021 assault on US Capitol, joins other Republicans in supporting Harris.\n\nFormer Republican Congresswoman Liz Cheney has said she is backing Democratic presidential nominee Kamala Harris for president in the November election.\n\nCheney said on Wednesday she would vote for Harris “because of the danger that Donald Trump poses” as she cited her credentials as “a conservative, as someone who believes in and cares about the constitution”.\n\nShe became one of the fiercest critics of Republican contender Trump after his alleged inaction at the time and for fanning the flames when thousands of his supporters stormed the US Capitol on January 6, 2021, in an effort to overturn his election defeat.\n\nCheney came out for Harris at an event at Duke University in North Carolina, according to a video of her comments, posted on social media platform X.\n\nOnce considered Republican royalty, the daughter of former Vice President Dick Cheney was ostracised by the party after co-chairing the congressional panel investigating the assault on the Capitol.\n\nShe paid the price by losing her seat in Congress to a Trump-backed challenger in her 2022 Republican primary in Wyoming.\n\nHarris’s campaign chair Jen O’Malley Dillon said in a statement on Wednesday night: “The Vice President is proud to have earned Congresswoman Cheney’s vote. She is a patriot who loves this country and puts our democracy and our Constitution first.”\n\nCheney joins other Republicans, like fellow January 6 committee member Adam Kinzinger and Denver Riggleman, both former congressmen, in supporting Harris.\n\nMore than 200 alumni of the Bush administration and former Republican presidential campaigns of the late Senator John McCain and Senator Mitt Romney also announced their endorsement of Harris last week.\n\nAsked for comment, Trump campaign spokesman Steven Cheung responded: “Who is Liz Cheney and what does she do?”"
        },
        "article46": {
            "headline": "'Mythic Quest' star Rob McElhenney brings hope for season 4",
            "text": "Fans of the Apple TV+ comedy \"Mythic Quest\" waiting for the fourth season have been given hope it will still return, thanks to one of its stars, Rob McElhenney.\n\n\"Mythic Quest\" has so far aired three seasons on Apple TV+. But, while it was renewed for a fourth season in late 2021, there has been little clue of when it would air again.\n\nStar Rob McElhenney did hint at the show's return on X, responding to a fan's query. When asked if there was going to be a fourth season \"Or can I cancel my apple subscription?\" the star offered they should \"Maybe hold onto it.\"\n\nMcElhenney also shared a picture where he posed with costars in front of the logo of the show.\n\nThe third season \"Mythic Quest\" aired on Apple TV+ starting in November 2022. It is unclear when the fourth season itself will be made available for viewing, or for that matter, how far along production is.\n\nIn December of the same year, it was reported a spinoff titled \"Mere Mortals\" was being worked on. The spinoff was set to take the concept of episodes like \"Dark Quiet Death\" or \"Backstory!\" to step outside the usual plot to tell other stories.\n\nThe spinoff is written by Ashly Burch, John Howell Harris, and Kate McElhenney, with Ubisoft, Lionsgate, and 3Arts Entertainment producing it."
        },
        "article47": {
            "headline": "‘Russia backs Kamala Harris’: Putin’s history of US election ‘endorsements’",
            "text": "For two decades, Russian President Putin has stirred the US election pot, including by signalling support for candidates.\n\nRussian President Vladimir Putin on Thursday said Moscow would back US Vice President Kamala Harris, the Democratic Party’s nominee, in presidential elections in November.\n\nThe nature of Putin’s comments suggests he was joking, or trolling the Harris campaign, at a time when the US government under the Joe Biden administration has levelled new allegations that Russia is seeking to interfere in the November vote, to favour former President Donald Trump.\n\nYet whatever Putin’s motivations for the comments on Harris, they are the latest iteration of the Russian leader’s attempts to inject Moscow into the US electoral process.\n\nThis is not the first time Putin has thrown his support behind a US presidential candidate. Putin himself has been in Russia’s top job since 2012. He was also president between 2000 and 2008.\n\nAl Jazeera recaps two decades of the Russian president’s tongue-in-cheek meddling in US elections.\n\nDid Putin endorse Harris?\n\nAt an economic forum in the Russian Far East port of Vladivostok, Putin wryly said that current President Joe Biden was his “favourite”.\n\nSince Biden has dropped out of the race and endorsed Harris, she was Putin’s next best bet, the Russian leader teased.\n\nHe added that Harris has an “expressive and infectious laugh”, which indicates “she’s doing well”. The audience broke into scatted laughter as he said that if Harris is doing well, maybe she would not impose sanctions on Russia.\n\n“I don’t know if I’m insulted or he did me a favour,” Republican challenger Trump responded at a campaign stop at the New York Economic Club on Thursday.\n\nPutin’s comments came a day after the US Department of Justice accused Russian-owned state broadcaster RT of campaigning to sway the US vote, indicting two Russian journalists.\n\nBut this isn’t the first time that Putin has stirred the pot of US domestic politics.\n\n2004: Putin endorses Bush\n\nIn October 2004, Putin endorsed Republican incumbent President George W Bush. He said that if Bush lost it would lead to the “spread of terrorism” globally.\n\nBush had been facing criticism from Democratic challenger John Kerry for not adequately tackling “terrorism”.\n\nThis was amid the war on Iraq which started in 2003 after the US under Bush invaded the country.\n\nBush defeated Kerry in the 2004 race and was re-elected as president.\n\n2008: Russia leans towards Obama win\n\nWhile Putin did not make a clear endorsement in the 2008 US presidential race, experts were clear that a win for Democrat Barack Obama over Republican John McCain was Russia’s preferred outcome.\n\nWhile both Obama and McCain held a harsh stance on Russia, Kremlin officials believed that under Obama, a newcomer at the time, US-Russia relations could start with a clean slate unlike under Cold War veteran McCain.\n\nAfter being in office for two terms between 2000 and 2008, Putin was constitutionally barred from assuming the role of president for a third consecutive term.\n\nHence, Dmitry Medvedev rose to the top job with Putin as his premier. However, it was widely believed in Russia and globally at the time that Putin continued to hold real power in Russia. It was said that Putin and Medvedev ruled in “tandemocracy”.\n\nObama won the 2008 election.\n\n2012: Putin praises Obama\n\nAhead of the 2012 US presidential race, in which Obama was taking on Republican challenger Mitt Romney, Putin told Russian state media that Obama was “an honest person who really wants to change much for the better”.\n\nRomney had deemed Russia the top “geopolitical foe” of the US, something Putin said Romney was “mistaken” about, during the same interview.\n\nObama defeated Romney in the 2012 election.\n\n2015: Putin deems Trump ‘outstanding and talented’\n\nAhead of the 2016 US election, Putin spoke highly of Trump during an annual news conference with reporters.\n\n“He is a bright and talented person without any doubt,” he said, adding that Trump is “outstanding and talented”.\n\nTrump was up against Democratic challenger Hilary Clinton in the election.\n\nAfter Trump’s election victory, Putin said Trump was a “clever man” who would “quickly understand” his role in office.\n\n2016: US blames Russia for DNC leaks, election interference\n\nIn July 2016, Democratic National Committee (DNC) emails were hacked and leaked, showing preferential treatment to Clinton, angering supporters of her primary Democatic opponent Bernie Sanders.\n\nThe US government formally placed the blame for the hack on Russia in a joint statement by the Department of Homeland Security and the Office of the Director of National Intelligence.\n\nPutin denied Russia’s role in the DNC hack but said the leaks themselves were important. “The important thing is the content that was given to the public,” he said.\n\nThe US also accused Russia of a larger election interference programme aimed at defeating Clinton and helping Trump come to power, involving troll farms that amplified messaging tailored against the Democrats.\n\n2019: Putin jokes Russia will meddle in 2020 election\n\nIn October 2019, on a panel at Russian Energy Week, Putin was asked if he would interfere with the 2020 US election.\n\n“I’ll tell you a secret: Yes, we’ll definitely do it. Just don’t tell anyone,” the Russian president joked in a fake whisper.\n\nHe then said his working relationship with Trump did not mean that he had any influence on the domestic politics in the US. He insisted that he did not interfere in the 2016 US election and that he was dealing with issues in his own country.\n\n“We have our own problems,” he said."
        },
        "article48": {
            "headline": "Kamala Harris just got the endorsement of 88 business leaders, ranging from Yelp's CEO to Magic Johnson",
            "text": "In This Story BOX MRK YELP BX SBUX SNAP LAZ PEP\n\nVice President Kamala Harris’ presidential candidacy just got endorsed by almost 90 current and former top executives across corporate America, including high-profile CEOs and several longtime Democratic donors.\n\n\n\nNvidia stock is navigating one of its most turbulent weeks ever CC Share Subtitles Off\n\nEnglish view video Nvidia stock is navigating one of its most turbulent weeks ever\n\nNvidia stock is navigating one of its most turbulent weeks ever CC Share Subtitles Off\n\nEnglish Nvidia stock is navigating one of its most turbulent weeks ever\n\n“Her election is the best way to support the continued strength, security, and reliability of our democracy and economy,” the leaders wrote in a letter shared with CNBC. “With Kamala Harris in the White House, the business community can be confident that it will have a President who wants American industries to thrive.”\n\nAdvertisement\n\nThe group includes a number of high-profile executives of public companies, including Snap Chairman Michael Lynton and Yelp CEO Jeremy Stoppelman. Other signatories include Chris Larsen, who helped found the blockchain platform Ripple, and Box CEO Aaron Levie.\n\nAdvertisement\n\nThe majority of the letter’s signatories are former business executives, from former Blackstone CEO Tony James and Lazard CEO Peter Orszag to the many former heads of public companies. Executives who once led Pepsico, Merck, Starbucks, PayPal, and Ford all made the list.\n\nAdvertisement\n\nA number of donors aligned with Harris — or the Democratic party more broadly —also signed the letter, including Laurene Powell Jobs, NBA Hall of Famer Magic Johnson, former Walt Disney Studios chairman and Dreamworks CEO Jeffrey Katzenberg, and Facebook co-founder Dustin Moskovitz.\n\nSeveral of these people have already gone to bat for Harris in the almost two months since she became the defacto Democratic nominee. Cost Plus Drugs Co. founder and Dallas Mavericks minority owner Mark Cuban and Reid Hoffman — both of whom have signed another pledge to support Harris — are signatories, as is IAC Chairman Barry Diller.\n\nAdvertisement\n\n“Kamala Harris is pro-business,” Cuban argued earlier this week. “This is Kamala Harris’ campaign, it’s not Joe Biden’s campaign,” later adding that “she’s going center 100%” on business.\n\nHarris’ economic plan includes a push to restore the expanded Child Tax Credit, create a new tax credit that would give low-income or middle-income families with a newborn child $6,000, and slash taxes by up to $1,500 for low-income individuals. She has also pledged to take aim at high prescription drug prices, expensive grocery bills, and Wall Street’s home buying spree.\n\nAdvertisement\n\nAccording to Goldman Sachs analysts, the best outcome of the 2024 presidential election, at least for the economy, would be a Harris win and a Democratic sweep of Congress. The worst scenarios occur when Former President Donald Trump gets back into office and implements tougher controls on immigration and high tariffs on imported goods, the analysts said.\n\nTrump’s economic proposals would also increase the federal deficit by $5.8 trillion over the next decade, almost five times more than Harris’ proposals, which would add $1.2 trillion, according to recent studies from The University of Pennsylvania’s Penn Wharton Budget Model."
        },
        "article49": {
            "headline": "Georgia school shooter suspected of killing two teachers was interviewed by FBI",
            "text": "Colin Gray, the father of the teenager accused of killing four people at his Georgia high school faces a 180-year prison sentence for allegedly buying him the gun as a Christmas present.\n\nHis 14-year-old son, Colt Gray, faced life in prison, Judge Currie Mingledorff II told Barrow County Court on Friday.\n\nInitially, the teenager was warned that if convicted he could face the death sentence for four counts of felony murder.\n\nHowever, the judge later corrected his remarks given the minimum age for capital punishment in Georgia is 18, telling the teenager he faced a life sentence.\n\nColt Gray, who was wearing a green top, sat silently as the judge laid out the potential penalties before later sobbing. He did not enter a plea and was remanded in custody.\n\nClick here to view this content.\n\nShortly afterwards, he was followed in court by his 54-year-old father, who has been charged with four counts of involuntary manslaughter, two counts of second-degree murder and eight counts of cruelty to children.\n\nHandcuffed and wearing grey-and-white prison fatigues, he rocked in his seat and cried during the brief hearing. Like his son, he did not enter a plea.\n\nBoth father and son could face further charges, said Brad Smith, the Barrow County District Attorney, after the hearing.\n\nClick here to view this content.\n\nThe victims of the shooting on Wednesday at Apalachee High School in Winder, north-east of Atlanta, were named as Christian Angulo and Mason Schermerhorn, both 14, and maths teachers Richard Aspinwall, 39, and Cristina Irimie, 53.\n\nVictims Christian Angulo, Cristina Irimie, Richard Aspinwall and Mason Schermerhorn are pictured\n\nNine other people were injured, but authorities said they would recover.\n\nThe families of the victims sat in the front row of the court as the proceedings unfolded.\n\nColin Gray, 54, the father of 14-year-old Colt Gray, has been arrested - Barrow County Sheriff's Office\n\nMr Gray had been arrested amid reports that the AR-15 style rifle used in the killing may have been bought as a Christmas present.\n\nColt Gray was interviewed by the Jackson County Sheriff’s Office last year after they were tipped off by the FBI over threats posted on Discord, an online gaming chat site.\n\nPolice photos of suspect Colt Gray - Barrow County Sheriff's Office/via Reuters\n\nWarning of a school shooting at “an unidentified location and time”, the threat was on a site called Lanza – the surname of the perpetrator of the 2012 Sandy Hook massacre.\n\nInvestigators visited the Grays’ house, where his father said he owned hunting guns, but that his son did not have unsupervised access to the weapons.\n\nThe suspect denied making any online threats at the time and said he had deleted his account on the site.\n\nHowever, NBC reported that Colt’s internet search history showed interest in prior mass school shootings, including the 2018 massacre at Marjory Stoneman Douglas High School in Parkland, Florida.\n\nAccording to witnesses of the shooting, Colt left the classroom at around 9.45am on Wednesday. Lyela Sayarath, a student who was sitting next to the suspect in algebra minutes before, said he showed no signs of what he was about to carry out. When he left, she assumed he was skipping class again.\n\nText exchange between pupil and parent\n\nReturning with a gun, he was unable to get into his classroom. Instead, he went into a classroom next door and started firing.\n\nThe suspect was allegedly bullied by his peers and frequently called “gay”, his father told investigators in a phone call in 2023.\n\n“[They] just ridiculed him day after day after day,” Mr Gray told authorities soon after his son was flagged by the FBI.\n\nHe added that his son had been desperate to move schools. “He’s going through a lot… It was very difficult for him to go to school and not get picked on,” he said in a newly revealed transcript.\n\nThe suspect’s family leapt to his defence on Thursday after police said he would be charged with the murder of four people as an adult, threatening to go “full throttle” on social media.\n\nHowever, details of the Gray family’s troubled history have since emerged.\n\nColt’s mother, Marcee, 43, has a lengthy criminal record, having been arrested for drug, domestic violence and motoring offences. She also served time in jail.\n\nWarrants were issued last November after drugs were found in her car and in April, she was reportedly charged with aggravated battery of a 73-year-old woman.\n\nClick here to view this content.\n\nKamala Harris, the US vice-president, called the shooting a “senseless tragedy”, while Joe Biden, the president, said he and his wife Jill were “mourning the deaths of those whose lives were cut short”.\n\nDonald Trump, the Republican presidential candidate, wrote on social media: “These cherished children were taken from us far too soon by a sick and deranged monster.”\n\nThere have been at least 36 school shootings in the US this year, according to CNN."
        }
    }
}