{
    "2024-08-29": {
        "article0": {
            "headline": "Why is Harris bringing Walz to her first major interview?",
            "text": "Why is Harris bringing Walz to her first major interview?\n\nGetty Images\n\nThree weeks ago, just days after being formally chosen as the Democratic presidential nominee, Kamala Harris was pressed on her plans for a sit-down interview. “I’ve talked to my team,” she told reporters on the airport tarmac in Detroit. “I want us to get an interview scheduled before the end of the month.” On Thursday night, Ms Harris will - just barely - make good on that promise, sitting down with CNN’s Dana Bash for her first major interview. But Ms Harris will not be there by herself. The vice-president will be joined by her running mate, Minnesota Governor Tim Walz, for the prime-time appearance, airing at 21:00 EDT (02:00 BST). Ms Harris may have answered the question of when she would conduct an in-depth, substantive discussion of her candidacy and agenda - standard procedure for all major party presidential candidates. But with Mr Walz in tow, the decision to make this a joint appearance may also fuel growing criticism that after escaping the rigours of a months-long presidential primary, she is now dodging the scrutiny that comes with a solo interview.\n\n“I think it’s incredibly weak, weak sauce, to show up with your running mate,” said Scott Jennings, a former special assistant to President George W Bush, on CNN, adding that Harris had a “troubling lack of confidence\" in her own political ability. Still, supporters of Ms Harris insist that given the unprecedented nature of her candidacy following President Joe Biden's sudden departure from the race, she is taking things at a smart pace. “I think the cadence has been right,” said Peter Giangreco, a Chicago-based Democratic strategist. “Win the nomination, pick your nominee, lay out your economic plan, do your convention and now do some sit-downs and amplify that.” Joint interviews featuring both members of a presidential ticket are not unusual. Barack Obama and Joe Biden sat for an interview with 60 minutes after Mr Biden was selected as the vice-presidential nominee in 2008. Eight years later, Hillary Clinton and her running mate Tim Kaine did the same. For Ms Harris and Mr Biden in 2020, they picked ABC’s 20/20. And less than a week after Trump announced JD Vance as his running mate, the pair were jointly interviewed on Fox. But since Mr Biden passed the torch to her late last month, Ms Harris has limited most of her engagement with the press to scripted and highly-controlled environments. Her last formal sit-down interview was on 24 June, more than two months and a political lifetime ago. Her occasional interactions with reporters - brief answers to shouted questions on her way to and from campaign events - have done little to quell Republican claims that she is shirking any opportunity to have her record and agenda put under the microscope.\n\nGetty Images\n\nThe harshest criticism comes from her Republican opponents, who have both given several interviews in the past month. “She’s not smart enough to do a news conference,” Mr Trump told media earlier in August. “She won’t do interviews with friendly people because she can’t do better than Biden.” The Democratic nominee has enjoyed a surge in momentum since entering the race. Now, after her whirlwind introduction to American voters, she needs to \"reinforce\" that energy, said Republican strategist and Trump critic Chip Felkel. “She’s gotta get out there,” he said. “She’s got to show that she can think under pressure, because that’s part of what the president has to do.” Since she campaigned in the Democratic presidential primary in 2019, Ms Harris has switched her stance on several key policy positions, backing off some of her more liberal promises. She has abandoned pledges to support Medicare for all (giving all Americans access to government-funded healthcare) and to ban fracking. And the vice-president now supports a bipartisan border bill that includes hundreds of millions of dollars on a border wall, something Ms Harris once called \"un-American\". These apparent changes could open her up to questions about being a policy flip-flopper - an unwelcome label for a candidate still trying to define herself. But by doing a joint interview, the Harris campaign may have calculated that the pressure - and the difficult questions - will at least be shared between the two of them. And it ensures both are in lockstep when it comes to explaining policy. Mr Giangreco, the Democratic strategist, predicted Ms Harris and Mr Walz will try to turn the focus onto their economic plan, an agenda to lower the cost of living and provide economic security that she first announced at a rally in Raleigh, North Carolina, two weeks ago. Mr Giangreco also pointed to another potential benefit of a joint interview: drawing a contrast between Mr Walz and his Republican counterpart JD Vance who he has labelled as \"weird\".\n\nKamala Harris accepts Democratic nomination 'on behalf of the people'"
        },
        "article1": {
            "headline": "Walz’s Campaign Trail Includes Stories of Helping With Lice on Facetime, Talking About the Perils of Gutters",
            "text": "When Kamala Harris chose Tim Walz to be her running mate for this November’s presidential election, most Americans had no idea who the Minnesota governor actually was. But as people outside of Minnesota get to know Walz, it’s becoming clear through a torrent of stories shared online that he’s one of the most likable politicians around. Why? He just seems like a very normal and kind person. And it’s hard to find a sharper contrast between Donald Trump and his vice presidential running mate JD Vance than “normal and kind.”\n\nYes, Trump and Vance are clearly frustrated with being called “weird,” a verbal jab against modern Republicans that was first popularized by Walz. But Trump and Vance are clearly stumped about how to hit back. Because every new day online seems to deliver an anecdote or story from Walz that makes him seem both relatable and caring. And after years of Trumpism dominating the headlines with an ideology built on cruelty and humiliation, a guy like Walz is extremely refreshing.\n\nTake an old story about Walz that started going viral on Wednesday. Peggy Flanagan, the lieutenant governor of Minnesota, was interviewed by Politico about the fact that she would become the first Native American woman to be governor of any state. At the end of the interview, Flanagan told a story about how Walz helped her when her child got lice.\n\nFrom Politico:\n\nI heard you say that your daughter was discovered to have lice the day after the 2018 election. Can you share how the newly elected Walz-Flanagan ticket handled that early crisis? My first instinct was to call Congressman Tim Walz, also governor-elect Tim Walz, to say, “Help, my child has lice, and I don’t know what to do.” So that was interesting. But he was amazing. I was super freaked out. We’d never dealt with it before. Siobhan was a total trooper. He said, “Go to Target, and then FaceTime me from the aisle.” And so I did. He had me show all the different shampoos and stuff. He was like, “This is the one that you get.” And then he’s like, “Once you get home, FaceTime me again.” So I FaceTimed him again from the bathroom, as I’m picking nits out of my child’s hair. And he was amazing and coached me through the whole thing, and that is who Tim Walz is.\n\nIt’s the kind of story that we’re hearing more and more about Walz over the years. As a teacher and coach, he touched the lives of so many people as a helpful father figure, as so many of his former students tell it. And the army of pro-Trump trolls who are trying to take him down just don’t understand his appeal.\n\nThe other thing that’s been going viral this week involving Walz is his interview with Subway Takes on TikTok. Walz discusses how important he thinks good gutter maintenance is. And it’s just the latest example of Walz talking about normal things that normal people discuss in their everyday lives.\n\nMeanwhile, Trump continues to post the most vile things imaginable on social media. For example, Trump retweeted an image on Truth Social that showed Hillary Clinton and Kamala Harris with the caption, “Funny how blowjobs impacted both of their careers differently.” The “joke” as it were is that Clinton’s husband was involved with a White House intern in the 1990s and Harris was dating Willie Brown. The right has repeatedly tried to claim, without any evidence, that she only succeeded professionally because she was dating Brown. It’s a common attack from retrograde assholes. But normal people don’t find it amusing. At least they don’t anymore.\n\nThe late-night comedians of the 1990s tore Monica Lewinsky to shreds with those kinds of jokes. But here in the 2020s, the U.S. public sees Lewinsky much differently than she was depicted in late 20th-century news and comedy programs. And that’s probably why these assholes don’t understand that they’re the weird ones. Guys like Trump and Vance are trying to bring America back to the 1990s, back when Trump thought he was hot shit and Vance was a kid. Both men are trying to turn back the clock, from their stupid jokes to their ideas about reproductive health. But there’s a reason that Harris has embraced a slogan that really seems to resonate with most people: We’re not going back."
        },
        "article2": {
            "headline": "X Straightens Up Grok After Election Misinformation Warnings",
            "text": "Few mainstream social media sites have become more inundated with misinformation since the 2020 presidential election than X. Elon Musk bought the platform formerly known as Twitter in late 2022 and quickly instituted policies that allowed the worst elements of society to thrive. But X reportedly fixed at least one problem recently identified by several state attorneys general with the AI chatbot Grok. And it may be a small fix, but it’s better than nothing.\n\nWhat was the problem with X’s Grok? Apparently, when you asked it questions about the 2024 election, the AI would repeatedly get things wrong about election laws. When President Joe Biden stepped aside on July 21 to allow Kamala Harris to run, Grok users were fed all kinds of information that simply wasn’t true when asked about how things would change in the race.\n\nThe secretaries of state for Minnesota, Michigan, New Mexico, Pennsylvania, and Washington all wrote a joint letter to Elon Musk and X about the problems on August 5. The letter laid out some of the most concerning problems, like the answers Grok would give about whether Harris still had time to get on the ballot to become the Democratic nominee.\n\nFrom the letter, which was also published online:\n\nWithin hours of President Joe Biden stepping away from his presidential candidacy on July 21, 2024, false information on ballot deadlines produced by Grok was shared on multiple social media platforms. The post from Grok said, “The ballot deadline has passed for several states for the 2024 election. Some of these states include: 1. Alabama 2. Indiana 3. Michigan 4. Minnesota 5. New Mexico 6. Ohio 7. Pennsylvania 8. Texas 9. Washington.” This is false. In all nine states the opposite is true: The ballots are not closed, and upcoming ballot deadlines would allow for changes to candidates listed on the ballot for the offices of President and Vice President of the United States.\n\nWhile the letter notes Grok is only available to paying subscribers on X, and includes a disclaimer about the fact that Grok can get things wrong, the secretaries of state noted how the false information about ballot deadlines had “been captured and shared repeatedly in multiple posts—reaching millions of people.” And that’s the bigger problem. Grok is a relatively niche service for people who are dumb enough to give Elon Musk money. However, the information from Grok can spread far and wide if people share screenshots on X and other social media sites. Especially if that information confirms existing biases or preconceived notions for confused individuals, like the idea that Harris is somehow ineligible to become president.\n\nBut Grok has reportedly been fixed, at least when it comes to information about ballot deadlines. The secretaries of state released a new letter on Monday praising X for doing something about it. Grok now directs users to Vote.gov, which has accurate information about voting rules and regulations.\n\n“We appreciate X’s action to improve their platform and hope they continue to make improvements that will ensure their users have access to accurate information from trusted sources in this critical election year,” the new letter reads. “Elections are a team effort, and we need and welcome any partners who are committed to ensuring free, fair, secure, and accurate elections.”\n\nAs the secretaries of state note, the finer points of election rules can vary by state, which can make it difficult to keep things straight. But Vote.gov has the information that people need. And as long as Grok directs people there, rather than making shit up, things should be alright.\n\n“In the U.S., all elections are run by local officials, who are supported and overseen by a state agency,” the statement reads. “Election rules and procedures can vary widely from state to state, and voters should seek out information from their local election officials about who can vote when they can vote, and how they can vote in their area. Websites like Vote.gov and CanIVote.org are also trustworthy resources that can connect voters with their local election officials.”\n\nDon’t forget to register to vote. Depending on where you live, the deadline could be coming soon."
        },
        "article3": {
            "headline": "Harris' first sit-down interview as nominee airs Thursday with pressure building",
            "text": "Harris explains policy shifts and her 'day one' in 1st sit-down interview as nominee\n\ntoggle caption Will Lanzoni/Will Lanzoni/CNN\n\nVice President Harris outlined her day-one agenda to support middle-class families if she were to win the election this fall in her first sit-down interview since becoming the Democratic nominee for president. She addressed plans to make housing more affordable and to expand the child tax credit, and she acknowledged that despite economic growth since the pandemic, prices are still too high for many Americans.\n\n“Prices, in particular for groceries, are still too high. The American people know it. I know it,” she said.\n\nSponsor Message\n\nHarris, who was joined by her running mate, Minnesota Gov. Tim Walz, sat down with CNN’s Dana Bash for the interview during a campaign swing in Savannah, Ga.\n\nThe wide-ranging conversation was a high-stakes moment for Harris, after she had faced mounting pressure to do an interview with a major news outlet to share her own policies and take questions on her prior positions, some of which have changed since she became President Biden’s running mate in 2020.\n\nBash pressed Harris on her shifted stances on both banning fracking and decriminalizing border crossings. Harris in 2019, when she first ran for president, said she was against a fracking ban and was for decriminalizing border crossings. Her stance on both policies has changed since then — but Harris insisted that her values have not.\n\n“I think the most important and most significant aspect of my policy perspective and decisions is, my values have not changed,” Harris said. “What I have seen is that we can grow and we can increase a thriving clean energy economy without banning fracking.”\n\nHarris said she would keep her word that she would not ban fracking — an issue that is front and center in Pennsylvania, a critical swing state.\n\nSponsor Message\n\nAnd on decriminalizing border crossings, Harris said, “I believe there should be consequences. We have laws that have to be followed and enforced, that address and deal with people who cross our border illegally, and there should be consequences.”\n\ntoggle caption Will Lanzoni/CNN\n\nHarris also addressed foreign policy, namely the continued U.S. aid to Israel in its war in Gaza. When asked if Harris would withhold some shipments of weapons to Israel, Harris did not directly answer the question, and instead reiterated her call for a ceasefire deal and getting the hostages home.\n\n“I remain committed since I've been on October 8, to what we must do to work toward a two state solution where Israel is secure and in equal measure, the Palestinians have security and self determination and dignity,” she said.\n\nIn the interview, Harris also committed to having a Republican in her presidential cabinet – and said it would be to the benefit of the American public to have someone who has different views and different experiences working with her.\n\nThe interview was wide-ranging, covering Walz’s record and past controversies, President Biden’s legacy and ability to serve, as well as the phone call between Biden and Harris the day he decided to step down from the race.\n\nQuestions over Walz’ comments on weapons of war, and his path to having children\n\nWalz had only a few questions directed at him during the interview. He was asked about previous comments he made in 2018 about carrying a weapon into war – which Walz never did. He said he misspoke.\n\n“We were talking about, in this case, this was after a school shooting, the ideas of carrying these weapons of war and my wife, the English teacher, telling me my grammar is not always correct,” Walz said.\n\n“My record speaks for itself… I speak like they do. I speak candidly. I wear my emotions on my sleeves, and I speak especially passionately about our children being shot in schools and around guns. So I think people know me,” he said.\n\nSponsor Message\n\nWalz and his wife used a method known as IUI to have children – but has said they used IVF in the past. On that issue, Walz said he thinks most Americans “get it if you’ve been through that.”\n\n“I don't think they're cutting hairs on IVF or IUI. I think what they're cutting hairs on is an abortion ban and the ability to be able to deny families the chance to have a beautiful child,” he said.\n\nNew details on the call between Biden and Harris when Biden stepped down\n\nHarris revealed that she was spending time with her family, cooking breakfast and about to sit down for a puzzle when Biden called her last month to let her know he was ending his campaign for reelection.\n\n“I asked him, ‘Are you sure?’ And he said, ‘Yes,’ ” Harris said.\n\nShe noted that Biden made it “very clear” that he was going to support Harris’ campaign for president. She called the president “selfless” and said he puts the American people first.\n\nRepublicans like Trump had been accusing Harris of trying to dodge tough questions\n\nIt’s been more than a month since Biden dropped out of the race, and in the absence of a 1-on-1 Harris interview or press conference, Republicans have accused the vice president of trying to dodge the press to avoid tough questions. “She hasn’t done an interview,” former President Donald Trump said during a news conference earlier this month at his Mar-a-Lago estate. “She can’t do an interview. She’s barely competent, and she can’t do an interview.”\n\nPrior to becoming the Democratic nominee, Harris had taken plenty of questions from reporters as the sitting vice president. Her team says she’s done 80 interviews this year — in traditional, network media as well as on podcasts and social media.\n\nSponsor Message\n\nBut in these previous conversations she was generally selling Biden’s agenda. Like most vice presidents, she was a messenger and a deputy. Now, she’s running for the top job, and this CNN interview may be one of the first times she’s pressed to spell out her own policies and answer questions about how, if at all, she would govern differently than Biden.\n\n“I think she’d have to answer more of these questions,” said Debbie Walsh, director of the Center for American Women and Politics at Rutgers University. “I don’t think it would be possible to run for president and not answer them.”\n\nHarris will, undoubtedly, face additional scrutiny about her record and positions when she faces off against Trump in the debate expected next month.\n\nTrump, for his part, posted on his platform Truth Social as the interview with Harris aired on CNN.\n\n“I look so forward to Debating Comrade Comrade Kamala Harris and exposing her for the fraud she is. Harris has changed every one of her long held positions, on everything,” he said. He also posted: “BORING!!!”\n\n"
        },
        "article4": {
            "headline": "Kamala Harris says she would appoint a Republican to her Cabinet",
            "text": "Kamala Harris said she thinks she would appoint a Republican to her Cabinet if elected president.\n\n\"I think it would be to the benefit of the American public,\" she said.\n\nShe said it during her first interview since launching her campaign, set to air Thursday night.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Go to newsletter preferences Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nVice President Kamala Harris indicated on Thursday that she would appoint a Republican to her Cabinet if she's elected president.\n\n\"I would, I think. I think it's really important. I have spent my career inviting diversity of opinion,\" Harris said during an interview with CNN's Dana Bash that's set to air on Thursday evening.\n\n\"I think it's important to have people at the table when some of the most important decisions are being made that have different views, different experiences,\" Harris said. \"And I think it would be to the benefit of the American public to have a member of my Cabinet who was a Republican.\"\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in ."
        },
        "article5": {
            "headline": "YIMBYs are having a moment",
            "text": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nIt's YIMBYs' time to shine.\n\nPro-housing advocates have long pushed for so-called housing abundance at the local level. Now they finally have a presidential ticket that explicitly echoes their agenda.\n\nThese activists and their diverse coalition — who call themselves YIMBYs, for \"yes in my backyard\" — have sprung into action to support Kamala Harris, the Democratic presidential nominee. On Wednesday night, they held a two-hour virtual \"YIMBYs for Harris\" fundraiser featuring dozens of local, state, and federal lawmakers who believe in building lots more housing.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nPro-housing advocates say Harris' proposal to build 3 million homes in her first term, in part through cutting government regulations restricting construction, feels like a big shift toward addressing the country's housing shortage. It doesn't hurt that Harris selected as her running mate a governor who has championed pro-housing policies in office.\n\nAdvertisement\n\nHarris and other top Democrats, including former President Barack Obama, highlighted the housing shortage in their speeches at the Democratic National Convention — sending YIMBYs into a tizzy. Democrats in Washington have long supported demand-side housing policies, including subsidies for homebuyers and low-income renters. But recent national messaging on the issue has focused much more squarely on solving the supply shortage, which is particularly severe in blue states and cities where onerous permitting requirements, environmental reviews, and opposition from so-called NIMBYs — \"not in my backyard\" — have hamstrung efforts to build more homes.\n\n\"There's always been Democrats saying we should fund more affordable housing,\" Armand Domalewski, a San Francisco-based data analyst who helped organize YIMBYs for Harris, told Business Insider. What's new on the national stage, he added, is \"the perspective that part of the issue is local and state governments obstructing housing.\"\n\nRelated stories\n\nShortly after Domalewski set up a WhatsApp group for pro-housing voters about three weeks ago, \"it just exploded,\" he said. About 300 people are in the chat, he said, and the group estimated that about 6,000 people attended Wednesday's virtual fundraiser, which raised more than $100,000.\n\nSen. Brian Schatz, a headliner at the fundraiser, argued that his party was experiencing a \"generational shift\" in its approach to housing. He's called Harris \"the first presidential nominee in at least a generation that cares about housing.\" Gov. Jared Polis of Colorado similarly described Harris at the event as \"the most pro-housing president in the history of the United States.\"\n\nAdvertisement\n\n\"We want somebody that is actually going to work to solve the problem of the housing shortage,\" Schatz said. \"And the simplest way to solve the problem of the housing shortage is to make it permissible for people to build as much housing as they can, especially for working people.\"\n\nRep. Robert Garcia, a 46-year-old California Democrat who's been one of the loudest urbanist voices in Congress, noted in his remarks during the fundraiser that he was organizing the first YIMBY congressional caucus.\n\nThe fact that housing policy is high on the list of national Democratic priorities indicates how severe the affordability crisis has gotten. Harris, Obama, and other top Democrats aren't suddenly YIMBY converts — they're talking about the housing shortage because Americans are more worried about it. In a recent survey , 83% of Democrats and 68% of Republicans said they thought a lack of affordable housing was a significant problem.\n\nFormer President Donald Trump hasn't said much on the campaign trail about housing, though he and his running mate, Sen. JD Vance, have argued they could solve the supply shortage by deporting millions of immigrants.\n\nAdvertisement\n\nSeveral speakers at the YIMBY fundraiser argued that, despite being the anti-regulation party, Republicans had embraced red tape that limits what can be built and where. In the Heritage Foundation's Project 2025 agenda, Ben Carson, who was Trump's secretary of housing and urban development, wrote that Republicans should \"oppose any efforts to weaken single-family zoning.\""
        },
        "article6": {
            "headline": "Elon Musk's AI chatbot Grok generates fake US election images and X is doing little to prevent their spread, study says",
            "text": "Grok AI users are generating fake election images and sharing them on X.\n\nResearchers say X is not enforcing its own rules about AI-generated images.\n\nSome AI images of Kamala Harris and Donald Trump have amassed over 1 million views on X.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Go to newsletter preferences Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nA new study has found that users are creating fake election-related images using the Grok AI bot and sharing them on X — and that Elon Musk's platform isn't following its own rules to prevent it.\n\nAfter Grok incorporated an image generator called FLUX.1 earlier this month, users quickly generated fake images of former President Donald Trump and Vice President Kamala Harris and shared them on X. Some are obviously fake, like ones of the two candidates kissing or giving a thumbs-up to the September 11 attacks. Others, however, are more subtle.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in ."
        },
        "article7": {
            "headline": "Kamala Harris' $25,000 down payment assistance plan is a band-aid fix for the housing crisis, Zillow's chief economist says. 3 policies that will actually help home affordability.",
            "text": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nThanks for signing up! Go to newsletter preferences\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nAs the presidential race heats up, one issue at the forefront of voters' minds is how to afford a house as homeownership becomes increasingly difficult.\n\nTwo weeks ago, the Harris-Walz campaign unveiled a slew of housing policies to combat this issue, including a proposal to provide $25,000 in down payment assistance for first-time homebuyers, with more generous aid for first-generation homeowners.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nAt first glance, down payment assistance might seem like a great idea, but according to Zillow Chief Economist Skylar Olsen, it's not an effective solution to the housing crisis.\n\nPolicies like these effectively act as subsidies that cause widespread spikes in housing demand as people rush to buy, according to Olsen. However, if nothing is done to address the dearth of housing supply, then jump-starting nationwide demand will simply exacerbate the housing crisis as people scramble to snatch up already-scarce homes.\n\nAdvertisement\n\n\"The demand side doesn't help over the long run,\" Olsen said. \"If you want sweeping policy that's very generalizable, have it be on the supply side.\"\n\nOlsen also doesn't think the first-time homebuyer criteria is the most useful way to increase housing access for those who need it the most.\n\n\"I could be a first-time buyer, but I have a great network, a bank of mom and dad, that could help me move forward. And now you've given me an extra boost,\" Olsen said.\n\nFocusing on boosting first-generation homeownership could help combat that issue, which Harris' plan addresses, although the exact details have yet to be revealed.\n\nAdvertisement\n\nUltimately, Olsen believes a federal down payment assistance plan is simply a band-aid fix for structural issues in the US housing market — namely, lack of supply.\n\n\"It can end up just getting us revved up without solving the long-run problem,\" Olsen said.\n\nRelated stories\n\nHere's what will actually help home affordability\n\nThat's not to say that all down payment assistance plans are doomed to fail. When done right, these programs can be quite beneficial, Olsen said.\n\nThe key comes down to whether such a plan is implemented at the federal or local level. According to Olsen, local homebuying incentives that increase demand are more targeted than a blanket federal policy like the one Harris proposed, making them more effective in increasing homeowning accessibility.\n\nAdvertisement\n\nFor example, a state with a low population might have a lot of underused infrastructure. In this case, incentives to boost housing demand at the state level could help redistribute people to areas with excess home supply.\n\n\"If you want to solve things with the demand side of the coin for the long run, it's gonna be more about 'How do I get the people to want to go where the supply is?'\" Olsen said.\n\nBut again, Olsen believes that policies increasing the housing supply are the most effective way to alleviate the current housing crisis.\n\nHarris has actually put out proposals addressing the supply side.\n\nAdvertisement\n\nThe Innovation Fund for Housing Expansion aims to build more housing and lower rents and homebuying costs. The fund will provide $20 billion in funding to lower land use restrictions, modernize zoning policies, stimulate development, and encourage innovative housing solutions. This plan emphasizes building multifamily rental units and starter homes for middle-class families, with the goal of creating hundreds of thousands of units.\n\nAnd the Low-Income Housing Tax Credit provides tax credits to developers who build affordable housing units, which helps low-income tenants in finding affordable and available units. This policy encourages mixed-income developments such as multifamily housing rented to tenants from a variety of income backgrounds."
        },
        "article8": {
            "headline": "Harris is on a 2-day Georgia bus tour. It’s the latest sign the state is in play",
            "text": "Harris is on a 2-day Georgia bus tour. It’s the latest sign the state is in play\n\ntoggle caption Saul Loeb/AFP via Getty Images\n\nVice President Harris and her running mate, Tim Walz, are back on their campaign bus. The pair are together on the campaign trail for the first time since last week’s Democratic convention. This time, they’re on a two-day bus tour of Georgia.\n\nTheir trip is taking them into areas of the state that don’t always get attention from Democratic politicians. It will also be the site of Harris’ first major network interview since becoming her party’s nominee for president, on Thursday.\n\nThe attention this week is just the latest sign that Georgia, a state President Biden narrowly won in 2020, is once again in play this election year.\n\nSponsor Message\n\n“This area is a priority for the campaign: we have nearly 50 full-time staff across 7 offices in South Georgia,” said Porsha White, the Georgia state director for the Harris campaign, ahead of the trip. “This will be the first time a general election presidential candidate will have campaigned in Savannah since the 1990s.”\n\ntoggle caption Saul Loeb/AFP via Getty Images\n\nUpon arrival in Savannah, Harris and Walz greeted students from Savannah State University, the oldest public HBCU in Georgia, before boarding their campaign bus.\n\nTheir first stop on Wednesday was to a marching band rehearsal at Liberty County High School, which, according to U.S. News and World Report, has about 1,000 students, a majority of them “economically disadvantaged.”\n\nThe room erupted when Harris and Walz walked in, and the band played the school fight song with football players and cheerleaders in the back of the room. Leaning into his experience as a former coach, Walz gave a quick speech about teamwork. Harris told the crowd they were all leaders in their own way.\n\nNext stop: Sandfly Bar-B-Q in Savannah, a restaurant decorated with license plates from various states. Harris and Walz were greeted by the restaurant's owner, employees and local patrons. Walz sought out a group of teachers and praised their “noble” work. He talked about the importance of optimism and insisted, “Our politics can be hopeful.” Outside, a man held a Trump flag.\n\ntoggle caption Saul Loeb/AFP via Getty Images\n\nOn Thursday, Harris stopped by Dottie’s Market in Savannah, where she told the owner she plans to announce a tax credit to boost small business creation. “What I’m going to be rolling out next week is basically a tax credit for startups, small business startups,” she said.\n\nSponsor Message\n\nLater was a rally at the city's Enmarket Arena, where she outlined her vision to \"fight for America’s future\" that included Medicaid expansion, focusing on middle- and working-class families and expanding reproductive rights.\n\nIt’s part of a broader strategy to reach voters in traditionally Republican areas in swing states\n\nSavannah — like most major cities — votes strongly Democratic. But it is swimming in a sea of red — and that’s where Harris and Walz are campaigning.\n\n“The whole point is to overperform,” said Emory University political scientist Andra Gillespie. “And so you want to overperform not just among your base, but you also want to overperform in places where you have historically been weak.”\n\nThat means campaigning far from the Democratic strongholds of Atlanta, Philadelphia and Charlotte, N.C., to narrow the margins in parts of those competitive swing states that have typically voted Republican. In other words, losing by less.\n\nIn Georgia, where reliably Republican voters still outnumber reliably Democratic ones, that’s really the only way to have a chance at winning.\n\n“Democrats also want to perform better than they historically have in other parts of the state, so you want to be able to post stronger margins — even if they are losing margins — in other parts of the state,” Gillespie said.\n\nBoth campaigns put money and time into Georgia\n\nIn presidential races, there are two big indicators of how campaigns are feeling about their chances in a state: time and money. Since Harris got into the race, Donald Trump and his allies have spent nearly $33 million on ads in the state, mostly trying to define Harris with pretty negative messaging. Meanwhile Harris and her allies have spent nearly $23 million, mostly on more positive ads introducing her to voters. That’s according to an NPR analysis of data from the tracking firm Ad Impact. People watching TV in Georgia are seeing a ton of campaign ads already.\n\nSponsor Message\n\nToday, the Harris campaign launched its first “contrast” ad, hitting Trump and tying him to the unpopular conservative roadmap known as Project 2025. That will be on heavy rotation in Georgia and other swing states.\n\ntoggle caption Elijah Nouvelage/Bloomberg/Bloomberg via Getty Images\n\nThe Harris campaign has invested in 24 offices around Georgia, including in more traditionally Republican areas. Since Harris started running for president, White says they’ve brought in 35,000 new volunteers.\n\nAs for time: Trump held a rally in Georgia earlier this month — though he spent part of his speech bashing the state’s Republican governor. (Trump has since made a public show of saying they’ve worked things out.) This week’s bus tour is Harris’ second trip to the state in less than a month.\n\nPolling averages show the race remains close — and it’s much closer with Harris at the top of the ticket than when Biden was the presumptive nominee . Biden won by fewer than 12,000 votes. But the state’s two Democratic U.S. senators are proof that a Democrat can win if they run a near-perfect campaign.\n\nThe Trump campaign will also be turning up the heat in the state this week in an effort to win it back. Georgia Republican Rep. Marjorie Taylor Greene plans to head to a volunteer phone bank in Rome, Ga. In a release she cites “dozens of paid staff, thousands of volunteers, and field offices in every part of the state, from Atlanta to Savannah to the Valdosta. Team Trump will not leave a stone unturned this fall.”\n\nFor Trump, Georgia is a must-win state. For Harris, it would open up additional paths to the 270 electoral votes needed to win.\n\n\n\nHarris and Walz will take a pitstop in Georgia to do an interview\n\nAs Harris and Walz meet voters in person, they are also set to sit down for their first television interview together. CNN’s Dana Bash interviewed them at Kim’s Cafe, a Black-owned restaurant in Savannah, this afternoon. It will air at 9 p.m. EST on CNN.\n\nFor the entirety of Harris’ nascent candidacy, she has been in a position to control the message, and she has largely delivered prepared remarks from teleprompter. The interview is, of course, a different format, where she is likely to be pressed on areas where her position has changed since the Democratic primary in 2020, when she supported some version of Medicare for All, opposed fracking and didn’t have as hard of a line on immigration and border security as she does now.\n\nSponsor Message\n\nShe won’t be alone. Walz will also be part of the interview, which means there likely will be some questions about their relationship and how they would work together — questions that by their nature are not as perilous as trying to explain policy shifts.\n\nThe Trump campaign has been publicly badgering Harris to do an interview, in part because they are looking for something to pounce on where they can actually get some traction. They have been trying unsuccessfully for five weeks to end her campaign honeymoon and make some attacks stick, and this interview is the best chance they’ve had in a while.\n\nAlready, Trump’s running mate JD Vance is criticizing Harris and Walz for doing a joint appearance rather than having Harris sit for a grilling alone. But it’s not clear how much voters really care about these intricacies."
        },
        "article9": {
            "headline": "Trump's Arlington Cemetery video may be illegal. And, Harris' 1st sit down interview",
            "text": "Trump's Arlington Cemetery video may be illegal. And, Harris' 1st sit down interview\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\n\n\nToday's top stories\n\nA French court has indicted billionaire Telegram founder Pavel Durov on multiple charges including spreading child abuse images, drug trafficking and failure to comply with law enforcement requests. He is accused of running the platform where these crimes took place, not committing the crimes himself. Durov co-founded the popular messaging app in 2013. The charges come days after his surprise arrest at an airport outside of Paris.\n\ntoggle caption Tatan Syuflana/AP\n\n🎧 Durov could face up to a decade in prison, which could be the harshest action taken to date against a social media chief, NPR’s Rebecca Rosman tells Up First. Telegram users typically find the service attractive due to its limited oversight of what they can say. This has made the app a favorite tool for far-right extremist groups, terrorist organizations and criminal gangs. Investigators say Durov failed to cooperate with them, which would have helped them shut down the illegal operations. He is now under judicial supervision and banned from leaving French territory.\n\nFormer President Donald Trump shared a TikTok video yesterday including footage that likely violates federal law against using military cemeteries for campaigning purposes. The video was posted after NPR reported Trump campaign staffers had a physical altercation Monday with an Arlington National Cemetery staffer who was trying to enforce restrictions during a remembrance ceremony. Only cemetery staff are authorized to take photographs or film in the area.\n\n\n\nSponsor Message\n\n🎧 NPR’s Stephen Fowler says the Gold Star families that invited Trump gave him approval for a videographer and photographer to document the emotional moment , but families don’t have the power to suspend the rules. NPR also learned the family of a Green Beret whose headstone was visible in Trump’s footage didn’t give permission to be included. A Trump campaign representative said the Arlington staffer was “clearly suffering from a mental health episode.” JD Vance, Trump’s vice presidential nominee, said yesterday that Vice President Harris could “go to hell” over the Afghanistan withdrawal and blamed reporters for the controversy.\n\n, but families don’t have the power to suspend the rules. NPR also learned the family of a Green Beret whose headstone was visible in Trump’s footage didn’t give permission to be included. A Trump campaign representative said the Arlington staffer was “clearly suffering from a mental health episode.” JD Vance, Trump’s vice presidential nominee, said yesterday that Vice President Harris could “go to hell” over the Afghanistan withdrawal and blamed reporters for the controversy. ➡️ A solemn 14-acre section of the cemetery is at the center of this controversy. Here's what to know about Section 60, which contains roughly 900 servicemembers killed in Afghanistan and Iraq.\n\nTrump and many other GOP politicians continue to insist, despite a lack of evidence, that a wave of noncitizens will sway the election for Democrats. It’s illegal for noncitizens to vote in federal elections and there’s no credible evidence that it happens in significant numbers. But these false claims are being used as pretext to take actions that could raise obstacles for some voters.\n\n\n\n🎧 At least four states with Republican leadership are announcing new processes and efforts to remove noncitizens from the voter rolls, NPR’s Jude Joffe-Block says. She found in her reporting that these efforts have swept up U.S. citizens who are eligible to vote. Maintaining voter rolls is a critical election safeguard and federal law says it can’t happen within 90 days of an election. Advocacy groups have asked Tennessee and Alabama to halt sending letters to people they suspect are noncitizens, saying it's violating federal law. Tennessee later said people who received letters wouldn’t be purged from voter rolls. Alabama’s secretary of state told NPR anyone who got a letter and is a citizen can vote on Election Day with proof of citizenship.\n\nSponsor Message\n\nHarris and her running mate, Minnesota Gov. Tim Walz, are expected to sit down for a joint interview tonight on CNN. It’s the first interview Harris will give since President Biden dropped out of the race in July. Republicans have accused her of trying to dodge the press to avoid tough questions. This interview may be one of the first times she’s pressed on her own policies and how she would govern differently than Biden.\n\nFrom our hosts\n\nThis essay was written by Michel Martin, Morning Edition and Up First host\n\ntoggle caption Sony Classical\n\nWe all know there are different kinds of fame. There are people who are famous because they are important — think presidents. Then there are people who are famous for reasons we don’t really understand (looking at you certain reality show stars). And then there are people who we KNOW are important — often because we’ve been told they’re important — but we don’t really know why.\n\nI am embarrassed to tell you that until recently Paul Robeson was in that category for me. I knew he was important because, for one thing, he’s been in every Black History Month calendar I’ve ever had. I knew the bio: athlete, actor, activist, magnificent bass baritone, global star. I knew he had been blackballed during the McCarthy era for his outspokenness on human rights.\n\nBut I couldn’t picture him. I couldn’t really see him as a man doing something important in the world the way I could picture, say, Rosa Parks trying to keep her nerves together as she kept her seat on that Montgomery, Alabama bus or Marian Anderson when she sang at the Lincoln Memorial after the DAR barred her from Constitution Hall.\n\nBut then this summer I had the chance to see a snippet of film at an exhibition at New York City's Metropolitan Museum of Art.\n\nSponsor Message\n\nWow. He was magnetic. Could not take your eyes off him.\n\nAnd now you get to see him — hear him — for yourself. For the first time, all of his recordings will be available in one place in a new book and box set called Paul Robeson: Voice of Freedom. We’ll tell you about it on Morning Edition. I can almost guarantee that you will say what I did:\n\nWow.\n\n\n\nPicture show\n\ntoggle caption Michael A. McCoy for NPR\n\nDozens of people from the Ukrainian diaspora gathered in Washington, D.C., over the weekend to run in vyshyvankas — the country’s traditional attire. The shirts, typically made of cotton or linen, feature embroidered patterns along the front, collar and sleeves. This was in celebration of Ukraine’s 33rd Independence Day, which marks Ukraine's split from the former Soviet Union. The event comes as Russia’s full-scale invasion enters its third year.\n\n\n\n📷 See photos of Ukraine’s festive attire and read about why participants supported the event.\n\n3 things to know before you go\n\ntoggle caption U.S. Marshals Service\n\nMurder suspect Deario Wilkerson was captured after months on the run after he fell, so to speak, in authorities’ laps. He dropped through the ceiling of the Memphis building where he’d been hiding. Scientists say new research shows that matching dinosaur tracks found in modern-day Brazil and Cameroon were made 120 million years ago in an area that once connected the two continents. The Federal Aviation Administration grounded SpaceX rockets; one of the company’s Falcon 9 rocket boosters failed yesterday. The grounding comes as four astronauts wait in quarantine for the launch of the historic Polaris Dawn mission.\n\nThis newsletter was edited by Suzanne Nuyen."
        },
        "article10": {
            "headline": "What's Your 'Sleep Language'? Here Are the 5 Different Types and How to Speak Yours",
            "text": "There's a reason why experts suggest adults get 7 to 9 hours of sleep each night. From preventing forgetfulness to impacting your life expectancy, there's a laundry list of health reasons you should be getting quality sleep each night. However, reaching that goal isn't always easy. It can be difficult to find the correct code of hacks to unlock your sleep potential and get the rest your body needs.\n\nShelby Harris, a clinical sleep psychologist, is aiming to crack that code through partnership with the popular meditation app and mental health brand Calm. Harris and Calm have published a working understanding of the \"five sleep languages\" -- a sectioning off of a few different sleeping patterns (or lack thereof) to give people more actionable steps to achieve better sleep.\n\nCNET\n\nHarris said she came up with the five different sleep languages after considering differences among her patients over her 20 years of experience and noticing that there are a handful of categories they tend to fall into.\n\n\"We can give people a whole list of sleep hygiene targets to follow or when they should see a sleep doctor, but sometimes it's a little overwhelming for people,\" Harris said. The goal of the different sleep languages is to meet people where they are in their sleep health journey.\n\n\"It helps to guide where they want to go with what they can start with.\"\n\nRead on to learn more about your sleep language and how to use this knowledge to improve your sleep. For more advice on how to improve your sleep quality, here are eight ways to promote sleepiness and how your diet is linked to your sleep.\n\nThe 5 sleep languages and tips for speaking yours\n\nHarris has landed on five sleep languages, but it's important to note you can switch between them throughout your lifetime, she says.\n\nBelow are the five sleep languages, as described in Calm's blog.\n\n1. The 'gifted' sleeper\n\nIf you're a gifted sleeper, you probably appear to the people around you just as that -- gifted, in the name of sleep. Maybe you can fall asleep anywhere, no matter the noise or background light, or you have no problem napping. Any way you slice it, the gifted sleeper typically doesn't have a problem falling or staying asleep.\n\nTips for the gifted sleeper\n\nWhile this may seem like the \"best\" sleep language category to belong to, objectively speaking, gifted sleepers might want to see a sleep doctor if they're sleeping too much, as it could be a sign of a health condition. It can be especially important to follow up with a doctor if you're sleeping a lot but still not feeling well rested.\n\nBut if there isn't something else at play, consider whether you're actually playing catchup on sleep deprivation and whether you can benefit from a stricter sleep routine, according to the Calm post.\n\n2. The 'words of worry' sleeper\n\nIf you're a \"words of worry\" sleeper, you might know who you are. Your brain is loud at night, clouded with the \"what ifs\" of the day, and what you have to get done tomorrow. Whether it be the past or the present, a words of worry sleeper is focused on another time other than the present and the physical focus at hand: sleep.\n\nTips those who worry about sleep\n\n\"I have a lot of patients that come to me where their brains just won't turn off,\" Harris said. If you can relate to this, be clear on your sleep boundaries and limit things like screen time, or cross-contaminating nonsleep activities in the bedroom, like work. You may also benefit from adding a few minutes of mindfulness or meditation to your day, or trying this CNET to-do list hack for better sleep.\n\nWorking or scrolling in bed is a no-go when you're looking to improve your sleep. Skaman306/Getty Images\n\n3. The 'routine perfectionist' sleeper\n\nIf you're a perfectionist sleeper, you may have followed our sleep advice a little too hard to the detriment of your happiness, and sometimes, your sleep. You may be a perfectionist sleeper if you find yourself missing out on fun events, or other special occasions that may be important to you, over fear of having one night of poor sleep. Or when something or someone throws your sleep off, you're irritated.\n\n\"Those people I often see because they used to be a words of worry person or have some type of sleep issue, that then they became hyperobsessed with it,\" Harris said.\n\nTips for those a little too perfect about sleep\n\nAs laid out in the Calm blog, perfectionist sleepers will benefit from a little more flexibility and switching things up -- things that will create \"less attachment\" to your sleep routine. To get started, move around the order of your sleep routine slightly (maybe you'll brush your teeth before you put on your pajamas today, for example).\n\nLike the other sleep languages, a perfect sleeper may benefit from practicing mindfulness, which can improve your ability to relate to anxiety-inducing thoughts in a way that's not so stressful.\n\n4. The 'too hot to handle' sleeper\n\nIt's in the name, but if you're too hot to handle, you're too hot to sleep. Menopause, perimenopause, other health conditions or even a mismatched bed partner with a different internal temperature can make you too hot to handle.\n\nTips for sleep hotties\n\nIf you're waking up drenched in sweat, or you're finding yourself frequently uncomfortable at night, check in with your doctor to see what underlying health condition may be at play. Medication side effects or hormonal changes can also influence how warm you feel at night, as the Calm post points out.\n\nBut if your bed partner is the culprit, follow this CNET tip and consider getting two separate blankets or comforters, which can also cut down on blanket tug-of-war.\n\n5. The 'light as a feather' sleeper\n\nLight sleepers wake up easily from noise, light or even a strong smell. If you're light as a feather, you might wake up in the morning after a solid seven or eight hours on the pillow still feeling unrested or sleepy.\n\nTips for those light as a feather\n\nIf you're restless and not getting the quality of sleep you want, consider sharpening your bedtime routine and adding a bit more structure -- including setting those bed boundaries, like not scrolling through social media or eating in your bed. (Loose crumbs itching your bare legs may be the last thing a light sleeper needs.)\n\nCalm and Harris also suggest reaching out to a sleep professional if you're concerned about the quality of your rest, screening for sleep conditions such as sleep talking, grinding teeth and sleep apnea.\n\nD3sign/Getty Images\n\nThe link between mental health and sleep\n\nHarris says she decided to partner with Calm in response to the current mental health crisis. The pandemic has exacerbated symptoms of anxiety, eating disorders and other mental health conditions. Mental health can be improved or harmed by someone's sleep patterns.\n\nSleep deprivation, in particular, can affect your ability to stay in control of your emotions or come up with solutions to seemingly not-so-complicated problems that can feel like the end of the world when you're sleep-deprived. (I asked Harris if there was any truth to my feeling like I regress to a child's ability to handle emotions when I'm sleep-deprived, and she explained that sleep deprivation disrupts the part of our mind responsible for reasoning and judgment, and our ability to toggle between states, or our cognitive flexibility.)\n\n\"With sleep deprivation in general, we find higher rates of anxiety, higher rates of depression, higher rates of stress,\" she said. \"And we find their stress tolerance and ability to cope with daily stressors becomes much more difficult.\"\n\nThe critical component is REM sleep, which you may be deficient in if you're regularly lacking sleep. This could lead to problems in your relationship or at work.\n\n\"REM sleep is really important for emotion processing, memories,\" Harris said. \"If you're waking up early or you're not getting enough REM sleep routinely, you're gonna have trouble with irritability, depression, anxiety, all that jazz.\"\n\nAnother bottom line on good sleep\n\nDespite the number of times we preach the health benefits of sleep, there's a thread in society that may be pushing back against the idea that healthy sleep trumps all. But according to Harris, \"No pun intended, you're living in a dream world a little bit,\" if you're trying to check off everything else on the wellness list before you start prioritizing sleep. Centering sleep will help you stabilize and prioritize all the other tasks you have during the day.\n\n\"We have to stop the hamster wheel somewhere, and if you stop it by prioritizing sleep, it makes the daytime run smoother.\""
        },
        "article11": {
            "headline": "JD Vance comments on awkward donut shop video, says he feels 'terrible' for employee",
            "text": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nSen. JD Vance of Ohio filled in some details about his awkward stop at a Georgia bakery last week, expressing sympathy for the camera-shy worker he encountered.\n\n\"I just felt terrible for that woman,\" Vance told NBC News in an interview published Wednesday. \"We walked in, and there's 20 Secret Service agents, and there's 15 cameras, and she clearly had not been properly warned, and she was terrified, right? I just felt awful for her.\"\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nVance visited Holt's Sweet Shop in Valdosta last week as part of a series of stops in South Georgia. Presidential hopefuls and their running mates often try to coordinate unannounced stops at local stores and restaurants during campaign swings. But as Vance learned, things don't always go smoothly when candidates venture beyond campaign rallies.\n\nJD Vance buys donuts in Holt’s Sweet Shop in Valdosta Georgia pic.twitter.com/xOO2j3AoRf — Howard Mortman (@HowardMortman) August 22, 2024\n\nIn recorded footage of the visit, Vance tried to introduce himself to workers as he ordered an assortment of doughnuts and cinnamon rolls.\n\nAdvertisement\n\n\"The zoo has come to town — thank you for letting us come in here,\" Vance told the worker, laughing as a pool of reporters looked on.\n\nThe worker glanced around and said, \"I don't want to be on camera.\" Vance then urged the assembled press to try to avoid featuring her.\n\n\"I'm JD Vance, and I'm running for vice president. It's good to see you,\" Vance said. The worker, clearly not thrilled by all the onlookers, responded, \"OK.\"\n\nSocial-media users on X immediately began trolling Vance over the visit. C-SPAN's short clip of his stop has over 4.2 million views on X.\n\nAdvertisement\n\nThe Republican vice-presidential nominee told NBC that he enjoys going out and meeting Americans.\n\n\"We don't have to have these scripted events — I don't want to go and do three takes of buying Doritos at a Sheetz,\" Vance said, referring to Vice President Kamala Harris and Gov. Tim Walz's recent stop at the famous Pennsylvania gas-station chain. \"I like to get out there and talk to people, and we want to make sure we're doing it, but definitely make sure that people are at least OK with being on camera, or we're going to walk in and you're going to have a person who has, practically, a panic attack because she's got 15 cameras in her face.\"\n\nRelated stories\n\nEvery road trip needs a snack break.\n\n\n\nDoritos acquired. I got you, @KamalaHarris. pic.twitter.com/5nXfEARqwF — Tim Walz (@Tim_Walz) August 18, 2024\n\nWalz and the second gentleman, Doug Emhoff, handed Harris bags of Doritos during her visit, one of her favorite snack foods. Harris went viral after her campaign sent out a fundraising appeal earlier this month saying she coped with Donald Trump's shocking 2016 presidential win by eating \"a family-sized bag of nacho Doritos.\"\n\n\"I did not share one chip with anybody. Not even Doug,\" Harris wrote in the email. \"I just watched the TV with utter shock and dismay.\"\n\nAdvertisement\n\nBefore the press left the Georgia shop, Vance chatted up some other employees, asking them how long they'd been at the bakery and when the business opened.\n\n\"When we selected this place, I didn't know if it had been here for 20 years or four years — you never know, sometimes you drop in,\" Vance said."
        },
        "article12": {
            "headline": "How Beau Biden Set the Stage For Kamala Harris’ Stunning Political Rise",
            "text": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\n\nThere were days the pair talked to each other more than they spoke to the people who slept under their roofs.\n\nKamala Harris was the state attorney general of California and Beau Biden was in the same role over in Delaware, where so many of the banks she was fighting were based. At the height of the clean-up from the 2008 financial crisis, more than a million California households caught up in the foreclosure wave were struggling to stay in their homes. For Harris to help any of them, she needed backup from Biden, who had oversight over Wilmington, Del., the banking industry's stealth capital. That partnership helped Harris emerge as one of the only political leaders in the country seen as holding bankers accountable for predatory practices.\n\nBeau Biden had Harris’ flank until the end of his too-brief life, which ended in 2015 at age 46. Five years later, the man Beau called “Pop” tapped Harris as his running mate, creating one of the most unlikely partnerships in Democratic politics. And when President Joe Biden decided to forgo the nomination this year and clear the way for Harris, it was the dividend on an accidental alliance forged in the early 2010s when two rising stars of the Democratic Party aligned and, to the point it’s become canon, actually became sincere friends.\n\nBeau Biden was atop Harris’ mind last month when she accepted the elder Biden’s endorsement to be the next President. “I first came to know President Biden through his son, Beau. We were friends from our days working together as attorneys general of our home states,” Harris said. “The qualities Beau revered in his father are the same qualities, the same values, I have seen every single day in Joe’s leadership as President.”\n\nTrite? Sure. But it has the benefit of also happening to be true.\n\nUp until Beau Biden’s death, Joe Biden long believed his son had the potential to surpass his own impressive political career. So when the elder Biden tapped Harris four years ago this month, it was in no small measure based on her true friendship with the younger Biden. As I wrote at the time, one question hung over his deliberation more than any other: What Would Beau Do? That’s how Biden got to yes on Harris, despite his primary rivalry with her and a skepticism that she actually believed in the vision for America she was pitching in her own White House run.\n\n“I first met Kamala through my son Beau,” Biden said during his roll-out of Harris. “He had enormous respect for her and her work. I thought a lot about that as I made this decision. There is no one’s opinion I valued more than Beau’s, and I’m proud to have Kamala standing with me on this campaign.”\n\nFour years later, Joe Biden stood aside to give Harris her best shot to date at winning the top job in global politics. In ways great and small, it was a moment set up by Beau Biden, who in the aughts connected with his colleague in California and decided they’d be great partners—and, perhaps, the future of their shared Democratic Party. One succumbed to brain cancer and the other is currently leading Donald Trump in most national polls. What started as a check on banking overreach now stands to be the driving force behind Democratic politics. And, from the outside, it looks like a not entirely bad level of match-making.\n\nMake sense of what matters in Washington. Sign up for the D.C. Brief newsletter."
        },
        "article13": {
            "headline": "2024 election updates: Presidential candidates battle over battlegrounds",
            "text": "Vice President Kamala Harris and Gov. Tim Walz stopped by Liberty County High School in Georgia as part of their bus tour and were greeted by the school’s principal and superintendent and met with the school marching band during rehearsal.\n\nHarris and Walz delivered brief remarks to band members, football players and faculty. After welcoming the class to the \"role model club,\" Harris told the class that as \"leaders\" the nation is \"counting\" on them.\n\n\"You are showing what hard work can achieve, what discipline, what teamwork. And that's the stuff of greatness,\" she said.\n\nDemocratic presidential candidate Vice President Kamala Harris and her running mate, Governor Tim Walz, pose with members of the marching band during a visit at Liberty County High School in Hinesville, Georgia, Aug. 28, 2024, as they travel across Georgia for a 2-day campaign bus tour. Saul Loeb/AFP via Getty Images\n\nShe continued with a music metaphor that encouraged them to keep up their hard work.\n\n\"I will tell you I was in band when I was your age,\" she said. \"And all that you all are doing, it requires a whole lot of rehearsal, a whole lot of practice, long hours, right? Sometimes you hit the note, sometimes you don't, right? All that practice makes for beautiful music.\"\n\n-ABC News' Gabriella Abdul-Hakim, Fritz Farrow and Will McDuffie."
        },
        "article14": {
            "headline": "After major police endorsement, Rep. Gallego faces backlash from progressive groups",
            "text": "After major police endorsement, Rep. Gallego faces backlash from progressive groups\n\ntoggle caption J. Scott Applewhite/AP\n\nAfter drawing praise for an endorsement by Arizona police, Rep. Ruben Gallego has now drawn anger and disappointment from some Arizona progressives for discouraging the Department of Justice from imposing federal oversight on the Phoenix Police Department.\n\nIn a letter to the Justice Department — sent one day after the Arizona Police Association announced it’s backing Gallego in the state’s U.S. Senate race — the congressman said federal investigators “missed the mark” in their examination of Phoenix police.\n\nThat nearly three-year investigation concluded in June that Phoenix police have engaged in a “pattern or practice” of using excessive force, acting with bias and violating constitutional and civil rights.\n\nSponsor Message\n\nIn his letter, Gallego described those violations – “a mere 120 or so unspecified incidents across eight years,” he wrote – as isolated, not pervasive. And he argued against the need for federal oversight for the city’s police department, a position aligned with some of the Phoenix City Council members, who’ve resisted calls from community groups for the DOJ’s further involvement.\n\nPhoenix police and city officials “already welcome reforms,” he wrote.\n\nOversight, Gallego wrote, would be best left to local government.\n\n\n\nPolice back ‘a freaking loser’\n\nWhen it was announced Monday, the Arizona Police Association’s endorsement was a coup for Gallego’s campaign.\n\nThe APA describes itself as an umbrella organization – “an association of associations” – that brings together various law enforcement entities from across the state. In doing so, they represent thousands of law enforcement officers in Arizona.\n\nThe week prior, APA President Justin Harris had joined Donald Trump onstage at a rally in Glendale to announce the organization’s support of the former president – someone who Harris said could get our country “back on track and make America great again.”\n\nAlso onstage that day, Trump described Gallego as “a freaking loser.”\n\nDays later, the APA endorsed that “loser” – “a Marine combat veteran” who “understands the complexities of modern policing in American society today,” Harris said in a statement.\n\nSponsor Message\n\n“The APA does not take our endorsements lightly,” he added. “We recognize the importance of having a U.S. senator that can bring people together to improve society for all. We believe Congressman Gallego will be that U.S. senator.”\n\nIt’s an endorsement that should come in handy as Gallego defends his record from the Trump-backed Republican Senate nominee, Kari Lake, who the APA endorsed for governor in 2022.\n\nWhile a Lake spokesperson accused Gallego of supporting the defunding of police, Harris praised the congressman for backing federal legislation to boost hiring and retention of police officers.\n\n“Congressman Gallego has continually fought for robust, increased funding for America’s law enforcement,” Harris said.\n\n\n\n‘Just lost my vote’\n\nGallego’s letter stunned Jared Keenan, legal director of the ACLU of Arizona.\n\n“To act as if (the DOJ’s report) is in some way not accurately reflective of – detailing the significant problems with the Phoenix Police Department, is simply not true,” Keenan said.\n\nThe timing of the letter, immediately following the endorsement of the state’s largest independent law enforcement organization, made it worse, he said.\n\n“It seems very transactional,” Keenan said.\n\n“A lot of city officials and Rep. Gallego, they speak about public safety,” he added. “But true public safety cannot ignore constitutional rights. It cannot ignore the violence perpetrated by the Phoenix Police Department on members of our community. And to issue statements like this is, frankly, dangerous, because it will embolden the police not to reform themselves.”\n\nOfficials with Poder In Action, a community group that routinely lodges complaints about police treatment of Black, brown and Indigenous communities, called the claims in the letter “a slap in the face” to the communities Gallego represents in Congress.\n\n“It is really just ridiculous to, after all of this evidence, to say that this department can change itself,” executive director Viri Hernandez said. “They haven’t, and that’s the reality.”\n\nSponsor Message\n\nHernandez also said she wasn’t shocked Gallego’s letter came on the heels of the APA endorsement.\n\n“Our community sees the way that police unions, when they support candidates, most of the time — every example we’ve seen — also leads to those candidates pushing back against accountability, transparency,” she said.\n\nAsked whether the police endorsement was tied to the DOJ letter, a spokesperson for the Gallego campaign says there was “no agreement.”\n\n“Ruben Gallego has a record of fighting for Arizona’s law enforcement in Congress and is proud to have the support of the Arizona Police Association,” the spokesperson said.\n\nPoder In Action isn’t in the business of endorsing candidates. As a 501(c)3, they’re barred from intervening in political campaigns. “Our focus is to expose the discrepancies, the lies from any party – Democrats or Republicans,” Hernandez said.\n\nThe organization “doesn’t tell folks who to vote for, who to not vote for,” she added.\n\nNeither does the ACLU of Arizona. But personally, Keenan didn’t mince words when he first responded to the letter on X."
        },
        "article15": {
            "headline": "Kamala Harris’ election would defy history. Just 1 sitting VP has been elected president since 1836",
            "text": "Omit data"
        },
        "article16": {
            "headline": "GOP group claims Dred Scott decision means Kamala Harris can’t be president? Really? | Opinion",
            "text": "Omit data"
        },
        "article17": {
            "headline": "Donald Trump called AI 'very dangerous' — it hasn't stopped him posting what looks like AI-generated content",
            "text": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nThanks for signing up! Go to newsletter preferences\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nDonald Trump is worried about the use of AI in the forthcoming election.\n\nThe former president has called AI \"very dangerous\" and accused his opponent, Kamala Harris, of using it to exaggerate the size of one of her rally crowds.\n\n\"Has anyone noticed that Kamala CHEATED at the airport?\" Trump said in a lengthy, capital-letter-strewn Truth Social post earlier this month.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\n\"There was nobody at the plane, and she 'A.I.'d it,\" he wrote, adding: \"She should be disqualified because the creation of a fake image is ELECTION INTERFERENCE. Anyone who does that will cheat at ANYTHING!\"\n\nAdvertisement\n\nDespite Trump's claim, the crowds shown in the image were genuine. An official from the Harris-Walz campaign told Business Insider that the photo had been taken by campaign staff and \"not modified by AI in any way.\"\n\nIn the weeks following his post accusing Harris of using AI, the former president went on to post several apparently AI-generated memes on Truth Social and X. The images depicted real-life figures, including Kamala Harris and Elon Musk.\n\nHe also reshared on Truth Social a set of dubious images of Taylor Swift and her fans with pro-Trump messaging. While two of the images appeared to show a genuine Trump supporter, others, including several images of women in \"Swifties for Trump\" T-shirts, had telltale signs of being AI-generated.\n\nTrump later denied making the images himself and reflected on the use of AI more generally.\n\nAdvertisement\n\n\"We're seeing it all the time,\" Trump said of AI-created content. \"It's a little bit dangerous out there.\"\n\nThe Swift photos had already attracted criticism online and made headlines. While that may have been exactly what Trump wanted, the former president's willingness to post what looks like AI-generated content without clear labels risks confusing some voters.\n\nViral misinformation\n\nExperts have long feared the widespread use of AI has the potential to affect elections around the world.\n\nDeepfakes, AI-generated text, and hyper-targeted ads can blur the line between fact and fiction, making it harder for voters to discern what is credible information. Bad actors can also use AI tools to purposely spread realistic disinformation on social media at an unprecedented scale.\n\nAdvertisement\n\nPublic literacy around AI-generated content also varies. While some people can easily identify fake content, others can be convinced by fake images or text.\n\n\"This content is also going viral before anybody has really fact-checked it,\" Eric Wengrowski, the CEO of Steg.AI, told Business Insider. \"It's also coming from a former president.\"\n\nRelated stories\n\nWengrowski said while it wasn't unethical for politicians to share AI-generated content for humorous or satirical reasons, public figures should ensure the content is labeled as AI.\n\n\"I do think it's unethical for politicians to be sharing AI-generated content if it is not clearly labeled with the appropriate watermark,\" he said.\n\nAdvertisement\n\nLegal consequences\n\nThe legality of posting AI-generated images that use the likeness of public figures is also murky.\n\n\"It really depends on how the content is being presented,\" Brent Mittelstadt, the director of research at the Oxford Internet Institute, said. \"If it's clearly being presented as a joke or as satire, then you're in a much stronger legal position.\"\n\n\"If something to a reasonable person would obviously be satire, then at a minimum, with things like copyright or usage of somebody's likeness, you can basically get around legal obligations in that way,\" he said.\n\nIn the case of the Swift-related content, Mittelstadt said it wasn't clear if the images were being presented as memes or satire. \"It's not to a reasonable person obviously fake, just from the content itself.\"\n\nAdvertisement\n\nRepresentatives for Trump did not respond to a request for comment from BI."
        },
        "article18": {
            "headline": "Kamala Harris Redefines ‘American Exceptionalism’ for a New Generation of Voters",
            "text": "Stengel is the former Editor of TIME, an MSNBC analyst and the author of Information Wars: How We Lost the Global Battle Against Disinformation .\n\nIn the final moments of her acceptance speech at the Democratic National Convention in Chicago, Vice President Kamala Harris said it was time “to fight for this country we love, to fight for the ideals we cherish, and to uphold the awesome responsibility that comes with the greatest privilege on Earth.” She then paused and said, “the privilege and pride of being an American.”\n\nThat sentence is the most full-throated and sincere expression of American exceptionalism since the presidency of George W. Bush, and the most direct and unambiguous expression of that idea by a Democratic presidential candidate since John F. Kennedy.\n\n“I love our country with all my heart,” she said a few seconds before, adding, “We are the heirs to the greatest democracy in the history of the world.”\n\nHard to say it more directly than that. That is in many ways the modern definition of American exceptionalism.\n\nThe idea of American exceptionalism has been mostly out of favor since it was seen as an underpinning of President Bush’s invasion of Iraq in 2003. For Democrats, it has been a perilous concept for longer than that. American exceptionalism is the idea that the U.S., because of its unique history and origin, because of its founding documents, the Declaration and the Constitution, has a special role not only in the creation of modern democracy but in preserving it around the world. It’s the idea that America is a moral beacon and has a providential role and responsibility to lead.\n\nAmerican exceptionalism is a 20th century term, but the idea is older than the nation. Its inspiration comes from John Winthrop’s famous 1630 sermon in which he said America “shall be as a city upon a hill.” It’s a biblical reference that Ronald Reagan made famous and used hundreds of times in his political career. Reagan, who became the exemplar of exceptionalism, believed that Americans, as John Adams once said, were “the chosen people” with a special destiny determined by the Almighty.\n\nBut the model of foreign policy exceptionalism comes from a different President: Woodrow Wilson. In trying to overcome American isolationism before World War I, it was Wilson who understood that he needed to appeal to American values—the values of freedom, fairness, and equality, and an almost messianic sense of America’s role in the world. This became known as foreign policy idealism, and every American President since Wilson has had to at least nod in that direction.\n\nFor the most part, American exceptionalists are, well, American. Foreigners tend to see the idea of American exceptionalism falling somewhere between naiveté and narcissism. We are often regarded as hypocrites who tout our moral superiority while behaving in ways that are self-serving or damaging.\n\nAmerican exceptionalism became a campaign issue when Barack Obama was running for President in 2008. In an interview that year, Obama was asked whether he believed in American exceptionalism, and he replied, “I believe in American exceptionalism, just as I suspect that Brits believe in British exceptionalism and the Greeks believe in Greek exceptionalism.” Well, let’s just say that did not do the trick. In fact, his lukewarm embrace of the idea was seen as a rejection of American exceptionalism.\n\nI once heard Henry Kissinger say he thought Obama would be the first American President in his lifetime not to be an American exceptionalist. During the Republican primary in 2008, Mike Huckabee accused Obama of not being truly American, saying, “To deny American exceptionalism is in essence to deny the heart and soul of this nation.” The GOP turned the idea of exceptionalism into a political weapon. Their argument was, if you don’t believe in American exceptionalism, you don’t love this country and you don’t deserve to lead it. Obama began to play defense and tried to embrace the idea of exceptionalism, as he said later that same year, “Our exceptionalism must be based on our Constitution, our principles, our values, and our ideals.” The subtext: It’s not our size or military might that make us exceptional but our ideals, and the times we struggle to live up to those ideals, like the civil rights movement, are a part of that exceptionalism.\n\nRead More: How Kamala Harris Took ‘Freedom’ Back from the GOP\n\nHarris picks up where Obama left off but adds something new: Her’s is a personal American exceptionalism, an exceptionalism seen through the prism of her own life and the immigrant experience. Her explanation of her own story suggests that what makes America exceptional is that it’s a place where the child of an Indian immigrant mother and a Jamaican immigrant father can become the nominee for President.\n\nTraditionally, Americans of color were less enamored of the idea of American exceptionalism than white Americans. But recent data show that Americans of foreign and minority backgrounds have a higher degree of faith in America’s promise than white Americans. A 2019 Cato Institute survey found that more immigrant citizens than native-born Americans are somewhat proud or very proud to be an American. A 2023 PRRI/Brookings survey found that more Asian Americans, Hispanic Americans, and Black Americans than white Americans believe America’s best days are ahead of us rather than behind us. And according to 2024 Pew Research Center polls, 75% of Indian Americans and 80% of Asian Americans—higher percentages than white Americans—say they have either achieved or are on their way to achieving the American Dream.\n\nHarris’s embrace of American exceptionalism is a political twofer: It’s a way to appeal both to some conservative voters who may have previously seen the Democratic Party as rejecting traditional red-white-and-blue patriotism and to the millions of legal immigrants who are indeed grateful for the privilege of being an American. In fact, the U.S. foreign-born population surpassed 46 million in 2022, the largest number in American history. That’s almost 15% of the population, the greatest percentage of Americans with immigrant backgrounds since 1910. Naturalized American citizens constituted about 10% of the overall electorate in 2020, a record high. That percentage has only grown. That’s a lot of voters, particularly in the swing states of Michigan, Wisconsin, Pennsylvania, Arizona, and Nevada, which have hundreds of thousands of eligible immigrant voters.\n\nThe irony is that Donald Trump rejects the idea of American exceptionalism and is in fact an American declinist. He has said on numerous occasions that the American Dream is dead and that we are a failed nation. His “America First” slogan isn’t an assertion of global leadership but rather a declaration of intent to withdraw and prioritize self-interest.\n\nThe first sentence of the 2016 platform of the Republican Party said, “We believe in American exceptionalism.” Their nominee said, “I don’t like the term.” And indeed he doesn’t. When Trump was interviewed by Bill O’Reilly on Fox News in 2017, O’Reilly said “Putin’s a killer.” Trump replied, “There are a lot of killers. We’ve got a lot of killers. What do you think? Our country’s so innocent?” He is a relativist about America, who doesn’t think our values make us special but that the U.S. is just as morally compromised as other nations. The 2024 platform of the Republican Party doesn’t mention “exceptionalism.”\n\nAuthoritarians don’t like the idea of exceptionalism. Exceptionalism makes people feel special, it empowers them—it promotes democracy. Just take it from Vladimir Putin, who wrote in a 2023 New York Times op-ed, “It is extremely dangerous to encourage people to see themselves as exceptional, whatever the motivation.”\n\nHarris used the term “self-determination” twice in her acceptance speech. Self-determination is the opposite of autocracy. It’s a term that President Wilson referenced in his famous Fourteen Points speech that proposed the League of Nations, and it’s a cardinal principle in international law. It is also a guiding principle of the immigrant’s view of American exceptionalism, that here people can determine their own future. And that is who Harris was thinking of when she accepted the nomination. “On behalf of everyone whose story could only be written in the greatest nation on Earth,” she said, “I accept your nomination to be President of the United States.”\n\nCorrection, Aug. 29\n\nThe original version of this story misidentified an American President in one instance. The author believes Kamala Harris has made the most “full-throated expression of American exceptionalism” since the presidency of George W. Bush, not George H.W. Bush."
        },
        "article19": {
            "headline": "Harris, pressed on changing policy positions, says 'my values have not changed'",
            "text": "The comments came in a clip of an interview airing at 9 p.m. ET on CNN.\n\nIn her first in-depth interview since becoming the Democratic nominee, Vice President Kamala Harris told CNN, when asked about her changing policy positions, that her \"values have not changed.\"\n\n'My values have not changed'\n\nIn a video clip that aired on CNN Thursday afternoon, anchor and chief political correspondent Dana Bash asked Harris about her shifting positions on climate change and other matters.\n\nUS Vice President and 2024 Democratic presidential candidate Kamala Harris speaks on the fourth and last day of the Democratic National Convention (DNC) at the United Center in Chicago, August 22, 2024. Saul Loeb/AFP via Getty Images\n\n\"How should voters look at some of the changes that you've made? Is it because you have more experience now and you've learned more about the information? Is it because you were running for president in a Democratic primary? And should they feel comfortable and confident that what you're saying now is going to be your policy moving forward?\" Bash asked.\n\n\"Dana, I think the most important and most significant aspect of my policy perspective and decisions is my values have not changed,\" Harris answered. \"You mentioned the Green New Deal. I have always believed – and I have worked on it – that the climate crisis is real, that it is an urgent matter to which we should apply metrics that include holding ourselves to deadlines around time.\n\n\"We did that with the Inflation Reduction Act. We have set goals for the United States of America, and by extension the globe, around when we should meet certain standards for reduction of greenhouse gas emissions, as an example,\" Harris continued.\n\n\"That value has not changed. My value around what we need to do to secure our border: that value has not changed. I spent two terms as the attorney general of California prosecuting transnational criminal organizations violations of American laws regarding the passage, illegal passage, of guns, drugs, and human beings across our border. My values have not changed,\" she said.\n\nHarris says she is open to naming Republican to Cabinet\n\nHarris told Bash she would name a Republican to her Cabinet, in another clip released later Thursday afternoon. However, she said she did not have a particular person in mind.\n\n\"I've got 68 days to go with this election, so I'm not putting the cart before the horse,\" she said. \"I have spent my career inviting diversity of opinion. I think it's important to have people at the table when some of the most important decisions are being made that have different views, different experiences. And I think it would be to the benefit of the American public to have a member of my Cabinet who was a Republican.\"\n\n'Next question, please,' Harris brushes off Trump's race comments\n\nHarris was asked to respond to former President Donald Trump's comments at the National Association of Black Journalists convention where he appeared to question Harris' race.\n\n\"I didn't know she was Black until a number of years ago when she happened to turn Black and now, she wants to be known as Black. So, I don't know, is she Indian or is she Black?\" Trump said at the time.\n\nWhen asked about the comments by Bash, Harris responded, \"Same old, tired playbook. Next question, please.\"\n\nThe CNN interview will air Thursday night at 9 p.m. ET.\n\nThis is a developing story. Please check back for updates."
        },
        "article20": {
            "headline": "Kamala Harris’s Gamble",
            "text": "In the first month of Vice-President Kamala Harris’s improbable run for President, she allowed Democrats’ enthusiasm about finally having a credible opponent to Donald Trump to define her candidacy. Once Joe Biden left the race and Harris let her intentions be known, the excitement vastly outweighed the need to know precisely what policies she was running on. Tens of thousands of people joined Zoom calls to raise funds and created networks aimed at supporting the Vice-President’s run. Thousands more stood in line for hours to pack arenas for rallies, which became staging grounds for crafting the themes of her developing campaign.\n\nAt those rallies, the framing of her campaign came into focus. Harris adhered to typical liberal fare: raising the minimum wage and providing affordable housing and health care. She has been more pointed in her intentions to fight for abortion rights and to extend protections and rights to L.G.B.T.Q. people. By choosing as her running mate the genuinely populist governor of Minnesota, Tim Walz, over the more moderate Pennsylvania governor, Josh Shapiro, Harris delighted progressives.\n\nThe Lede\n\nReporting and commentary on what you need to know today.\n\nBut the most excitement about Harris’s surprise candidacy has been generated without her having to say a word. Her presence at the top of the ticket, as a biracial woman and the daughter of two immigrant parents, has served as a backlash to the backlash against 2020’s national reckoning with the history of American racism. Even as Harris and Walz have deftly avoided any mention of race or racism in this contest, its centrality to the looming election is undeniable.\n\nIn recent years, the Republican Party’s long campaign to end affirmative action was finally realized by a U.S. Supreme Court packed with Trump appointees. Books about slavery and racism against African Americans and school curricula teaching Black history have been banned in some states and localities. In Florida, in an effort that has since been challenged in court but which captured the national mood, Republican legislators passed the so-called Stop WOKE Act, which tried to manage the teaching of Black history based on whether it was perceived to make white students feel guilty. Universities in states such as Texas, North Carolina, and Utah have closed centers and offices dedicated to diversity.\n\nSince Harris became the presumptive nominee, Trump has attacked her racial identity, intentionally mispronounced her name, and questioned her intelligence, going so far as to call her “dumb.” His running mate, J. D. Vance, has supported a national ban on abortion and described people without children as inferior to parents. Under these circumstances, supporting Harris can feel like an act of resistance.\n\nThe Democratic National Convention provided Harris with the opportunity to spell out the specifics of why she should be promoted to President. It was organized to project a new image of Harris as tough and, as her husband, Doug Emhoff, put it, “ready to lead.” Democrats seized the opportunity to claim they were charting a new course for the country, emphasizing themes of joy and patriotism; the crowd periodically broke out into chants of “U.S.A.!” Love of country was laced throughout the speeches, in contrast to Trump’s regular descriptions of the U.S. as a hellscape that only he can rescue. As Michelle Obama intoned, Harris “truly understands” what has “always made America great.” The emotive goals of the Convention seemed to have been met, but what of the opportunity to map out the meaning of a Harris Presidency?\n\nFor all the talk about moving forward, the Democratic Party decided to feature the parts of its past that most troubled its core constituencies of Black and young voters. Bill Clinton made his mark on the Party by championing a turn away from social welfare and civil rights. His legacy includes policies that fuelled mass incarceration and demonized poor Black people, especially Black women, whom he made the focal point of his efforts to abolish welfare as an entitlement. During her campaign for the Presidency in 2016, Hillary Clinton was hounded by Black Lives Matter activists for referring to juveniles in 1996 as “super predators.” Barack Obama may be adored by many, but it was under his Administration that Occupy Wall Street and the Black Lives Matter movement erupted, in large part because of the unfulfilled promises of his historic run for office.\n\nThat the Party featured the old guard while still claiming a new path reflected the tensions throughout the Convention: joy alongside Harris’s bellicose promise of pursuing American values abroad with “the strongest, most lethal fighting force in the world”; challenges to misogyny and promotion of different kinds of family, but no concrete details on how Harris would address the crisis in child-care costs and the rising costs of living. The Convention featured four of the wrongly convicted, and since exonerated, Central Park Five before a segment that celebrated Harris’s career as a prosecutor. Most pointedly, speakers repeatedly framed the election as a struggle for democracy and a fight for freedom, yet the D.N.C. refused to give a single Palestinian American any time on the main stage. The refusal was in contrast to the Convention’s parade of Republicans, who were given speaking slots because they rejected Trump.\n\nThese conflicting messages seemed intended to inspire and embolden the base while also reaching voters who have not yet made up their minds. This dual purpose left Harris ill-equipped to speak about how she and her party plan to address the central issues of the election, including the hardships driven by economic inequality and inflation. Instead, she offered vague platitudes, promising an “opportunity economy where everyone has the chance to compete and a chance to succeed.” Harris pledged to “end” the housing shortage, with no details of how she would do it. There was almost no attempt to address the social questions that so sharply defined the 2020 race, when Harris was selected as Vice-President. Then, Harris decried “structural racism,” injustice in our criminal-justice system, and “excessive use of force by police.” In sum, she concluded, “there is no vaccine for racism. We’ve gotta do the work.” The new Democratic Party platform also featured this dramatic shift, burying the fight for racial justice of 2020. For the first time since 2012, the Party’s platform does not oppose the death penalty; it calls for more police, without emphasizing police reform.\n\nTo be sure, much has changed since 2020. But Harris is gambling that the millions of people who marched in search of resolution to the crisis of racism that year will simply move forward on this well-trodden path to the future. The Democratic Party is gambling that the nomination of a Black and Indian woman alone will satisfy the desires for racial justice. It is a risky strategy. The G.O.P. is prepared to flood the airwaves with an assortment of comments that Harris has made that will validate the “liberal” label. As one G.O.P. strategist put it, “The archive is deep.” In Harris’s previous run for President, she supported universal health care and free tuition for students at public colleges and universities. She raised the possibility of “starting from scratch” with Immigration and Customs Enforcement. She opposed fracking and called for an end to juvenile incarceration.\n\nEven though Bernie Sanders, Alexandria Ocasio-Cortez, and Elizabeth Warren are among the most popular Democrats in the country, and an unabashed strategy of leveraging public dollars to rebuild the U.S. economy and promising to address racial discrimination produced one of the largest voter turnouts in American history, Harris and the Party leadership have acquiesced to the terms of the Republican backlash and rejected anything having to do with the successful 2020 election. Instead of explaining why she has supported these positions, in hopes of persuading an electorate desperate for change and possibly open to her reasoning, Harris is trying to reinvent herself on the fly."
        },
        "article21": {
            "headline": "What I Heard at Swifties for Kamala",
            "text": "You might not be shocked to learn that Elizabeth Warren’s favorite Taylor Swift song is about cosmic justice.\n\n“I love ‘Karma,’” the senator from Massachusetts said last night during a Zoom event for a group called Swifties for Kamala. “And I have a thing or two to say about private equity!” The 34,000 attendees probably would have cheered, but, as is typical for such a massive webinar, only the organizers had control of the microphone and camera. Warren was undaunted by the lack of response. “It is going to be a tough fight ahead,” she said, winding up. “There are only 24 hours in a day—or 144 ‘All Too Well’ 10-minute versions.” [Pause for no laughter.] “But here’s the thing, just like you’ve done every time before, we will push this boulder up the hill.”\n\nOnly a die-hard Swiftie would have caught all the references in Warren’s words, which included a jab at the investment group backing Swift’s nemesis, Scooter Braun, and a lyric from a Swift deep cut said to be about the singer’s beef with Kim Kardashian. It seems safe to assume that Warren did not write all of these quips herself. But she would not be the only speaker on the call whose staffers had squeezed an unconscionable number of jokes into last night’s remarks.\n\nRead: The Millennial cringe of Taylor Swift\n\nIdentity-based calls to action have been all the rage in this season of Democratic politics, with events like White Dudes for Harris and Win With Black Women drawing tens of thousands of attendees. Although America’s Swifties are not an ethnic or racial group, they are arguably a religious one. Last night’s call was an attempt to harness their unflagging devotion to the pop star and put it to political use.\n\nThe whole thing was, somehow, even cringier than I had anticipated—and, as a Swiftie myself, I am familiar with the fandom’s extreme dorkiness. The organizers looked startlingly young and inexperienced—introducing lawmakers in shaky voices, clearly nervous to be blindly addressing thousands of viewers. They passed the mic too often, rambled, and misspoke. And the middle-aged politicians were working painfully hard to demonstrate fluency in the dialect of Swiftworld.\n\nStill, the cringe seemed, at least partly, the point. Like the broader Harris campaign, these organizers leaned into the awk. “There’s been a lot of talk about how joy isn’t a strategy,” Irene Kim, a Swifties for Kamala co-founder and its executive director, said on the call, citing a recent New York Times op-ed. “But that definitely hasn’t been our experience!”\n\nThe project began with a post by a 22-year-old named Emerald Medrano, who runs a popular Swift fan account. “I feel like us U.S. swifties should mass organize and help campaign for Kamala Harris,” he wrote on X in July. Soon, Swifties for Kamala was born: a partnership of fans, some of whom run social-media accounts and others who have experience in Democratic politics. A month later, the group has 71,000 followers on X, a Substack newsletter, and a Discord channel.\n\nThe organizers seem to assume that Swift, who backed Joe Biden in 2020, will support the Democratic nominee. But Swift has not actually endorsed anyone yet, a fact that went unacknowledged in last night’s call. Her support in the race is highly sought after; last week, Donald Trump shared tacky AI deepfakes to claim he had the pop star’s backing. During the Democratic National Convention, rumors swirled of a surprise musical performance: Would it be Taylor? (No.)\n\n“We’re keeping things political, but also everything has a layer of Swiftiness to it,” Annie Wu Henry, the campaign manager at Swifties for Kamala, who has also worked for Representative Alexandria Ocasio-Cortez and other progressive lawmakers, said during last night’s call. Organizers wore Swift-themed cardigans and displayed glittery #47s on their hands, in reference to what could be Harris’s place in the presidential timeline. They encouraged viewers in the Zoom chat to chip in either $13 or $19.89—both important Swiftian numbers—and, like Taylor, they frequently folded their hands into hearts for the camera.\n\nRead: Taylor Swift’s post-Reputation approach to politics\n\nThe Zoom event was light on policy talk, heavy on allusion. After Warren spoke, Representative Becca Balint of Vermont offered a pep talk: “The MAGA movement will be defeated by our dominoes, cascading in a line!” she said, quoting the song “Mastermind.” Senator Kirsten Gillibrand of New York read off a few jokes. “Karma is a relaxing thought, but for Donald Trump it’s not—facts!” she said, to the ever-silent audience. “If you’re in line to vote, stay, stay, stay!” When Senator Ed Markey of Massachusetts showed up, he revealed that his favorite Swift song is, oddly, “Snow on the Beach”—because it highlights the risks of global warming. “Climate change is threatening our favorite phenomenon,” the senator said, before adding that the waters outside Swift’s beach house in Rhode Island are “some of the fastest-warming … in the world!”\n\nJust like a Taylor Swift marketing campaign, the Zoom call promised surprises and exciting guests. There would be a big announcement at 8 p.m., organizers teased, and a very special person would wrap up the call at about 8:30 p.m. One special speaker was the singer-songwriter Carole King, now in her 80s, who materialized like a yellow-haired fairy godmother. King, who called Swift her “musical and songwriting granddaughter,” sang part of the chorus from “Shake It Off,” and offered advice to first-time campaign volunteers: “The key to door-knocking is asking a good question and then listening.” She urged Swifties to ask voters what they might find in common with Harris. “You’re building a bridge to that person,” King said—aware, apparently, of how much Swifties appreciate bridges.\n\nAt 8 o’clock, the big announcement was made: Merch drop! Swiftie T-shirts and tote bags reading In My Voting Era were for sale—no affiliation, organizers carefully reminded fans, with Swift herself.\n\nNearly two hours into the call, the surprise final guest—Representative Jasmine Crockett of Texas, a rising Democratic star—still hadn’t appeared. The leaders of Swifties for Kamala began signing off. “I’m so blessed, and so happy and fully immersed in Swiftie-ism right now,” Medrano said. “We’re going to paint the town blue, and it’s going to be the coolest thing that’s ever happened in this country!”\n\nThe letdown didn’t kill their enthusiasm—with Swifties, it never does. The group had raised money at a clip that the capitalist icon herself would have been proud of: The night’s fundraising haul totaled an auspicious $122,000. If Harris is hoping that joy and—yes—cringe can help her win the White House, she’s got the right fandom on her side."
        },
        "article22": {
            "headline": "Seven Questions That Should Be Easy for Harris to Answer",
            "text": "A presidential nominee normally accounts for their past actions in public life and clarifies their plans for the future. This year, Kamala Harris ran in no primaries, and since becoming the presumptive Democratic nominee, has not had a formal press conference where she would be expected to answer questions from reporters. She has not sat down for an in-depth interview on television or with a major paper such as The New York Times and The Washington Post. (CNN recently announced that Harris and her running mate, Minnesota Governor Tim Walz, will be interviewed by one of the network’s anchors this week.) This avoidance may be a strategy to keep the “good vibes” of her campaign going, but it does a disservice to voters and bodes poorly for how transparent and forthcoming Harris would be if she wins the presidency.\n\nBefore Harris was vice president or a U.S. senator, she spent roughly a quarter century in the criminal-justice system––she was California’s attorney general, San Francisco’s district attorney, and a deputy district attorney in Alameda County, a job she took shortly after graduating from law school. Her work as a prosecutor constitutes the bulk of her career. She wrote a 2009 book, Smart on Crime: A Career Prosecutor’s Plan to Make Us Safer, laying out her policy views. And she has talked a lot about criminal-justice issues in her years as a national politician.\n\nYet even her positions on important criminal-justice issues remain unclear, because of inconsistencies in her actions and statements and failures to address tough questions posed by critics of her record.\n\nRead: The prosecutor vs. the felon\n\nI sent the Harris campaign questions that voters deserve to have answered: about her record as a “top cop,” about apparent changes in her rhetoric and positions, and about what policies she would pursue if elected. At the time of publication, her campaign hasn’t provided any answers, but should that change, this story will be updated. Here are some of the questions I asked, edited for clarity and concision:\n\nDaniel Larsen, an unsympathetic defendant, was convicted of felony possession of a knife in 1999 after police testified that they saw him throw the weapon under a car in a Los Angeles parking lot. He got 28 years in prison. But as it turned out, a witness––James McNutt, a retired Army sergeant first class and former police chief––had been in the parking lot that night with his wife; both gave sworn statements that they saw a different man, William Hewitt, throw the knife under the car. Hewitt swore that’s what happened too. So did Hewitt’s girlfriend. Yet at trial, Larsen’s attorney failed to identify or call any of those witnesses; he also failed to request that the knife be examined for fingerprints or to argue that it belonged to someone else. He was later disbarred for failing other clients.\n\n\n\nIn 2009, just before you became attorney general of California, Judge Suzanne H. Segal ruled that Larsen’s case was one of those “extraordinary cases where the petitioner asserts his innocence and establishes that the court cannot have confidence in the contrary finding of guilt.” She declared that “no reasonable juror would have found Petitioner guilty beyond a reasonable doubt” and that he “clearly received ineffective assistance of counsel.” The state was ordered to retry the case or release Larsen.\n\n\n\nBut while you were attorney general, your office filed an appeal attempting to block Larsen’s release, because he hadn’t filed his claim for relief in a timely manner. In other words, your office sought to keep a man in prison on procedural grounds, despite strong evidence of his innocence. As a result, Larsen spent two more years in prison, until the Ninth Circuit Court of Appeals ruled that he had cleared the threshold for producing proof of innocence. Even then, your office continued to litigate the matter, arguing before a three-judge panel that “one reasonable juror could still vote to convict.” When that failed, forcing the prisoner’s release, your office worked to prevent Larsen from receiving funds earmarked for people who are wrongly convicted of crimes.\n\n\n\nWhy did your office work so hard to keep a man in prison after it was clear that he didn’t commit the crime that put him there?\n\nIn 2010, when you were San Francisco’s district attorney, a scandal rocked the crime lab run by the San Francisco Police Department. A technician who analyzed drugs was deemed “increasingly UNDEPENDABLE for testimony” by an assistant DA, a co-worker observed that the area where she tested drugs was in “disarray,” an audit found missing evidence, and the technician’s sister reported that she had a vial of cocaine at her house. She ultimately acknowledged taking evidence home for personal use. Her behavior raised the prospect of unreliable analysis and testimony in hundreds of cases. But neither you nor your office notified defense attorneys in potentially affected cases.\n\n\n\nThe San Francisco Chronicle reported on a judicial rebuke you received, writing that the judge “concluded that prosecutors had failed to fulfill their constitutional duty to tell defense attorneys” about problems in the crime lab, violating the rights of defendants. At the time, you defended your behavior and criticized the judge as biased. Later, while you were running for president in 2020, The Washington Post asked about the matter, and reported that you “took responsibility for the failings,” including your failure to develop a written policy so that your office “would notify defendants about problems with witnesses and evidence.” You told the Post, “No excuses. The buck stops with me.”\n\n\n\nIn the future, if a federal prosecutor is found to violate a defendant’s rights, what consequences should he or she face?\n\nIn Smart on Crime, you championed putting more police officers on the street, arguing that it would mean faster responses to assaults and robberies and fewer quality-of-life crimes. “Virtually all law-abiding citizens feel safer when they see police officers walking a beat,” you wrote. “This is as true in economically poor neighborhoods as wealthy ones.” But in a June 2020 radio interview, you said, “It is old thinking, it is outdated, and is actually wrong and backward to think that more police officers will create more safety.” That same month, appearing on The View, you said: “In many cities in America, over one-third of their city budget goes to police … What are we doing? What about the money going to social services? What about the money going to helping people with job training? What about helping with the mental-health issues that communities are being plagued with?”\n\n\n\nDid something cause you to change your position in the years after you published your book? If so, what? Do you still believe that cities should pay to put more police officers on the street?\n\nWhen you were attorney general of California, the ACLU faulted you for failing to protect the privacy of the state’s residents. “On your watch as California’s top cop, law enforcement agencies up and down the state have been secretly using social media surveillance software that has been marketed to monitor protests and activists of color,” they wrote. “Highly invasive facial recognition that may have a disproportionate impact on Californians of color is also being quietly used in several of our largest cities and counties. As the Attorney General, your leadership is urgently needed to address the lack of transparency, accountability, and oversight of law enforcement surveillance technology in order to fulfill your duty to safeguard the privacy, free speech, and civil rights of Californians.”\n\n\n\nWhat, if anything, did you do in response to that letter? And how does that response reflect your position on how transparent the government should be about the surveillance technologies that it uses?\n\nAs attorney general of California, you were criticized for taking a hands-off approach to credible abuse allegations against local prosecutors and police. “Harris sent an unmistakable signal,” the investigative reporter R. Scott Moxley wrote in a scathing 2019 OC Weekly article. “Under her watch, police-agency employees in California were free to commit perjury—even in death-penalty cases, as they did in Orange County.”\n\n\n\nAfter multiple Oakland police officers were accused of having sex with an underage girl, “civil rights lawyers and California residents had been pleading for then-Attorney General Kamala Harris to open an independent investigation into the situation, since it spanned several police departments and involved allegations of coverups,” Elizabeth Nolan Brown wrote in Reason magazine. “But she never responded to the petitions and pleas asking her to look into systemic sexual exploitation by state agents in Oakland.”\n\n\n\nDavid Campos, a former San Francisco supervisor and police commissioner and a vice chair of the California Democratic Party, told The New York Times, “We never thought we had an ally in the district attorney … When she had the opportunity to do something about police accountability, she was either not visible, or when she was, she was on the wrong side.”\n\n\n\nHow would you answer critics who say that you did too little to police the police, and if elected president, what approach would you take to federal oversight of law enforcement?\n\nDavid Daleiden is an anti-abortion activist. In 2015, he pretended to be a representative of a fetal-tissue-procurement company and met with Planned Parenthood, and later released surreptitiously taken videos to show those staffers discussing the sale of fetal tissue. Planned Parenthood says the videos were misleadingly edited. On July 31, 2015, the National Abortion Federation filed a lawsuit claiming that Daleiden violated privacy laws when taking the videos. As AG, you opened a criminal investigation. Daleiden was indicted by your successor. In a lawsuit, Daleiden says that he was targeted for prosecution because Planned Parenthood is an ideological ally that has given you campaign contributions.\n\n\n\nUndercover videos are sometimes used by journalists and activists on the right and the left. The people taking the videos argue that doing so is in the public interest and that they are exposing misconduct. Do you favor or oppose laws that make it unlawful for journalists and activists to surreptitiously capture video and release it to the public? How do you propose ensuring that such laws are enforced in an evenhanded manner?\n\nAs San Francisco’s district attorney, you prosecuted parents for their children’s habitual failure to attend school. Do you think district attorneys nationwide should pursue similar policies or that the risks of overly harsh enforcement are too high?\n\nRead: Why Kamala Harris’s politics are so hard to pin down\n\nCandidates aren’t informed about every issue. Sometimes, a reasonable answer is “I have to think about that and get back to you.” But Harris is well versed in all of these issues, having pondered them for years. Voters deserve to know where she stands on them today."
        },
        "article23": {
            "headline": "U.S. Army Confirms Trump Staffer ‘Pushed’ Arlington Staffer Before Filming TikTok Ad",
            "text": "Donald Trump is facing new questions on Thursday about a stunt the former president filmed at Arlington National Cemetery earlier this week. Photos of the 45th president giving a big thumbs up were the first to surface in an incredibly tacky, if typical, move for Trump. But new revelations from that day have been trickling out, including allegations of a physical altercation between Trump’s staff and a staff member at Arlington, as well as the fact that Trump likely broke federal law while filming the ad at the cemetery.\n\nIt all started Monday when Trump appeared at Arlington for a wreath-laying ceremony wreath for 13 U.S. military service members killed at Abbey Gate in Kabul, Afghanistan during the American withdrawal in 2021. Federal regulations prohibit the filming of campaign commercials and the production of publicity material, but Trump brought along a crew to document his little stunt.\n\nAs the New York Times points out, Trump was in a heavily restricted part of the cemetery known as Section 60, which is primarily for veterans of the wars in Iraq and Afghanistan, when a staff member at Arlington approached his camera crew. There was a physical altercation, with Trump’s staff insisting they should be allowed to film in the restricted area for their stupid little commercial.\n\nThe Arlington staff member has reportedly declined to press charges against Trump because it “could subject her to retaliation from Trump supporters,” as the Times reports. And that’s a reasonable fear, given the fact that Trump is the guy who tried to literally overthrow the U.S. government on January 6, 2021, and his followers are some of the most violent extremists around.\n\nThe Trump camp has tried to play down the incident and campaign spokesman Steven Cheung even slandered the Arlington staff member as mentally unstable on Wednesday.\n\n“The fact is that a private photographer was permitted on the premises and for whatever reason an unnamed individual, clearly suffering from a mental health episode, decided to physically block members of President Trump’s team during a very solemn ceremony,” Cheung told NPR.\n\nCheung added to NPR, “We are prepared to release footage if such defamatory claims are made.” But no footage showing details of the physical altercation has been released yet and NPR writes that when a reporter asked to see the footage, the Trump campaign declined.\n\nThe Army released a new statement about the incident on Thursday to defend the unnamed staff member at Arlington (ANC), who was simply trying to enforce the rules.\n\n“Participants in the August 26th ceremony and the subsequent Section 60 visit were made aware of federal laws, Army regulations and DoD policies, which clearly prohibit political activities on cemetery grounds. An ANC employee who attempted to ensure adherence to these rules was abruptly pushed aside,” an unnamed Army spokesperson told CNN in a statement on Thursday.\n\n“This incident was unfortunate, and it is also unfortunate that the ANC employee and her professionalism has been unfairly attacked. ANC is a national shrine to the honored dead of the Armed Forces, and its dedicated staff will continue to ensure public ceremonies are conducted with the dignity and respect the nation’s fallen deserve,” the statement continued.\n\nThe Trump campaign has released several staged videos from that day, and Trump himself says in one of the videos he’s churned out for social media that, “We lost 13 people great, great people, what a horrible day it was,” referring to the last day U.S. forces were officially in Afghanistan under wartime conditions. And then Trump insisted, “We didn’t lose one person in 18 months and then they took over that disaster of leaving Afghanistan.” That’s simply not true, of course. The Associated Press fact-checked his claim back in 2022 and reported there was no 18-month period during his presidency without casualties in Afghanistan.\n\nBut all of that is really beside the point. Trump clearly broke the law by trying this idiotic move at a place widely revered as a site of quiet contemplation. As he does with everything, Trump turned it into a circus all about himself.\n\nThe law Trump broke by filming at the cemetery is 32 CFR § 553.32, according to the Washington Post, which prohibits any politician from engaging in political activity at the site. The newspaper talked with legal experts who emphatically explained that “if the campaign was filming during the wreath-laying ceremony for partisan political activities, that would be a violation of federal law.”\n\nTrump is struggling in the national polls, as he and Kamala Harris have just a little over two months before Election Day. And it’s clear that Trump will do anything he can—including breaking federal law—in a desperate bid to retake power. With any luck, the former president will fail in those efforts. But things could get a lot weirder before they get any better on November 8."
        },
        "article24": {
            "headline": "JD Vance urges Peter Thiel to back Trump: 'Get off the sidelines'",
            "text": "JD Vance is urging Peter Thiel, the tech billionaire who helped fund his Senate run, to back Trump.\n\nThiel backed Trump's 2016 campaign but has stepped back from politics since 2022.\n\n\"He's going to be really exhausted by politics if we lose,\" Vance said.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Go to newsletter preferences Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nWith a little more than two months until Election Day, Sen. JD Vance of Ohio is urging his biggest financial backer, the tech billionaire Peter Thiel, to get involved in the 2024 campaign.\n\n\"He is fundamentally a conservative guy, and I think that he needs to get off the sidelines and support the ticket,\" Vance told the Financial Times this week.\n\nThiel, who cofounded PayPal and Palantir and is known for his contrarian, conservative views, notably supported Donald Trump in 2016 when few others in Silicon Valley would. He even spoke at the Republican National Convention that year, and he remains one of the few openly gay people to do so. He donated $1.25 million to pro-Trump groups that year.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in ."
        },
        "article25": {
            "headline": "The middle class's worst retirement fear",
            "text": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nAs a retirement tsunami looms in the US, life after work is top of mind for many. And some Americans worry they'll survive longer than Social Security.\n\nOn Wednesday, the Transamerica Center for Retirement Studies released its 2024 retirement outlook for the middle class. It delved into the financial concerns and retirement preparations for those with annual household incomes of $50,000 to $199,999 using a sample of just over 10,000 people — about 5,000 of whom fell into the middle-class category.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nAs it turns out, middle-class workers have plenty of worries about retirement. Their greatest fear is outliving their savings and investments.\n\nAmong those with household incomes of $50,000 to $99,000 and those with incomes of $100,000 to $199,000, 40% of both groups said that sticking around longer than their nest eggs was one of their greatest fears in retirement.\n\nAdvertisement\n\nThat comes as middle-class Americans expect to live to a median age of 90, over a decade more than the US's current life expectancy of 77.5. Americans aged 65, which is about the average retirement age, can expect to live an average of 18.4 more years — a significant amount of time to rely on savings or Social Security.\n\nIt makes sense, then, that middle-class Americans are worried about the future of Social Security, which often fills the gap between retirees' savings and their financial needs. Broadly, 39% of those in the middle-class cohort said that one of their greatest fears in retirement was that Social Security would be reduced — or simply cease to exist — in the future.\n\nRelated stories\n\nThe uncertain future of Social Security has long had older generations concerned. According to the latest Social Security and Medicare Board of Trustees report, the program will only be able to pay out full benefits for the next 11 years — meaning that after that point, benefits will dwindle if Congress does not step in.\n\nThat's particularly troubling for Americans who have relied primarily on Social Security benefits to stay afloat financially in retirement. In a recent NerdWallet study of 2,100 adults, just 30% of respondents said they believe Social Security alone will allow them to live comfortably in retirement.\n\nAdvertisement\n\nOne 63-year-old previously told Business Insider that she's \"incredibly scared\" Social Security won't be enough to cover her expenses. \"I think I'll probably need to work until I die because there's no money,\" she said.\n\nThe report also found that worries about Social Security are a primary reason some middle-class people plan to work after retirement. Of the 52% who plan to work after they retire, 55% plan to do so because of the extra income, while 33% are concerned Social Security benefits will be lower than expected.\n\nWith the presidential election quickly approaching, the fate of Social Security and Medicare is a hot-button issue for both Vice President Kamala Harris and former President Donald Trump. While Trump has vowed to protect benefits for older Americans, Democrats have accused the GOP of threatening to cut the benefits and raise the retirement age. The issue is likely to get more heated as November gets closer.\n\nAre you worried about outliving your retirement savings? Contact these reporters at jkaplan@businessinsider.com and asheffey@businessinsider.com."
        },
        "article26": {
            "headline": "Liveblog zur US-Wahl 2024: Trumps Kamerateam soll auf Nationalfriedhof Ärger gemacht haben",
            "text": "In der Kontroverse um einen Besuch des früheren US-Präsidenten Donald Trump auf dem Nationalfriedhof in Arlington hat sich das US-Militär zu Wort gemeldet. Ein Sprecher teilte mit, dass ein Friedhofsmitarbeiter „abrupt beiseitegestoßen“ worden sei. Der republikanische Präsidentschaftskandidat Trump hatte am Montag auf dem Friedhof nahe der US-Hauptstadt Washington bei einer Kranzniederlegung der vor drei Jahren bei einem Selbstmordanschlag in Afghanistan getöteten US-Soldaten gedacht. Im Anschluss gab es Berichte, wonach es zu einer Auseinandersetzung zwischen Trumps Team und Mitarbeitern des Friedhofs kam.\n\n\n\n\n\nDer Militärsprecher stellte nun klar: Die Teilnehmer der Zeremonie seien auf geltende Gesetze, Armeevorschriften und Richtlinien des Verteidigungsministeriums hingewiesen worden, die politische Aktivitäten auf dem Friedhofsgelände eindeutig untersagten. Ein Friedhofsmitarbeiter, der versuchte, die Einhaltung dieser Regeln zu gewährleisten, sei schließlich beiseitegestoßen worden. Der Mitarbeiter habe sich professionell verhalten und dazu entschlossen, keine Anzeige zu erstatten, so der Militärsprecher. „Daher betrachtet das Militär diese Angelegenheit als abgeschlossen.“\n\n\n\n\n\nDer Sprecher machte keine Angaben dazu, wer den Friedhofsmitarbeiter zur Seite gestoßen habe. Er teilte lediglich mit, dass es „bedauerlich“ sei, dass ein Mitarbeiter „zu Unrecht angegriffen“ worden sei. Die engagierten Mitarbeiter des Nationalfriedhofs würden weiterhin dafür sorgen, „dass öffentliche Zeremonien mit der Würde und dem Respekt durchgeführt werden, den die Gefallenen der Nation verdienen“."
        },
        "article27": {
            "headline": "Liveblog zur US-Wahl 2024: Trump provoziert mit vulgärem Kommentar zu Harris",
            "text": "In der Kontroverse um einen Besuch des früheren US-Präsidenten Donald Trump auf dem Nationalfriedhof in Arlington hat sich das US-Militär zu Wort gemeldet. Ein Sprecher teilte mit, dass ein Friedhofsmitarbeiter „abrupt beiseitegestoßen“ worden sei. Der republikanische Präsidentschaftskandidat Trump hatte am Montag auf dem Friedhof nahe der US-Hauptstadt Washington bei einer Kranzniederlegung der vor drei Jahren bei einem Selbstmordanschlag in Afghanistan getöteten US-Soldaten gedacht. Im Anschluss gab es Berichte, wonach es zu einer Auseinandersetzung zwischen Trumps Team und Mitarbeitern des Friedhofs kam.\n\n\n\n\n\nDer Militärsprecher stellte nun klar: Die Teilnehmer der Zeremonie seien auf geltende Gesetze, Armeevorschriften und Richtlinien des Verteidigungsministeriums hingewiesen worden, die politische Aktivitäten auf dem Friedhofsgelände eindeutig untersagten. Ein Friedhofsmitarbeiter, der versuchte, die Einhaltung dieser Regeln zu gewährleisten, sei schließlich beiseitegestoßen worden. Der Mitarbeiter habe sich professionell verhalten und dazu entschlossen, keine Anzeige zu erstatten, so der Militärsprecher. „Daher betrachtet das Militär diese Angelegenheit als abgeschlossen.“\n\n\n\n\n\nDer Sprecher machte keine Angaben dazu, wer den Friedhofsmitarbeiter zur Seite gestoßen habe. Er teilte lediglich mit, dass es „bedauerlich“ sei, dass ein Mitarbeiter „zu Unrecht angegriffen“ worden sei. Die engagierten Mitarbeiter des Nationalfriedhofs würden weiterhin dafür sorgen, „dass öffentliche Zeremonien mit der Würde und dem Respekt durchgeführt werden, den die Gefallenen der Nation verdienen“."
        },
        "article28": {
            "headline": "Liveblog zur US-Wahl 2024: Anzeige nach Gerangel mit Trump-Team auf Soldatenfriedhof",
            "text": "In der Kontroverse um einen Besuch des früheren US-Präsidenten Donald Trump auf dem Nationalfriedhof in Arlington hat sich das US-Militär zu Wort gemeldet. Ein Sprecher teilte mit, dass ein Friedhofsmitarbeiter „abrupt beiseitegestoßen“ worden sei. Der republikanische Präsidentschaftskandidat Trump hatte am Montag auf dem Friedhof nahe der US-Hauptstadt Washington bei einer Kranzniederlegung der vor drei Jahren bei einem Selbstmordanschlag in Afghanistan getöteten US-Soldaten gedacht. Im Anschluss gab es Berichte, wonach es zu einer Auseinandersetzung zwischen Trumps Team und Mitarbeitern des Friedhofs kam.\n\n\n\n\n\nDer Militärsprecher stellte nun klar: Die Teilnehmer der Zeremonie seien auf geltende Gesetze, Armeevorschriften und Richtlinien des Verteidigungsministeriums hingewiesen worden, die politische Aktivitäten auf dem Friedhofsgelände eindeutig untersagten. Ein Friedhofsmitarbeiter, der versuchte, die Einhaltung dieser Regeln zu gewährleisten, sei schließlich beiseitegestoßen worden. Der Mitarbeiter habe sich professionell verhalten und dazu entschlossen, keine Anzeige zu erstatten, so der Militärsprecher. „Daher betrachtet das Militär diese Angelegenheit als abgeschlossen.“\n\n\n\n\n\nDer Sprecher machte keine Angaben dazu, wer den Friedhofsmitarbeiter zur Seite gestoßen habe. Er teilte lediglich mit, dass es „bedauerlich“ sei, dass ein Mitarbeiter „zu Unrecht angegriffen“ worden sei. Die engagierten Mitarbeiter des Nationalfriedhofs würden weiterhin dafür sorgen, „dass öffentliche Zeremonien mit der Würde und dem Respekt durchgeführt werden, den die Gefallenen der Nation verdienen“."
        },
        "article29": {
            "headline": "Kamala Harris Once Took Her Cousin To A Bad Religion Concert",
            "text": "Kamala is brat, we know that much so far. People have also made memes to turn the presidential candidate into a fan of Burial, Death Grips, Ween, and other acts. Over the weekend, the Spanish international news agency EFE shared an interview with Harris’ cousin Sharada Balachandran Orihuela, who revealed that Harris once took her to a Bad Religion concert.\n\nOrihuela spent most of her life in Mexico and India, but moved to Oakland, California in 2001. Harris took her shopping and to demonstrations and concerts. In fact, Harris brought her to her first concert: Bad Religion in San Francisco.\n\n“Bad Religion was one of my favorite bands,” Orihuela said. “I went to high school in India, and there weren’t many punk-rock concerts there. I listened to their music on my Walkman, and when I moved to the United States, I thought that now I could go to all those concerts.”\n\nRead the full interview here."
        },
        "article30": {
            "headline": "The Tech-Trump Alliance",
            "text": "This is an edition of The Atlantic Daily, a newsletter that guides you through the biggest stories of the day, helps you discover new ideas, and recommends the best in culture. Sign up for it here.\n\nSome of the most prominent figures in Silicon Valley are enthusiastically supporting Donald Trump’s campaign. And Trump’s running mate, J. D. Vance, is a former venture capitalist with deep ties to the right-wing tech billionaire Peter Thiel; as my colleague Ali Breland put it in a recent article, Silicon Valley “got their guy.” I spoke with Ali, who covers tech and right-wing politics, about the long-simmering ideas animating Silicon Valley’s shift to the right.\n\nReturning to Their Roots\n\nLora Kelley: Many people think of the Silicon Valley tech scene as a pretty liberal one. Is that assumption true? And if so, how did we get to this point where some of the most visible leaders in tech are backing Trump?\n\nAli Breland: There is a shift happening. I don’t want to discount that. But this, to me, is also indicative of some segments of Silicon Valley returning to their roots.\n\nIf you look back at some of the original literature that was coming out of the tech scene—the early issues of Wired magazine, or the Whole Earth Catalog—they featured not necessarily hard-right ideologies but these free-market, libertarian ideologies. This kind of stuff was always flowing through Silicon Valley, even when tech executives were voting for and supporting Democrats. A lot of tech companies’ business models involve finding ways to circumvent regulation and then hiring workforces that are not on staff or are extremely difficult to unionize.\n\nThe tech industry supported Democrats such as Barack Obama in part because he allowed that culture to exist within his version of liberalism. Tech titans perceive Kamala Harris and Joe Biden to be chipping away at that flexibility, so they’re turning to a right that they see as more friendly to tech.\n\nLora: Is the selection of Vance as Trump’s running mate hastening this turn?\n\nAli: Elon Musk was very excited when Trump picked Vance; he posted on X that the ticket “resounds with victory.” Some tech people seem to be feeling: He’s one of us. He’s connected to Peter Thiel. He worked out here. He believes in what we believe. There are certainly people coalescing around the campaign because of that.\n\nVance is where he is in large part because of Thiel’s $15 million donation to his Senate campaign. Even though Thiel has said he isn’t donating this cycle, the 2021 campaigns of Vance and Blake Masters were a warm-up moment. Venture capitalists were giving many millions more to the right than to Democrats in that cycle.\n\nLora: How pervasive is the support for Trump in Silicon Valley? Is the entire sector shifting? Or is it more that a few loud voices are getting lots of attention?\n\nAli: There are different factions. A lot of tech workers still skew left, or believe in a liberal version of the free market. And a lot of the tech-titan set are still Democrats: There’s Aaron Levie of the software company Box; Reid Hoffman, a co-founder of LinkedIn, is the mega Democratic donor of Silicon Valley; Sheryl Sandberg has publicly supported Kamala Harris.\n\nBut we are also seeing a group of right-backing tech titans expressing a new rhetoric that didn’t have a place in Silicon Valley before. Thiel, for example, has been pushing his far-right beliefs into the ether for a long time. At one point, he was treated as an oddity. Now he’s in step with the prevailing ideological movement among tech billionaires.\n\nLora: What are some of the ideas animating this new rhetoric?\n\nAli: In the techno-optimist manifesto that Marc Andreessen released last fall, he cites Nick Land, a British philosopher who became important in the intellectual development of the far right. He also cites F. T. Marinetti, who was an Italian futurist and fascist. And he quotes Friedrich Nietzsche, who is not inherently right-wing, but who is having a moment among this set of right-wing advocates of eugenics and a “natural order” who want to see “strongmen” take over, and who see feminists and the DEI movement as getting in the way of the country’s true potential. I don’t know if Andreessen believes in all of that. But that appeal to the strongman is indicative of the new right-wing thinking that’s taking shape in Silicon Valley.\n\nLora: Some of this seems to be about ideology and values. But what are some of the more immediate policy concerns that are pushing tech titans toward the right?\n\nAli: A lot of tech leaders want to be left alone and unregulated. And there’s lately been a shift in how the industry perceives Democrats to be approaching tech. Biden’s appointment of Lina Khan, a proponent of stringent antitrust law, to lead the Federal Trade Commission is something tech people bring up a lot, and cite as an example of Biden not being interested in helping the industry. Even Andreessen has suggested that he misses the old Democrats who gave tech this cozy place and let them do what they want.\n\nThere is also a large crypto contingent that sees Biden as aggressively anti-crypto, and they’re very skeptical of his appointment of Gary Gensler as the chair of the Securities and Exchange Commission. They’re a bit more cautiously optimistic about Harris. But they still see Trump as the clearest path toward a low-regulation environment that’s good for them.\n\nClearly, there is an aesthetic sensibility that crypto people appreciate about Trump, too. There’s a troll-y aspect, and both Trump’s MAGA base and the crypto community have ties to 4chan. Still, in past election cycles, crypto communities were not broadly pro-Trump, because there was no clear edge for them and their own material interests. Now some tech leaders see Trump as a way to satisfy those interests.\n\nRelated:\n\nHere are three new stories from The Atlantic:\n\nToday’s News\n\nThe U.S. Army said that an Arlington National Cemetery employee, who tried to ensure that Donald Trump’s team adhered to the cemetery’s rules against political activity during his recent visit, was “abruptly pushed aside.” An interview with Vice President Kamala Harris and Tim Walz will air tonight on CNN. They answered questions about their plans for the White House, why Harris changed her position on decriminalizing illegal border crossings, and Trump’s attacks on her racial identity. U.S. National Security Adviser Jake Sullivan met with Chinese President Xi Jinping in Beijing. They discussed U.S.-China relations and tensions in the South China Sea.\n\nDispatches\n\nTime-Travel Thursdays: Caroline Mimbs Nyce reviews a brief history of The Atlantic’s use of a familiar type of headline.\n\nExplore all of our newsletters here.\n\nEvening Read\n\nIllustration by Joanne Imperio / The Atlantic. Sources: Bettmann / Getty; Heritage Art / Getty; NY Daily News Archive / Getty.\n\nWhat a 100-Year-Old Trial Reveals About America\n\nBy John Kaag\n\nThirty years ago, when I was an eighth grader at a small public school in central Pennsylvania, my biology teacher informed us that we would be studying evolution, which she described as “an alternative theory to the story of divine creation.” She was usually imperturbable, but I remember noticing that, just for a moment, her voice had a certain tone; her face, a certain expression—an uncanny mix of anxiety, fear, and rage. Roughly a century ago, the trial of John T. Scopes marked a flash point in an American culture war—between religious faith and science—that has been waged, in one form or another, to this day.\n\nRead the full article.\n\nMore From The Atlantic\n\nCulture Break\n\nIllustration by The Atlantic. Sources: Brian Bowen Smith / ABC; Craig Blankenhorn / Max; Getty.\n\nWatch. TV has turned in a new direction, Hannah Giorgis wrote in 2023. Shows such as The Golden Bachelor and And Just Like That have been curious—and insightful—about love after 50.\n\nRead. Eliza Griswold’s new book, Circle of Hope, examines the forces that led to the collapse of a progressive evangelical church.\n\nPlay our daily crossword.\n\nStephanie Bai contributed to this newsletter.\n\nWhen you buy a book using a link in this newsletter, we receive a commission. Thank you for supporting The Atlantic."
        },
        "article31": {
            "headline": "Wahlkampf gegen Harris: Trump zielt unter die Gürtellinie",
            "text": "US-Wahl 2024\n\nWahlkampfkommentare zu Harris Trump zielt unter die Gürtellinie Stand: 29.08.2024 07:44 Uhr\n\nTrotz Warnungen aus seiner eigenen Partei: Der republikanische Präsidentschaftskandidat Trump provoziert weiter mit persönlichen Attacken auf seine Konkurrentin Harris. Jetzt deutete er einen Sexskandal an.\n\nDonald Trump versucht weiter, mit derben Kommentaren die Aufmerksamkeit im US-Wahlkampf auf sich zu ziehen. Auf der von ihm mitbegründeten Plattform \"Truth Social\" waren Andeutungen zu lesen, wonach sexuelle Gefälligkeiten die politische Karriere von Kamala Harris befördert haben könnten.\n\nAnspielungen auf Sex-Skandal von Bill Clinton\n\nIn dem Post des republikanischen Präsidentschaftskandidaten ist ein älteres Bild von Harris zu sehen, auf dem sie neben der früheren US-Außenministerin und Präsidentschaftskandidatin Hillary Clinton steht. Dazu der Kommentar: \"Lustig, wie sich Blowjobs auf ihre beiden Karrieren unterschiedlich ausgewirkt haben ...\"\n\nDie Bemerkung ist eine Anspielung auf einen Sexskandal, in den Clintons Mann und Ex-Präsident Bill während dessen Präsidentschaft (1993 bis 2001) verwickelt gewesen war. Die Andeutungen sind in dem Post nicht mit Quellen belegt, werden aber dennoch von Trump-Anhängern geteilt.\n\nTrump verfasste den Beitrag nicht selbst. Dass er ihn auf seinem offiziellen Truth-Social-Account verbreitete, ist dennoch bemerkenswert. Der Republikaner verunglimpft seine demokratische Gegnerin im Präsidentschaftsrennen regelmäßig. Unter anderem bezeichnet er sie als \"verrückt\" und \"dumm\".\n\nTrump hat Harris auch schon mit Blick auf ihre Hautfarbe und Herkunft attackiert und unter anderem behauptet, die 59-Jährige sei \"vor einigen Jahren plötzlich schwarz\" geworden. Verbale Angriffe sexueller Art haben eine neue Qualität.\n\nBei einer Wahlkampfveranstaltung in Chicago kommentierte Trump die Hautfarbe von Kamala Harris.\n\nImmer wieder persönliche Angriffe - trotz Mahnungen\n\nMehrere Republikaner hatten Trump zuletzt öffentlich dazu geraten, weniger persönliche Attacken gegen Harris von sich zu geben, sondern mehr inhaltliche Punkte zu machen. Trump wurde kürzlich bei einer Pressekonferenz auf diese Mahnungen angesprochen, tat solche Ratschläge jedoch ab.\n\n\"Ich glaube, ich habe ein Recht darauf, sie persönlich zu attackieren\", sagte der 78-Jährige mit Blick auf Harris und den Wahlkampf und schob nach: \"Ich muss es auf meine Art machen.\"\n\nSchon im Wahlkampf 2016 hatte Trump mit einer vulgären Aussage für Furore gesorgt, dass er Frauen überall anfassen könne, auch zwischen den Beinen. Die Amerikaner wählten ihn damals trotzdem zum Präsidenten."
        },
        "article32": {
            "headline": "New Trump indictment filed in Jan. 6 case. And, how to watch the Paralympic Games",
            "text": "New Trump indictment filed in Jan. 6 case. And, how to watch the Paralympic Games\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\n\n\nToday's top stories\n\nProsecutors have filed another indictment against former President Donald Trump in the federal election interference case, weeks after the Supreme Court gave the former president substantial immunity from prosecution. Court documents say the new indictment was presented to a grand jury that hadn’t previously heard evidence in the Jan. 6 case. The core charges in the D.C.-based case remain the same: conspiracy to defraud the U.S. and to deprive millions of 2020 voters of their rights.\n\ntoggle caption Anna Moneymaker/Getty Images\n\n🎧 NPR’s Carrie Johnson tells Up First the biggest change in the new indictment is that the allegations about Trump misusing the Justice Department to try to promote claims of election fraud are gone. In court papers, Special Counsel Jack Smith said this latest action was an effort to respect and implement the Supreme Court holdings. The new charges specify when prosecutors think Trump was acting as a candidate seeking political office and not as the President. If he wins the election in November, Trump could order the Justice Department to dismiss the case. If he loses, Johnson says all the legal wrangling could get even more intense.\n\nSponsor Message\n\nTwo members of Trump’s campaign staff had a verbal and physical altercation with an official at Arlington National Cemetery on Monday while Trump was attending a ceremony honoring 13 troops killed in Afghanistan in 2021. Campaign officials strongly deny this. NPR learned a cemetery official tried to prevent Trump staffers from filming and photographing in a section where recent U.S. casualties are buried. Arlington Cemetery officials had made their rules clear in advance of the visit.\n\n\n\n🎧 Trump’s motorcade arrived with several Gold Star family members whose loved ones are buried at the cemetery, NPR’s Quil Lawrence says. The campaign brought a staffer to get footage of the visit. When a cemetery official tried to prevent that, she was verbally abused and pushed aside. Trump’s campaign says they’re prepared to release footage showing there was no physical altercation. The cemetery confirmed the incident happened and a report was filed.\n\nThe Paralympic Games kick off in Paris tonight, bringing around 4,400 athletes together to compete in nearly 200 events over the next week and a half. The participating athletes have all overcome tremendous challenges in their lives, including limb amputation or disease taking away their eyesight. They’ll compete across 22 different sports, most of which have an Olympic equivalent. In all, nearly 550 medals will be awarded.\n\n\n\nSponsor Message\n\n🎧 Americans aren’t quite the powerhouse at the Paralympics that they are at the Olympic Games , NPR’s Becky Sullivan says. China has won the most gold medals and medals overall in the past couple of decades. Sullivan says viewers should look out for 24-year-old swimmer Ali Truwit from Connecticut, who has been a competitive swimmer all her life. Last year, her left leg was amputated below the knee after she was bitten by a shark. She’s competing in three events.\n\n, NPR’s Becky Sullivan says. China has won the most gold medals and medals overall in the past couple of decades. Sullivan says viewers should look out for 24-year-old swimmer Ali Truwit from Connecticut, who has been a competitive swimmer all her life. Last year, her left leg was amputated below the knee after she was bitten by a shark. She’s competing in three events. ➡️ Here’s everything you need to know about the Paralympic Games, including how to watch.\n\nDeep dive\n\ntoggle caption Dibyangshu Sarkar/AFP via Getty Images\n\nA young woman was raped and murdered while on break from a 36-hour shift at RG Kar Medical College and Hospital in Kolkata, India earlier this month. She was found with extensive injuries in the seminar hall of the hospital. The case has once again brought concerns about women’s safety to the forefront of the country — especially from women in health care. Along with protests demanding better security measures for women, medical professionals are speaking out about the lack of respect in their workplace.\n\n\n\n⚕️ Women say they’re harassed at work by peers and patients.\n\npeers and patients. ⚕️ Nationwide anger has sparked due to the increasing frequency of reports of sexual crimes against women in India from 25,000 rape cases in 2012 to 31,000 a decade later.\n\nof reports of sexual crimes against women in India from 25,000 rape cases in 2012 to 31,000 a decade later. ⚕️ The Indian Medical Association, one of the country’s largest unions representing doctors, is demanding increased security protocols that are “no less than an airport” for all hospitals.\n\nthat are “no less than an airport” for all hospitals. ⚕️ These safety concerns have brought attention to India’s low rates of employment among women.\n\nToday's listen\n\ntoggle caption Chip Somodevilla/Getty Images/Getty Images North America\n\nCelebrities have endorsed presidential candidates for over a century. Today, Trump has Rosanne Barr and Hulk Hogan in his corner, while Vice President Harris has George Clooney and Beyoncé on her side. The rich and famous have the ability to move audiences, but can they move the polls and turn an election?\n\n\n\nSponsor Message\n\n🎧 Listen to some vintage celebrity endorsements and learn how they have shaped elections over the past 100 years.\n\n3 things to know before you go\n\ntoggle caption U.S. Customs and Border Protection\n\nA man driving a commercial tractor-trailer attempted to haul $5 million worth of methamphetamine into the U.S. from Mexico disguised as a watermelon harvest. In 2014, Ian Sandler’s 9-year-old daughter, Riley, was at sleepaway camp for the summer when she had a medical emergency around 1:30 a.m. The hospital was hours away and Ian was too shaken to drive so he booked an Uber. The driver, his unsung hero, empathized with him, something Ian remembers from the devastating time. Naomi Osaka advanced to the second round of the U.S. Open after defeating No. 10 seed Jelena Ostapenko. It's her first win against a top 10 opponent in four years.\n\nThis newsletter was edited by Suzanne Nuyen."
        },
        "article33": {
            "headline": "How to Watch the Kamala Harris-Tim Walz CNN Interview Online Without Cable",
            "text": "If you purchase an independently reviewed product or service through a link on our website, Rolling Stone may receive an affiliate commission.\n\nA week after accepting the 2024 nomination for president at the Democratic National Convention, Vice President Kamala Harris and her running mate, Minnesota governor Tim Walz, will both sit down for their first interview together with CNN tonight. “The First Interview: Harris & Walz A CNN Exclusive” is set to take place live from the battleground state of Georgia.\n\nAt a Glance: How to Watch Harriz-Walz CNN Interview Online\n\nStreaming online, tonight’s Q&A marks the Harris-Walz campaign’s first major sit-down as the party’s nominee since President Biden dropped out of the race, and with only a few days left to go before Harris debates former president Donald Trump in September.\n\n“To be clear, my entire career, I have only had one client: the people,” Harris told the crowd during her speech at the Democratic National Convention in Chicago last week. “And so, on behalf of the people, on behalf of every American — regardless of party, race, gender, or the language your grandmother speaks. … On behalf of everyone whose story could only be written in the greatest nation on Earth, I accept your nomination to be president of the United States of America.”\n\nNow, Harris, along with Walz, will answer questions from CNN anchor and chief political correspondent Dana Bash, likely diving deeper into the policies and issues the vice president addressed during her DNC speech. Here’s how to watch the Harris-Walz CNN exclusive interview online tonight.\n\nHow to Watch Harris-Walz CNN Interview Online\n\nDon’t have cable? Here are the live TV streaming services that carry CNN.\n\nStream Harris-Walz CNN Interview on DirecTV Stream\n\nOne of our top streaming service recommendations that lets you watch tonight’s Harris-Walz interview online, DirecTV Stream carries CNN in addition to 90+ channels. A DirecTV Stream subscription normally starts at $79.99 a month, but the service currently offers your first three months at $49.99 per month — a $90 discount overall. DirecTV Stream also comes with a five-day free trial.\n\nDirecTV Stream is one of the most comprehensive live TV streaming services with up to 160+ channels, including local channels, regional sports networks, and all popular national channels.\n\nStream Harris-Walz CNN Interview on Hulu + Live TV\n\nHulu + Live TV carries CNN in its 95-plus channel lineup, and makes it easy to watch the Harris-Walz CNN interview if you’ve ditched cable. A Hulu + Live TV subscription also gets you both Disney+ and ESPN+, and costs $76.99 per month for an ad-supported package. Bonus: New subscribers can get a Hulu + Live TV three-day free trial to start.\n\nHulu + Live TV bundles together Hulu’s own library of content, along with a huge variety of live TV channels for watching new series, news, and sports. The service also now offers a limited-time free trial for new subscribers.\n\nStream Harris-Walz CNN Interview on Sling TV\n\nSling TV is one of the more affordable streaming services for watching live TV, with a Sling Blue subscription starting at $45 a month. Better yet, Sling offers new subscribers a discount on their first month of streaming for $22.50. Your Sling subscription includes 45 channels overall, including CNN to watch tonight’s Harris-Walz interview online.\n\nSling carries CNN in both its Orange or Blue packages. A Sling Blue plan costs $22.50 a month for your first month and includes up to 45 channels. A Sling Orange plan, meantime, costs $20 a month for your first month, and offers up to 34 total channels.\n\nWhere to Watch the Harris-Walz Interview for Free\n\nDirecTV Stream and Hulu + Live TV both offer free trials to livestream tonight’s Harris-Walz CNN interview before you have to commit to paying for a monthly subscription.\n\nWhat Time is Harris-Walz CNN Interview on TV?\n\nThe vice president and Minnesota governor’s CNN interview will air live on the network at 9 p.m. ET."
        },
        "article34": {
            "headline": "Filmfest Venedig: Sigourney Weaver: «Wir sind alle so begeistert von Kamala»",
            "text": "Die US-amerikanische Schauspielerin Sigourney Weaver hat ihre Unterstützung für die demokratische US-Präsidentschaftskandidatin Kamala Harris ausgedrückt. «Wir sind alle so begeistert von Kamala», sagte die 74-Jährige in Venedig. «Es war seit 2016 eine schwierige Zeit, und wir sind alle sehr dankbar für sie.»\n\nWeaver bezog sich mutmaßlich auf die US-Wahl 2016, als Donald Trump zum Präsidenten gewählt wurde. Die nächste Präsidentschaftswahl in den USA findet am 5. November statt. Eine Journalistin hatte Weaver in Venedig bei einer Pressekonferenz gefragt, ob sie glaube, dass Filme dazu beitragen könnten, dass jemand wie Harris Präsidentin würde.\n\nMehrmals wurde Weaver, die mit dem Film-Klassiker «Alien» berühmt geworden ist, für die Pionierarbeit gelobt, die sie für Frauen im öffentlichen Raum geleistet habe - mit vielschichtigen Frauenrollen, die keine Klischees bedienten. Sichtlich gerührt bedankte sich die Schauspiel-Ikone in Venedig dafür und sagte: «So viele Frauen kommen zu mir und bedanken sich...», bevor ihre Stimme abbrach und ihr die Tränen kamen.\n\n«Entschuldigung, ich brauche meinen Wodka», scherzte sie im Anschluss, um dann aus einer Wasserflasche zu trinken. «Ich werde immer gefragt, warum ich \"starke Frauen\" spiele. Meine Reaktion ist dann immer: Das ist so eine seltsame Frage. Denn ich spiele einfach Frauen. Und Frauen sind stark, und Frauen geben nicht auf. Wissen Sie, warum? Weil wir es uns nicht erlauben können. Wir müssen es tun.»\n\nBei der Eröffnung des Filmfestivals erhält Weaver heute Abend den Goldenen Löwen für ihr Lebenswerk.\n\n© dpa-infocom, dpa:240828-930-215591/1"
        },
        "article35": {
            "headline": "Trump's social media stock is tanking. Here are 2 possible reasons.",
            "text": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nEarlier this year, Donald Trump's social media company was worth something like $9 billion.\n\nBut that was then, and its stock has been sinking since: Now investors think Trump Media & Technology Group Corp — the company that runs Truth Social, Trump's Twitter clone — is worth a mere $4 billion. Today its stock closed at just above $20 a share, the lowest it has been since the company had its equivalent of an IPO in March.\n\nWhat's going on?\n\nTo start, a caveat we've mentioned before: DJT is a meme stock. Investors aren't valuing it based on the company's financials, which are very meager at best. They think it's worth something because other people think it's worth something, and that collective fantasy will work right up until it doesn't.\n\nAdvertisement\n\nSo trying to figure out why DJT is moving up or down on any given day isn't likely to lead to a satisfactory answer. Mostly you're going to get something along these lines: ¯\\_(ツ)_/¯\n\nStill. We can at least acknowledge that DJT has been sliding for quite some time. So there's something going on.\n\nOne reason Trump's stock may be moving down is that lots of people who own Trump stock are Trump fans, and/or people betting that Trump will win the November election. But it has been harder to be in one of those groups recently: Since Kamala Harris replaced Joe Biden as Trump's opponent, Trump has been losing ground in the polls, and now both The New York Times and pollster Nate Silver see him as a slight underdog.\n\nSo if DJT is a proxy for Trump's election chances, it would make sense that it has been limping recently.\n\nAdvertisement\n\nThe other very plausible reason that Trump stock is moving down is that investors may be worried about Trump selling some of his shares in the company. This could lead to other investors selling, which would have a cascading effect on the share price.\n\nTrump currently owns about 60% of Truth Social, which means his stake is worth about $2.4 billion. He's been restricted from selling any shares because of a lock-up restriction, which are common in public offerings. But the lock-up period could end as soon as September 20 — hence people trying to get out of the stock before he does.\n\nRelated stories\n\nThere are two arguments against that theory, by the way: The first is that the lock-up period has been public knowledge since Truth Social first went public, so why bail now? The second is that Trump knows that if he does sell stock — and particularly if he sells a lot of stock — that the stock will really collapse. Because all but the most die-hard Trump fans will see it as the end of the company.\n\nSo there's a real tension there: Does Trump keep his theoretical $2.4 billion stake intact? Or does he try to turn it into actual money, and risk making the overall value much less?\n\nAdvertisement\n\nIn any case, it's possible that both of the ideas above — Trump's declining political fortune, and the idea that he may be ready to trigger a big sell-off himself — are true. Or maybe there's something else at work that we have yet to see.\n\nThe only thing we know for certain is that if you bought Trump stock in late March and haven't sold it since then, you are down by more than 50%. We don't give investment advice around here. But don't say we didn't warn you."
        },
        "article36": {
            "headline": "Harris and Walz to sit down with CNN for first formal interview of campaign",
            "text": "Thursday’s interview with presenter Dana Bash will be the first since Harris replaced US President Joe Biden as the Democratic nominee.\n\nKamala Harris and her running mate Tim Walz will sit down with CNN on Thursday in their first formal interview of the United States election campaign.\n\nHarris replaced President Joe Biden as the Democratic candidate for the White House after he dropped out of the race in July.\n\nCNN anchor and chief political correspondent Dana Bash will conduct the interview from the battleground state of Georgia, CNN said. It will air at 9pm (01:00 GMT on Friday).\n\n“This is the first time she’s going to take questions in a concerted effort like this, in an interview format, since Joe Biden upended this entire race six weeks ago,” CNN Political Director David Chalian said in an interview on the channel.\n\nWhile Harris has occasionally taken questions from journalists on foreign and economic policies on the campaign trail, she has yet to do a one-on-one media interview or hold a formal news conference, prompting attacks from rival Donald Trump and his Republican Party.\n\nOn Tuesday, Trump’s campaign reacted to the interview announcement by noting that Harris would be doing the interview with Walz.\n\n“She’s not competent enough to do it on her own,” the campaign claimed.\n\nTrump has held news conferences and done media interviews in recent weeks but they have mostly focused on criticising the Biden administration’s record instead of detailing his own policy proposals.\n\nHarris laid out some broad policy agendas at the Democratic National Convention last week, promising a middle-class tax cut at home and a muscular foreign policy of standing up to Russia and North Korea while backing a ceasefire in Gaza and a two-state solution in the Middle East.\n\nDuring her more than three years as vice president, Harris has done on-camera and print interviews with The Associated Press news agency and many other outlets, often at a pace more frequent than Biden.\n\nHarris travels with members of the media on Air Force Two for all trips and nearly always comes to the back of the plane to speak to reporters for a few minutes before takeoff. Her office insists that those conversations are off the record, though, so what she says cannot be shared publicly.\n\nThe CNN interview will be recorded during a campaign bus tour by the Democratic candidates."
        },
        "article37": {
            "headline": "Ahead of key interview, five questions Kamala Harris hasn’t answered yet",
            "text": "From the Gaza war to immigration to inflation, Harris is yet to spell out how she will accomplish her agenda.\n\nOn Thursday, US Vice President and presidential hopeful Kamala Harris will sit down for her first major broadcast interview since she became the face of the Democratic Party following President Joe Biden’s withdrawal from the race.\n\nShe will be joined by her running mate, Tim Walz, for the interview with CNN.\n\nUntil now, Harris has taken a cautious approach towards the press, much like Biden, who has held fewer news conferences and media interviews than any of the past seven US presidents, Axios reported, citing presidential scholar Martha Joynt Kumar.\n\nHarris’s own sparse engagement with the media has come under scrutiny, especially from the Republicans. “She doesn’t know how to do a news conference; she’s not smart enough to do a news conference,” Republican challenger Donald Trump said during a news conference of his own on August 15.\n\nTo be sure, Harris has spoken on several key issues that polls suggest matter to American voters, in campaign rallies and policy speeches. But without the cross-questioning that an interview allows, the Democratic Party’s presidential nominee’s positions on critical subjects remain ambiguous.\n\nSo when is the interview and what are some of the questions Harris has yet to clearly answer?\n\nWhen is Harris’s CNN interview?\n\nHarris will speak to CNN’s anchor and chief political correspondent Dana Bash alongside the Democratic Party’s vice presidential candidate Tim Walz, the governor of Minnesota, at 9pm (01:00 GMT) on Thursday.\n\n‘I won’t be silent’ on Gaza: How will she speak up?\n\nOn July 26, following a meeting with Israeli Prime Minister Benjamin Netanyahu in Washington, Harris pledged not to stay silent on the plight of Palestinians in Gaza.\n\n“We cannot look away in the face of these tragedies. We cannot allow ourselves to become numb to the suffering. And I will not be silent,” she told reporters. Yet, simultaneously, she pledged unwavering commitment to Israel.\n\n''I have had an unwavering commitment to the existence of the State of Israel, to its security, and to the people of Israel.'' US VP Kamala Harris says she expressed her 'serious concerns' to Israeli PM Netanyahu about the 'scale of human suffering in Gaza.' pic.twitter.com/1U0KErqiDL — Al Jazeera English (@AJEnglish) July 26, 2024\n\nIn the month since she made this statement, however, Harris’s relative silence on Gaza has come under fire from critics who have questioned whether Harris’s policy on Israel’s war will be any different from Biden’s.\n\nSo far, the answer, many believe, seems to be a firm no.\n\nAmid speculation that she might at least consider using restrictions on arms sales to Israel as leverage to convince the government of Prime Minister Benjamin Netanyahu to stop massacres of Palestinians, her adviser on national security made clear that Harris had no such plans.\n\n“She does not support an arms embargo on Israel,” Phil Gordon, the adviser, said on August 8.\n\n.@VP has been clear: she will always ensure Israel is able to defend itself against Iran and Iran-backed terrorist groups. She does not support an arms embargo on Israel. She will continue to work to protect civilians in Gaza and to uphold international humanitarian law. — Phil Gordon (@PhilGordon46) August 8, 2024\n\nAt this year’s Democratic National Convention (DNC), which was held from August 19 to August 22 in Chicago, Harris once again simultaneously pledged support for Israel and expressed sympathy for Palestinians in Gaza.\n\nHowever, the Democrats refused to allow a Palestinian American to speak at the convention, while the parents of an Israeli-American captive held in Gaza were allowed to take the stage.\n\nPro-Palestine protesters rallied outside the DNC venue on all three days but were blocked from marching too close to the venue by police. Many warned that they would not support Harris in the November vote unless she ends unconditional support for Israel.\n\nHow will she ban ‘price gouging’?\n\nOn August 16, Harris proposed a ban on “price gouging” by food suppliers and grocery stores.\n\nPrice gouging refers to dramatically raising prices to “unfair levels” in response to short-term high demand or scarcity – often following disasters, such as flooding. While several states already restrict the practice for some goods considered essential, there is no federal law barring it.\n\nThe proposal could be popular. High grocery bill inflation is a key concern for many voters. Under Biden’s administration, grocery prices have gone up by 21 percent as part of an inflation surge.\n\nBut Harris has not spelt out how exactly she would go about enacting this ban on price gouging, earning her backlash from political critics, as well as industry.\n\nIn a release last week, the Trump campaign called her plan an example of “communist price controls”.\n\nIndustrialists and economists also said the plan could do more harm than good.\n\nHarris’s plan is vague, but a central part of it involves getting the US Congress to pass the first-ever federal ban on price gouging in food and grocery sectors, similar to legislation introduced by Democratic Senator Elizabeth Warren last year.\n\nYet political analysts point out that such legislation has almost no chance of passing in Congress — raising questions about the sincerity of Harris’s proposal.\n\nWill she build a border wall?\n\nHarris has flip-flopped on the topic of immigration.\n\nDuring the DNC, she pledged that she would sign the now-defunct bipartisan border security bill that Trump wanted to terminate out of fears that it would benefit Democrats.\n\nThis bill would have allocated $20m towards security measures at the southern border with Mexico. The bill also set aside hundreds of millions of dollars for the construction of a border wall that was a signature project undertaken by Trump, and criticised by many Democrats.\n\nIndeed, during Trump’s administration, Harris had called the idea of the wall “un-American”.\n\nIn 2020, she wrote in a Facebook post: “Trump’s border wall is a complete waste of taxpayer money and won’t make us any safer.”\n\nWhen she declared her candidacy for her 2020 presidential race in 2019, she called the wall Trump’s “medieval vanity project”.\n\nBesides pledging support for the bill that funds the wall, there are other indicators of Harris’s hardening stance on immigration, including campaign advertisements in which she supports the idea of more Border Patrol agents.\n\nThis shift comes amid efforts by Republicans to hold Harris responsible for a surge in undocumented migrants into the US, by describing her as Biden’s “border czar”.\n\nNEW AD: On the border, the choice is simple. Kamala Harris is fighting to fix our broken immigration system. Donald Trump is trying to stop her. pic.twitter.com/t200w8iAYv — Kamala HQ (@KamalaHQ) July 30, 2024\n\nWhat’s her position on Medicare for All?\n\nWhen Harris was a senator for California, she signed on as a co-sponsor for Bernie Sanders’s Medicare for All legislation which called for a single-payer health insurance system to provide everyone in the US with comprehensive healthcare.\n\nHowever, Harris’s economic plan this time is silent on Medicare for All. So, it is unclear if she still backs the idea or has dropped it entirely.\n\nWill Harris ban fracking?\n\nDuring her 2019 primary run, Harris had also pledged to ban fracking – the controversial technique of extracting oil and gas from shale rock by drilling the earth.\n\nThe practice causes earth tremors and has a high environmental cost since the procedure consumes large amounts of water, in addition to releasing methane, a greenhouse gas.\n\nHowever, Harris seems to have taken a U-turn on fracking during her presidential campaign this year. In late July, her campaign officials confirmed that she will not seek to ban fracking if elected.\n\nTrump had invoked her 2019 anti-fracking stance to criticise her.\n\nThe Biden administration allowed fracking. Harris herself has not made a public statement about whether or not she will ban fracking if she rises to the top job."
        },
        "article38": {
            "headline": "Kamala Harris and Tim Walz's Campaign Briefly Stopped by Serious Accident",
            "text": "Kamala Harris and Tim Walz had one helluva scare as their campaign rolled through Georgia on Wednesday when a motorcycle cop in their motorcade was critically injured in a crash.\n\nThe Democratic presidential candidate and her VP pick were part of a bus tour cruising along a highway in Savannah on Wednesday night when the motorcycle officer lost control and wiped out, without hitting another vehicle.\n\nA photo taken at the scene captured 2 other officers assisting the injured cop -- with pools of blood on the ground.\n\nMembers of the press following the motorcade reported one of the doors on the bus opened briefly, before the motorcade took off about 3 minutes later.\n\nSavannah PD issued a statement, saying the cop was taken to Memorial Health University Medical Center to be treated for severe injuries.\n\nWaiting for your permission to load the Instagram Media."
        },
        "article39": {
            "headline": "Scrutiny over claims RFK Jr cut off dead whale's head",
            "text": "Scrutiny over claims RFK Jr cut off dead whale's head\n\nReuters\n\nRobert F Kennedy Jr faces calls from environmentalists for an investigation over a historic claim that he once cut the head off a dead beached whale with a chainsaw to take it home on the roof of his vehicle. A group that supports Kamala Harris for president says Mr Kennedy's alleged removal and transportation of the skull of the whale may have broken the law. Mr Kennedy, 70, has not commented on the incident, detailed by his daughter in an interview 12 years ago. The call for an investigation comes days after he suspended his independent presidential campaign, which was marked by strange twists including his confession that he once dumped the body of a dead bear in New York's Central Park.\n\nMr Kennedy has now endorsed Donald Trump for the presidency, and has been offered a place on the Republican candidate's transition team if he is elected. The incident with the whale's head, which dates to around 1994, was recounted by Kathleen \"Kick\" Kennedy in a 2012 interview with Town & Country magazine. Mr Kennedy, who is said to enjoy studying animal skulls and skeletons, reportedly heard that the dead animal had washed up in Hyannis Port, Massachusetts, where the family was staying. He went to the beach to cut off the head with a chainsaw, and then proceeded to tie it to the roof of the family minivan with bungee cords. The family then drove back to their home in New York, Ms Kennedy said. \"Every time we accelerated on the highway, whale juice would pour into the windows of the car, and it was the rankest thing on the planet,\" Ms Kennedy told the magazine. \"We all had plastic bags over our heads with mouth holes cut out, and people on the highway were giving us the finger, but that was just normal day-to-day stuff for us.\" RFK Jr just endorsed Trump. Will it matter in November?\n\nAnalysis: Dead bear another strange twist in RFK Jr's campaign The call for an investigation was made by the Center for Biological Diversity Action Fund, which has publicly endorsed Democratic candidate Kamala Harris for president. The group wrote a letter to set out their case to marine protection officials at the National Oceanic and Atmospheric Administration (Noaa). The letter, quoted by US media, said Mr Kennedy may have broken multiple federal laws by collecting wildlife body parts and transporting them across state lines. “Vital research opportunities are lost when individuals scavenge a wildlife carcass and interfere with the work of scientists,\" the group's political director Brett Hartl wrote. \"This is particularly true of marine mammals, which are some of the most difficult wildlife species in the world to study,” Mr Hartl added. Noaa confirmed to the BBC that it received the letter and was compiling a response. Mr Kennedy has not confirmed receipt of the letter. The BBC has approached his campaign for comment.\n\nUS election: RFK Jr drops presidential campaign and supports Donald Trump\n\nAt one point earlier this year, Mr Kennedy averaged about 15% in presidential preference polls as an independent candidate. His pitch blended anti-establishment and anti-corporate rhetoric with liberal social positions, environmentalism and controversial vaccine scepticism. But his numbers dwindled, and he announced last week he was suspending his campaign. Although he initially competed to win the Democratic nomination, he ended up criticising his former party and offering his endorsement to Donald Trump. The move dismayed his relatives, who are the most famous family in Democratic politics. Mr Kennedy's campaign attracted a range of bizarre and scandalous headlines. In May, the New York Times ran an article revealing he had told lawyers involved in his 2012 divorce proceedings that he was suffering from a memory issue relating to a dead brain parasite. In mid-July, Mr Kennedy texted an apology to a former family nanny after Vanity Fair magazine published a story in which she accused him of unwelcome sexual advances. “I have no memory of this incident but I apologise sincerely for anything I ever did that made you feel uncomfortable,” he wrote. In comments to the media, he said the Vanity Fair article contained a lot of “garbage” but conceded that he had a “very, very rambunctious youth” and that he was “not a church boy”. Earlier this month, Mr Kennedy was filmed talking to actress Roseanne Barr, recounting the 2014 incident with the dead bear cub. He said a woman had killed the bear with her car when he was driving in a rural area, and he put it in his van with the initial intention of harvesting its meat. But ultimately he thought it would be \"amusing\" to leave the carcass in New York's Central Park, to make it appear that an errant cyclist had killed the animal. The bear was found the following day. Responding to a BBC request for comment, New York's Department of Environmental Conservation said charges could not be brought for incidents more than a year old."
        },
        "article40": {
            "headline": "Donald Trump's policies would make inflation surge, Nobel Prize-winning economist says",
            "text": "A version of this interview originally appeared in Quartz’s members-only Weekend Brief newsletter. Quartz members get access to exclusive newsletters in your inbox and more. Sign up here.\n\nKamala Harris' grocery price gouging ban? No economist on earth will support it, strategist says CC Share Subtitles Off\n\nEnglish Kamala Harris' grocery price gouging ban? No economist on earth will support it, strategist says\n\nFormer President Donald Trump’s economic plan would be a “disaster” for the U.S., and implementing his proposed tariffs on Chinese imports would make inflation surge, according to a Nobel-prize winning economist.\n\nAdvertisement\n\n“If Trump were actually able to get his agenda through, it would be a disaster,” Joseph Stiglitz, who served as chair of the Council of Economic Advisors under President Bill Clinton, told Quartz in an interview.\n\nAdvertisement\n\nStiglitz, who more recently was head of the International Economic Association, said that Vice President Kamala Harris “has been a very steady hand with a set of well-talked-through proposals from the Biden administration.”\n\nAdvertisement\n\n“Trump every other day changes his mind about something,” Stiglitz said, arguing that Trump’s planned 50% tariffs on Chinese goods would slam lower- and middle-income Americans. “Those tariffs would create a significant increase in the cost of living, it would be a shock to the economy, and that inflation, in turn, would lead the Fed to raise interest rates.”\n\nReducing America’s dependence on China can’t be done with a sledgehammer, Stiglitz said. “The Biden-Harris proposal for a 10% tariff is an important signal to the market: ‘You’d better think about diversifying your supply chain.’ And that, I would call good economic management. Good economic policy is balancing multiple concerns, and that kind of balancing is what distinguishes Harris from Trump.”\n\nAdvertisement\n\nOn the specifics of Harris’ plans, from boosting the child tax credit to planning to build three million new homes, Stiglitz said “the bundle as a whole is moving in the right direction.\n\n“Those are cumulative problems that have been unattended for 30 years,” he said, “and so you’re not going to be able to solve them overnight.”\n\nAdvertisement\n\nHarris’ plans would also address the growth of monopolies, which have been holding back U.S. innovation and driving prices higher, Stiglitz said.\n\n“One of the weaknesses in the U.S. economy over the past 20 years has been a significant growth in market power, and that increase in market power reduces innovation, increases inequality, and lowers real wages of ordinary Americans,” he said. “That’s been one aspect of [the Biden-Harris] economic policy that will make a difference.”\n\nAdvertisement\n\nPerhaps the biggest difference between Trump and Harris lies in their tax policies.\n\n“The 2017 [Trump tax cut] was an enormous tax cut for the millionaires, and actually a tax increase when it was fully implemented for a large fraction of Americans,” Stiglitz said. “What we need to do is restore tax justice, increase the taxes on the billionaires who can obviously afford it, and help address some of the big problems of inequality that we have, like child poverty.”\n\nAdvertisement\n\nTrump’s move to cut the corporate income tax from 28% to to 21% did nothing to improve U.S. competitiveness, it just increased stock buybacks, Stiglitz said.\n\n“Extending [Trump’s] tax cuts when they expire in 2025 and making them deeper would make a huge hole in the deficit,” he said. “Remember, the reason why they expired in 2025 was because the deficit created by the tax bill was so large that even Republicans wouldn’t vote for it.”\n\nAdvertisement\n\n“The irony of his policies is that while a lot of support for them may come from people who feel like the system has left them behind,” Siglitz added, “his proposal will leave them even more behind.”"
        },
        "article41": {
            "headline": "Bellamy names keeper Darlow in first Wales squad",
            "text": "Bellamy said \"he didn't see any reason\" to take the captaincy away Ramsey \"for the time being\", while stressing that he wants numerous leaders in his squad.\n\n\"I understand the role of captaincies, I was captain for Wales through all of the age groups and into the senior team,\" he added.\n\n\"I do understand it, but I like a leadership group, I like a number of captains, I like a group. I like a lot of senior players who have a lot of input and I like to be able to communicate with them as well, tactically but also how I want a squad to look and how I want them to behave and they play a big role in that it is theirs.\n\n\"Also, what I’d ask for them to do on the pitch, I’d like their input with that. We have a certain level of non-negotiables, I certainly do, but I do like feedback.\n\n\"I know Aaron might be the captain, but I see a number of captains if I’m being honest.\"\n\nDarlow will compete with Leicester City's Danny Ward – who played his first club game in 17 months on Tuesday – and Sheffield United's Adam Davies for the goalkeeping position in Bellamy’s Wales team.\n\nCurrently second choice to Islian Meslier at Leeds, Darlow turned down the chance to represent Wales in 2013 and 2018.\n\nHe is the grandson of Ken Leek, who was a member of Wales’ 1958 World Cup squad.\n\nDarlow is one of two uncapped players called up by Bellamy alongside left-back Owen Beck, who joined Blackburn Rovers on loan from Liverpool this week."
        },
        "article42": {
            "headline": "Mikrofon bleibt stumm – Kleiner Sieg für Trump",
            "text": "Hauptnavigation: Nutzen Sie die Tabulatortaste, um durch die Menüpunkte zu navigieren. Öffnen Sie Untermenüs mit der Leertaste. Schließen Sie Untermenüs mit der Escape-Taste.\n\nHauptnavigation: Nutzen Sie die Tabulatortaste, um durch die Menüpunkte zu navigieren. Öffnen Sie Untermenüs mit der Leertaste.\n\nProdukte"
        },
        "article43": {
            "headline": "Trump Vs. Harris 2024 Polls: Harris Leading Likely Voters By 2 Points In Latest Survey",
            "text": "Omit data"
        },
        "article44": {
            "headline": "Trump Vs. Harris 2024 Polls: Harris Leads By 1 Point In Latest Post-DNC Survey",
            "text": "Omit data"
        },
        "article45": {
            "headline": "Trump Vs. Harris 2024 Polls: Harris’ Lead Grows—Winning By 5 Points In One Survey",
            "text": "Omit data"
        },
        "article46": {
            "headline": "Trump Vs. Harris 2024 Polls: Harris Takes First-Ever Lead In WSJ Poll",
            "text": "Omit data"
        },
        "article47": {
            "headline": "Harris würde einen Republikaner ins Kabinett holen",
            "text": "Was können die Menschen in den USA von der Demokratin Kamala Harris erwarten, sollte sie US-Präsidentin werden? Ihr erstes großes Interview nach ihrer Nominierung gibt Aufschlüsse. Trump verschwendet hingegen keine Zeit, ihre Aussagen zu verunglimpfen. Mehr im Newsblog.\n\nAnzeige\n\nAm 5. November sind Präsidentschaftswahlen in den USA. Die Republikaner schicken den früheren Präsidenten Donald Trump erneut ins Rennen, bei den Demokraten hat sich Vizepräsidentin Kamala Harris die Kandidatur gesichert. Verfolgen Sie die wichtigsten Ereignisse im WELT-Newsblog.\n\n06:43 Uhr – Trump über Harris-Interview – „Zusammenhangloses Gerede“ Trump verschwendet keine Zeit, das erste große Fernsehinterview von Harris scharf zu kritisieren. Auf Truth Social Link wird in einem neuen Tab geöffnet bezeichnete Trump Harris‘ Antworten als „zusammenhangloses Gerede“, als sie von CNN-Moderatorin Dana Bash auf ihre früheren politischen Kehrtwendungen angesprochen wurde.\n\nAnzeige\n\nHarris‘ Erklärung, dass sich ihre „Werte nicht geändert haben“, nahm Trump aufs Korn: „Dem stimme ich zu, ihre Werte haben sich nicht geändert.“ Und führt fort: „Die Grenze wird offen bleiben, es wird eine kostenlose Gesundheitsversorgung für illegale Einwanderer geben, ein Verbot von benzinbetriebenen Autos, die private Gesundheitsversorgung wird abgeschafft.“ Er warnte weiter, dass unter einer Präsidentschaft von Harris Amerika zu einem Brachland („Wasteland“) werden würde. 04:16 Uhr – Harris: Werde Fracking nicht verbieten „Als Präsidentin werde ich Fracking nicht verbieten“, sagte Kamala Harris in einem am Donnerstagabend (Ortszeit) ausgestrahlten Interview des Nachrichtensenders CNN.\n\nAnzeige\n\nIm Wahlkampf 2020 hatte die Vizepräsidentin der USA noch gesagt, dass sie die umstrittene Praktik zur Förderung von Öl und Erdgas verbieten wolle. Harris deutete an, dass sich ihre Position geändert habe, ihre Werte hätten sich aber nicht geändert. Das Land könne den Klimawandel auch ohne ein Fracking-Verbot bekämpfen. 03:57 Uhr – Harris wirft Trump „alte Masche“ vor Aussagen Donald Trumps über ihre Identität als schwarze Amerikanerin hat die demokratische US-Präsidentschaftskandidatin Kamala Harris als „dieselbe alte, abgestandene Masche“ bezeichnet. Manche Kritiker hatten Trumps Aussagen als rassistisch angesehen. Harris sagte lediglich, Trumps Vorgehen sei „dieselbe alte, abgestandene Masche“. „Nächste Frage bitte“, sagte die 59-Jährige – und lachte. Auf Nachfrage der Moderatorin Dana Bash, ob sie zu dem Thema wirklich nicht mehr sagen wolle, sagte Harris: „Das war‘s.“ Das Gespräch war das erste TV-Interview seit Harris‘ Nominierung als Kandidatin. 03:39 Uhr – Harris pocht auf Waffenruhe im Gaza-Krieg Kamala Harris hat sich erneut deutlich für eine Waffenruhe im Gaza-Krieg und eine Freilassung der Geiseln ausgesprochen. „Es wurden viel zu viele unschuldige Palästinenser getötet, und wir müssen eine Einigung erzielen“, sagte die 59-Jährige. 03:34 Uhr – Harris: Illegale Grenzübertritte müssen Konsequenzen haben Kamala Harris hat bei illegalen Grenzübertritten auf Konsequenzen gepocht. „Wir haben Gesetze, die befolgt und durchgesetzt werden müssen“, sagte Harris in ihrem ersten TV-Interview seit ihrer Nominierung auf eine Frage zum wichtigen Wahlkampfthema Migration. Wenn diese Gesetze nicht befolgt würden, müsse das Konsequenzen haben. 03:29 Uhr – Harris verteidigt Erfolge der Regierungszeit mit Biden Die demokratische Präsidentschaftskandidatin Kamala Harris hat die Leistung der Regierungszeit mit Präsident Joe Biden als erfolgreich verteidigt. Die Regierung habe die Vereinigten Staaten nach der Krise der Corona-Pandemie wieder auf den Wachstumspfad gebracht, und das schneller als andere Länder, sagte Harris dem Sender CNN.\n\nLesen Sie auch Weltplus Artikel US-Wahl Welche globalen Trends für einen Sieg von Trump sprechen – und welche für Harris\n\n01:31 Uhr – Trump: Regierung wird für künstliche Befruchtung zahlen Der republikanische Präsidentschaftskandidat Donald Trump versucht mit einem überraschenden Wahlkampfversprechen besonders Frauen und Familien anzusprechen. Bei einer Rede in Potterville im US-Bundesstaat Michigan kündigte er an, dass die US-Regierung für künstliche Befruchtung, auch In-Vitro-Fertilisation (IVF) genannt, zahlen werde, sollte er die Präsidentenwahl am 5. November gewinnen. Alternativ sollten Versicherungen gezwungen werden, für die Behandlung aufzukommen. 23:21 Uhr – Ein Republikaner soll in Harris Kabinett Die demokratische Präsidentschaftskandidatin Kamala Harris kündigt in ihrem ersten TV-Interview seit ihrer Nominierung an, bei einem Wahlsieg einen Republikaner in ihr Kabinett holen zu wollen. „Ich habe noch 68 Tage bis zur Wahl, also will ich das Pferd nicht von hinten aufzäumen“, sagte die 59-Jährige in dem Interview. Sie sei aber überzeugt, dass es wichtig sei, dass bei den bedeutendsten Entscheidungen Leute mit am Tisch sitzen müssten, die andere Ansichten und andere Erfahrungen hätten, sagte Harris. „Und ich denke, dass es für die amerikanische Öffentlichkeit von Vorteil wäre, ein Mitglied meines Kabinetts zu haben, das Republikaner ist.“ 22:57 Uhr – Kennedys Name bleibt auf Stimmzetteln Trotz seines Rückzugs aus dem US-Wahlkampf und seiner Unterstützungserklärung für den Republikaner Donald Trump wird Robert F. Kennedy bei der Präsidentschaftswahl am 5. November im umkämpften Bundesstaat North Carolina auf den Stimmzetteln stehen. Die dortige Wahlaufsicht lehnte am Donnerstag einen Antrag seiner Partei We The People ab, Kennedys Namen von den Stimmzetteln zu streichen. Dafür sei es jetzt zu spät. 22:44 Uhr – Militär verstärkt Hilfe für Secret Service Das US-Militär will den Secret Service bei der Sicherung von Wahlkampfveranstaltungen in den USA stärker unterstützen. US-Verteidigungsminister Lloyd Austin habe einem entsprechenden Hilfeersuchen des Heimatschutzministeriums zugestimmt, teilte Pentagon-Sprecherin Sabrina Singh mit. Austin habe den Befehlshaber des nördlichen US-Kommandos angewiesen, die Unterstützung des für den Schutz der Präsidentschaftskandidaten und ihre Stellvertreter zuständigen Secret Service zu verstärken. Dies gelte auch für den gewählten Präsidenten und seinen Stellvertreter nach der Wahl am 5. November bis zur Amtseinführung im Januar 2025. 22:06 Uhr – Vance von Feuerwehrleuten ausgebuht J.D.Vance ist bei einem Auftritt bei der Tagung Feuerwehrgewerkschaft ausgebuht worden. Die Buhrufe im Publikum ertönten gleich zu Beginn des Auftritts des Senatos, andere Zuschauer applaudierten allerdings auch. „Klingt so, als hätten wir einige Fans und einige Hasser“, sagte der 40-Jährige bei der Konferenz in der Ostküsten-Metropole Boston. „Das ist in Ordnung. Hören Sie sich an, was ich zu sagen habe, und ich werde meinen Standpunkt darlegen“, so Vance weiter. 15:21 Uhr – Plattenfirma verbietet Trump, Abba-Songs auf Wahlkampfveranstaltungen zu spielen\n\n„Lustig, wie sich Blowjobs auf ihre Karrieren ausgewirkt haben“, sagt Trump über Clinton und Harris Die US-Präsidentschaftskandidatin der Demokraten, Kamala Harris, gibt zusammen mit Vizekandidat Tim Walz ihr erstes TV-Interview. Unterdessen geht Donald Trump einmal mehr unter die Gürtellinie. Erik Kirschbaum fasst die Ereignisse zusammen.\n\nDie Plattenfirma von ABBA fordert den US-Präsidentschaftskandidaten Donald Trump auf, die zahlreichen Hits der schwedischen Kultband nicht mehr bei seinen Wahlkampfveranstaltungen zu verwenden. Universal Music in Schweden teilte der Nachrichtenagentur AFP in einer E-Mail mit, auf Videos sei zu sehen, dass die Musik von ABBA bei mindestens einer Wahlkampfveranstaltung des Ex-Präsidenten gespielt worden sei. „Wir haben verlangt, dass es heruntergenommen und entfernt wird“, hieß es über das Material. Die Plattenfirma hob hervor, dass sie nicht um Erlaubnis für die Nutzung der ABBA-Songs gebeten worden sei. Daher habe Trump auch „keine Erlaubnis oder Lizenz“ dafür.\n\nLesen Sie auch Weltplus Artikel 50 Jahre „Waterloo“ Abba – das Geheimnis der fantastischsten Vier\n\nVor der schwedischen Kultband hatten schon einige andere Künstler Trump untersagt, ihre Musik zu verwenden, darunter Bruce Springsteen, Neil Young, Celine Dion und die Rolling Stones. 14:34 Uhr – Harris punktet bei Frauen und Hispanics – Vorsprung vor Trump wächst Harris hat einer Reuters/Ipsos-Umfrage zufolge ihren Vorsprung zu Trump ausgebaut. Sie führt laut der am Donnerstag veröffentlichten Umfrage mit einer Zustimmung von 45 Prozent vor Trump mit 41 Prozent. Die Erhebung wurde in den vergangenen acht Tagen bis Mittwoch vorgenommen. In einer Umfrage von Reuters/Ipsos von Ende Juli hatte Harris bei registrierten Wählern mit nur einem Prozentpunkt vor Trump gelegen. Die neue Umfrage hat eine Fehlerquote von zwei Prozent. In wichtigen Swing States hat Trump aber die Nase vorn.\n\nLesen Sie auch Weltplus Artikel US-Wahl Welche globalen Trends für einen Sieg von Trump sprechen – und welche für Harris\n\nBei Frauen und hispanischen Wählern lag Harris laut der Umfrage deutlich vor Trump – hier führte sie den Daten zufolge mit 49 zu 36 Prozent. Damit legte sie im Vergleich zur letzten Erhebung im Juli bei beiden Gruppen weiter zu. Trump lag dagegen bei weißen Wählern und Männern unverändert vorn. Es sei offensichtlich, dass das Rennen gegen Harris für Trump eine größere Herausforderung sei als der Wahlkampf gegen Biden, sagte der republikanische Wahlkampf-Experte Matt Wolking. Doch sei Harris für Trump „nicht unüberwindlich“. Trump müsse vor allem darauf achten, Wähler nun nicht zu verschrecken, die in der Vergangenheit zu ihm tendierten, weil sie Biden ablehnten. 14:00 Uhr – Pressesprecher von J.D. Vance soll Verbindungen zu Rechtsextremen haben Parker Magid, der neue Pressesprecher des republikanischen Vizekandidaten J.D. Vance, hat für eine Beraterfirma gearbeitet, die tief verflochten mit neurechten und rechtsextremen Think-Tanks sein soll. Das berichtet der „Guadrian“ Link wird in einem neuen Tab geöffnet . So soll die Beraterfirma Beck & Stone fundamentale Christen unterstützen und der „Society for American Civic Renewal“ nahestehen, einer Geheimloge der Far-Right-Bewegung. Einer Extremismusforscherin zufolge, die der „Guardian“ zitiert, handelt es sich bei den mit der Beraterfirma verwobenen Organisationen um solche, die in ihren Ansichten über den konventionellen Konservatismus weit hinausgehen. 10:23 Uhr – Fotos von deutscher Influencerin von Pro-Trump-Accounts benutzt Pro-Trump-Accounts im Online-Dienst X bedienen sich bei Social-Media-Fotos von 17 europäischen Frauen. Das berichtet der US-Sender CNN. Auch mindestens eine Deutsche sei betroffen. Dies habe eine Untersuchung in Kooperation mit dem Centre for Information Resilience (CIR) ergeben. Die benutzten Fotos seien auf X-Profilen ausgespielt worden, die offenbar Teil einer koordinierten Kampagne waren, welche das Trump-Vance-Lager vor den Präsidentschaftswahlen unterstützen sollte. Laut CNN-Bericht zeigt eine Analyse dutzender Pro-Trump-Konten ein systematisches Muster von „nicht authentischem Verhalten“. Alle Konten würden gestohlene oder manipulierte Fotos von jungen Frauen zeigen, die ihre Unterstützung für Trump in Posts erklärten und Hashtags wie #MAGAPatriots oder #MAGA2024 verwendeten. Die Bilder seien oftmals manipuliert worden, um auf der Kleidung Trump-Slogans zu platzieren. Es gebe keinen Hinweis darauf, dass Trump und sein Team involviert waren.\n\nLesen Sie auch Weltplus Artikel US-Wahl 2024 Dumm vs. dümmer – Harris und Trump überbieten sich mit ökonomischer Ahnungslosigkeit\n\nEiner der Fake-Accounts, der im CNN-Artikel genannt wird, heißt @Luna_2K24. Verwendet wurden die Fotos der deutschen Modeinfluencerin Debbie Nederlof aus Trier. Sie hat 74.200 Follower auf Instagram. „Was zum Teufel“, habe sie sich gedacht, als sie davon erfuhr. „Was zum Teufel interessiere ich mich, aus einem kleinen Ort in Deutschland, für US-Politik?“ Für Nederlof ist es nicht der erste Vorfall dieser Art: „Jeden Tag wird mein Gesicht und mein Körper, meine Fotos, meine Identität gestohlen und es macht mich wahnsinnig.“ Thomas Regnier, Sprecher der Europäischen Kommission für digitale Wirtschaft, Forschung und Innovation in Europa, sagte CNN, dass Identitätsdiebstahl im EU-Recht verboten sei. Möglicherweise illegales Verhalten könnte in einem Verfahren berücksichtigt werden. 04:26 Uhr – Trump provoziert mit vulgärem Kommentar zu Harris Donald Trump provoziert mit der Verbreitung einer vulgären Bemerkung über seine demokratische Kontrahentin Kamala Harris. Trump teilte auf der von ihm mit begründeten Plattform Truth Social den Beitrag eines anderen Nutzers, der andeutete, dass sexuelle Gefälligkeiten Harris‘ politische Karriere befördert haben könnten. In dem Post ist ein älteres Bild von Kamala Harris zu sehen an der Seite der früheren US-Außenministerin und Präsidentschaftskandidatin Hillary Clinton, die 2016 im Wahlkampf gegen Trump angetreten war. Dazu der Kommentar: „Lustig, wie sich Blowjobs auf ihre beiden Karrieren unterschiedlich ausgewirkt haben...“\n\nDie derbe Bemerkung ist eine Anspielung auf einen Sex-Skandal, in den Clintons Mann Bill während dessen Präsidentschaft (1993 – 2001) verwickelt gewesen war. Trump-Unterstützer wiederum verbreiten völlig unbelegte Behauptungen über Harris, wonach die romantische Beziehung zu einem einflussreichen Politiker in Kalifornien in den 90er Jahren ihrer Karriere geholfen habe. 00:11 Uhr – Trump-Team äußert sich zu Vorfall auf Soldatenfriedhof Donald Trump hatte am Montag auf dem Friedhof nahe der US-Hauptstadt Washington bei einer Kranzniederlegung der vor drei Jahren bei einem Selbstmordanschlag in Afghanistan getöteten US-Soldaten gedacht. Auch einige Familienmitglieder der Opfer waren anwesend. Nun wurde bekannt, dass es bei der Visite zu einer Auseinandersetzung zwischen Trumps Team und Mitarbeitern des Friedhofs kam. Kritiker warfen dem republikanischen Präsidentschaftskandidaten Trump vor, er habe seinen Besuch für Wahlkampfzwecke missbraucht. Seine Kampagne wies das zurück. Die US-Rundfunkorganisation NPR berichtete, zwei Trump-Mitarbeiter hätten bei dem Besuch einen Mitarbeiter des Friedhofs beschimpft und zur Seite geschubst, als dieser Film- und Fotoaufnahmen auf einem bestimmten Teil des Geländes habe unterbinden wollen. Ein Trump-Sprecher schreibt nun auf der Plattform X, ein Fotograf sei zugelassen gewesen. In einer Stellungnahme für NPR erklärte dieser weiter, der Friedhofsmitarbeiter habe wohl „an einer psychischen Störung“ gelitten und sich Mitgliedern des Trump-Teams physisch in den Weg gestellt.\n\nTrumps Wahlkampfteam veröffentlichte auf X außerdem eine Stellungnahme von Angehörigen der in Afghanistan getöteten Soldaten, die dem Republikaner für seinen Besuch dankten. Sie hätten der Teilnahme eines Fotografen zugestimmt, und das Verhalten von Trump und dessen Team sei von größtem Respekt geprägt gewesen. Mittwoch, 28. August 21:21 Uhr – Motiv des Trump-Attentäters wirft weiter Fragen auf Nach dem Attentat auf Donald Trump können die Ermittler noch immer keine eindeutige Aussage zum Motiv des Schützen treffen. Der Mann habe im Internet nach Veranstaltungen sowohl mit Trump als auch mit Präsident Joe Biden gesucht, berichteten unter anderem die Sender NBC News und MSNBC unter Berufung auf hochrangige FBI-Beamte. Bei der Trump-Kundgebung habe es sich vermutlich um ein „Gelegenheitsziel“ gehandelt. Die Ermittler hätten eine „Mischung an Ideologien“ ausmachen können, berichtete NBC News weiter. „Ich würde sagen, dass wir keine eindeutige Ideologie in Verbindung mit unserer Zielperson sehen, weder links- noch rechtsorientiert“, zitierte das Medium einen Beamten. Man sei noch dabei, alle Spuren auszuwerten und Schlussfolgerungen zu ziehen. 07:07 Uhr – Trump einigt sich mit „fiesestem“ Nachrichtensender Donald Trump verkündet eine Einigung im Streit um das TV-Duell am 10. September mit Kamala Harris beim Nachrichtensender ABC. Bei der TV-Debatte sollen die gleichen Regeln wie beim CNN-Duell im Juni, damals noch mit Joe Biden, gelten, teilte Trump mit. Damals gab es kein Studiopublikum – und die Mikrofone waren stummgeschaltet, wenn der politische Gegner sprach. Letzteres war der größte Streitpunkt und ein Wunsch von Trump. Der Republikaner bezeichnete ABC als den „mit Abstand fiesesten und unfairsten“ Nachrichtensender der Branche. Der Sender habe ihm jedoch zugesichert, dass das Duell in Philadelphia „fair und gerecht“ verlaufen werde. Die Wahl des Jahres bei WELT: Alle Inhalte der Redaktion finden Sie in unsere Themenspecial zur US-Wahl 2024. Wie berichten wir? Hier stellen wir unsere US-Experten und Wahl-Formate vor.\n\ndpa/AFP/Reuters/AP/saha/shem/lk"
        },
        "article48": {
            "headline": "“She Doesn’t Have a Single Child”: J.D. Vance Made the Mistake of Going After a Lesbian Labor Leader",
            "text": "The official J.D. Vance Bad Press Tour keeps on rolling this week, as the Republican vice presidential hopeful faces scrutiny over 2021 comments he made bashing teachers without biological children, including American Federation of Teachers president Randi Weingarten.\n\nAlready grappling with widespread backlash over another 2021 jab calling Democratic politicians and voters “childless cat ladies,” Vance now must answer more questions about further comments he made during an October 2021 political event for the Center for Christian Virtue. “So many of the leaders of the left, and I hate to be so personal about this, but they’re people without kids trying to brainwash the minds of our children. That really disorients me and disturbs me,” Vance said during the event. “Randi Weingarten, who’s the head of the most powerful teachers’ union in the country, she doesn’t have a single child. If she wants to brainwash and destroy the minds of children, she should have some of her own and leave ours the hell alone.”\n\nWeingarten is a lesbian, and introduced the public to her wife, Liz Margolies, in 2007. Vance’s disparaging remarks, however, were also inaccurate: Weingarten, believed to be the first openly LGBTQ+ president of a major U.S. labor union, is stepmother to Margolies’ biological children, and described herself as a “mother by marriage” last year when subjected to similar attacks on her motherhood by Vance’s GOP colleague, Rep. Marjorie Taylor Greene.\n\nStill, Vance doubled down on, and falsely reframed, his own remarks while being interviewed on the tarmac outside the Trump-Vance campaign jet this week, as CNN reported. “I didn’t criticize Randi Weingarten for not having kids, I criticized her for wanting to brainwash mine,” Vance claimed. Meanwhile, Weingarten responded in an MSNBC interview, calling his comments “nonsensical” and “gross.”\n\nA Viral Image Appears to Show Virulently Anti-LGBTQ+ VP Candidate J.D. Vance in Drag Content creator and podcast host Matt Bernstein posted the image to X and Instagram over the weekend.\n\nVance has not specifically stated in what way he believes Weingarten is “brainwashing” his children. His statement at the Center for Christian Virtue event was made in the general context of “the ideology of the left,” which Vance characterized as “control[ling] what our children learn.” Similarly vague, yet apocalyptic, rhetoric about Weingarten and the AFT has proliferated on the right over the last several years. In a 2022 interview, former Trump administration Secretary of State Mike Pompeo called Weingarten “the most dangerous person in the world” and alleged that teachers’ unions are “the most likely to take this republic down.” Other Republican lines of attack have included the accusation that Weingarten and the AFT puppeteered the U.S.’ COVID-19 policy, which Weingarten flatly denied and called “wild allegations.”"
        },
        "article49": {
            "headline": "Kamala’s Moment",
            "text": "The Precise Time Department sounds like something from a story by Jorge Luis Borges, but it is a real subdivision of the US Navy. At the Naval Observatory in Washington, D.C., where Kamala Harris has her official residence, the department maintains the Master Clock with which all others in the military system are harmonized. At the end of the driveway that leads from the vice-president’s house, there is a public display of these exact hours, minutes, and seconds set beside a huge ship’s anchor, as though this superaccurate chronometer served to hold America steady and prevent it from coming unmoored. Such reassurance seems, of course, ever more illusory.\n\nThere is a melancholy evocation of the Master Clock and its merciless motions at the start of Promise Me, Dad (2017), Joe Biden’s account of his public and private lives in 2014. Biden was then living at the Naval Observatory as vice-president to Barack Obama. Leaving the residence for his family’s annual Thanksgiving gathering in Nantucket, he seemed momentarily mesmerized:\n\nI glanced at the squat, standing digital clock at the top of the driveway, as I had maybe a thousand times since we had moved into the official residence. Red numbers glowed, ticking away in metronomic perfection: 5:11:42, 5:11:43, 5:11:44, 5:11:45…. Precise Time—synchronized to the millisecond—had been deemed an operational imperative by the Department of Defense, which had troops and bases in locations around the globe. 5:11:50, 5:11:51, 5:11:52.\n\nOur limousine was already accelerating out of the turn with an abrupt force that pushed me back into the soft leather seats. The clock was behind us in a flash, out of sight, but still marking the time as it melted away—5:11:58, 5:11:59, 5:12:00.\n\nFor Biden, time was melting away. He did not get to be his party’s nominee for president in 2016, and that in turn meant that he would be too old to stand for a second term in 2024. Hard as he tried, he could not, in the end, escape the clock’s relentless indifference to his desire to stay in power. But for Harris, the glowing red numbers that haunted Biden may mark the precise time. They have hurried her to a moment not just of personal destiny but of historic fate.\n\nHarris’s rapid coronation as the Democratic candidate for the presidency is at once quite fortuitous and utterly timely. It might be called an accident that’s been waiting to happen. An accident because were it not for a series of unprecedented events—Biden’s becoming the oldest president in US history, his disintegration in a live televised debate, Donald Trump’s political resurgence after an attempted coup and personal resurrection after an attempted assassination—neither she nor any other Black woman would have become the candidate of either of the two main parties. The time, in conventional wisdom, would not have been right. The voters would not have been ready. The clock would have to tick on through endless cycles before the day arrived when it would feel safe to have, at the top of the ticket, an embodiment of American power that was neither white nor male.\n\nAnd yet it was an accident waiting to happen because this conventional wisdom is itself out of sync with a nation in which white men make up just 30 percent of the population. This is the minority that benefits from a spectacular application of positive discrimination in the political sphere: it accounts for close to two thirds of officeholders. By contrast, only three Black women—Shirley Chisholm in 1972, Carol Moseley Braun in 2004, and Harris in 2020—have previously even sought a major party’s presidential nomination, and only three (including Harris) have served in the Senate. No Black woman has been elected as a governor, and only twenty-five have held other senior statewide offices, such as lieutenant governor, attorney general, or secretary of state.\n\nTime shapes contemporary American politics in two additional ways—anachronism and gerontocracy. Biden, because of who he is, seemed to embody both the superannuated nature of America’s political class and its overrepresentation of white men of the baby boomer generation. Harris, because of who she is, is uniquely placed to call time on both these realities—which means, first of all, calling time on Donald Trump. If she frames her campaign effectively, Harris can make Trump a throwback and herself the embodiment of a future that has already taken shape in American demography.\n\nThat campaign can and must be about the things that affect people’s daily lives—jobs, health care, education, the climate crisis. But ticking away underneath it is another kind of question: Who is a normal American now? Harris’s choice of running mate suggests she is aware of this: the avuncular Minnesota governor Tim Walz has a gift for making progressive ideals seem familiar, ordinary, and rooted in down-home common sense. Meanwhile, Trump and his running mate, J.D. Vance, implicitly appeal to a more symbolic notion of representation: however complex and diverse American society might seem to be, its essential form is male, white, and at least culturally Christian. This has always been so in the past and must always be so in the future. If demography, and therefore democracy, is flowing away from this eternal truth, then democracy must be frozen in time. When Trump told a right-wing Christian audience on July 26 that if they vote “just this time,” they “won’t have to do it anymore,” he was putting forward his own notion of the end of history. The changes that are making the US more ethnically diverse, less comfortably patriarchal, and less Christian will be permanently checked because the institutions of power will have been made safe from their effects.\n\nAdvertisement\n\nPart of the problem with Biden’s candidacy was that, for vastly more benign reasons, it drew on a parallel idea of holding back a tide of change. Biden presented himself, not without reason, as a bulwark, the only immovable object that could stop the apparently unstoppable Trump. As the Democratic candidate, Harris has rightly taken up Biden’s message that the election in November is, as the outgoing president put it in his address from the Oval Office on July 24, about “saving our democracy.” But her candidacy carries a much stronger resonance. It says that saving American democracy is not at all the same thing as preserving it.\n\nBiden used the metaphor made famous by John F. Kennedy when he became, at forty-three, the second-youngest president in US history: “I’ve decided the best way forward is to pass the torch to a new generation.” But the torch of American democracy must be envisaged as a flickering flame. In her rousing speech at the Democratic National Convention on August 19, Hillary Clinton spoke of how “every generation has carried the torch forward.” It is not a secure and fixed inheritance that can be handed down as a bequest from one generation to the next. It is a dangerous and endangered idea that must always draw fuel from new sources. American democracy cannot be saved if it is not reimagined, deepened, expanded, and brought into line with contemporary American realities. It is open to Harris to embody the energy of that urgent updating. Indeed, she can scarcely do otherwise.\n\nIt would be good to live in a world where Harris’s gender and ethnicity were irrelevant and where she was judged solely on her record and ideas. But if there is any such world, it does not include the US. Trump, Vance, and the Republican Party will not permit such a possibility. Their reactionary mindset is obsessed with human biology—Harris, for them, is inescapably defined by her chromosomes. The idea of the reproduction of America through the generations is projected onto her body. So far as we know, none of the forty-five occupants to date of the Oval Office has given birth to a child—but in Harris’s case this nonevent is a neglect of biological duty that makes her, in Vance’s words, one of the “childless cat ladies” who don’t “have a direct stake” in the country’s future. The point of this contention is precisely that it is a claim on the future. Tomorrow belongs to Vance and those who look and think like him.\n\nHarris does, of course, have children through her marriage to Doug Emhoff, but because she did not give birth to them, Vance cited her first among the ranks of “people without children.” This, crucially, excludes her from the norm and indeed makes her the prime example of those who “hate normal Americans for choosing family.”\n\nBut it’s not just that Harris has failed to give birth; it is also that she has failed to be properly born. John Eastman, a coconspirator in Trump’s efforts to overturn the result of the 2020 election, sought the Republican nomination for California attorney general in 2010, the year Harris won that office. In August 2020 Newsweek published an op-ed by Eastman protesting that “before we so cavalierly accept Senator Harris’ eligibility for the office of vice president, we should ask her a few questions about the status of her parents at the time of her birth.” He claimed (on spurious constitutional grounds) that since (as he thought) Harris’s parents were in the United States on temporary visas when she was born in October 1964, she\n\nowed her allegiance to a foreign power or powers—Jamaica, in the case of her father, and India, in the case of her mother—and was therefore not entitled to birthright citizenship under the 14th Amendment as originally understood.\n\nAt the time Trump amplified this bogus allegation, describing Eastman as a “very highly qualified, very talented lawyer” and remarking that\n\nAdvertisement\n\nI heard it today that she doesn’t meet the requirements…. I have no idea if that’s right, I would’ve—I would have assumed the Democrats would have checked that out before she gets chosen to run for vice president…. That’s…very serious.\n\nOn August 19, as the Democratic convention was opening, Trump returned to this theme, asking of the Democrats: “I wonder if they knew where she comes from.” In this upending of the idea of birthright, Harris has no right to be American because she was born wrong. If there’s a genre underpinning the Republican disdain for Harris, it’s a nativity play that has become a horror movie. In Eastman’s narrative, she was already, at the very moment of her birth, a traitor to America, loyal to two foreign powers. According to Vance’s rhetoric, this misbegotten woman has grown up to be the potential begetter of a sterile American future.\n\nNo major candidate for the presidency has ever been attacked with both these biological weapons. Barack Obama had to face down Trump’s birther lies but not the other natalist assault as well. No one said he hated ordinary Americans because he had not brought his own pregnancy to term. Yet it is the very unprecedented nature of this double assault on her bodily being that also gives Harris an exceptional power. She knows how to deal with this stuff—she has been doing so all her life, with considerable grace.\n\nIt seems telling that Trump has had to abandon his mocking nickname for her, Laffin’ Kamala, presumably because of a belated realization that her laughter—so different from his own cruel comedy—seems to most people to express optimism, youthfulness, and a joy in life, all qualities that he (as well as Biden) so patently lacks. She politicizes the idea of being comfortable in one’s own skin. And in that comfort, there is a paradoxical kind of potency. She can be extremely radical by presenting herself merely as what she is. For if Harris really is a “normal American” (as of course she is), it can only be because the American norm has been transformed. It can be possible because the torch has already been passed not just to a new generation but to new forms of personal and collective self-definition.\n\nHarris is fluent in a kind of baby talk very different from the demented babble of the Republican assaults on her. She does not run from the politicization of her body—she embraces it. She is, in the way she tells her own story, a child of struggle. In her memoir, The Truths We Hold: An American Journey (2019), the earliest memory she recounts is of “a sea of legs moving about, of the energy and shouts and chants.” She gives us an infant’s-eye view of political activism, with her looking up from her stroller at the legs of fellow civil rights marchers. Her cutest baby anecdote is freighted with time and history: “My mother would laugh telling a story she loved about the time when I was fussing as a toddler. ‘What do you want?’ she asked, trying to soothe me. ‘Fweedom!’ I yelled back.”\n\nIn perhaps the only good moment in her primary campaign of 2019, Harris identified herself explicitly and indignantly as a Black child of the 1960s. She attacked Biden for his opposition to the policy of integrating school systems by busing pupils from Black families to white-dominated areas: “You know, there was a little girl in California who was part of the second class to integrate her public school, and she was bused to school every day. And that little girl was me.” Her campaign tweeted a picture of Harris as a little girl, her hair in pigtails tied with bows. It then produced T-shirts printed with this image and the words “ THAT LITTLE GIRL WAS ME .” Childhood yarns are part of the grammar of American politics, but this one is different. It is more defiant than endearing, more confrontational than sentimental.\n\nThe image of a Black girl in pigtails has its own specific history. In 1954, just months after the landmark Supreme Court ruling in Brown v. Board of Education that found educational segregation to be unconstitutional, Scientific American published an article titled “The Biology of the Negro.” It was written by Curt Stern, an influential geneticist at the University of California, Berkeley—the same university to which Harris’s mother, Shyamala Gopalan, had traveled from India to study nutrition and endocrinology. It followed a lecture Stern had delivered in 1946 under the title “Why Do People Differ?” According to the historian of medicine Michael Yudell:\n\nThe program for the lecture pictured a cartoon with three girls, two of whom were white, one black. The local chapter of the NAACP objected to the picture of a shabbily dressed black girl in pigtails wearing boots flanked by two well-dressed white girls looking at the black girl and smiling.\n\nBut in 1964, just months before Harris was born, Look magazine published what became a famous painting by Norman Rockwell called The Problem We All Live With. It shows another little Black girl in pigtails, this time neatly dressed in all-white clothes that emphasize the color of her skin. She is six-year-old Ruby Bridges, walking determinedly to her first day at William Frantz Elementary School in New Orleans in 1960. Towering over her, so high that their faces are out of the frame, are four men identified by their yellow armbands as deputy US marshals. Behind Bridges is a wall splattered with the bloodred juice of a hurled tomato and graffitied in bold letters with the N-word. By inviting his viewers to see this painting as a reality “we all” live with, Rockwell was saying this violence is every bit as American as his supposedly nostalgic images of a vanishing small-town way of life.\n\nWhen Harris produced her THAT LITTLE GIRL WAS ME T-shirts, she was invoking her own history as well as the image of Ruby Bridges. And what’s striking about this is that “a Norman Rockwell view of America” is proverbial shorthand for a sanitized and sentimentalized version of the past. According to Bob Woodward’s Fear (2018), Trump’s economic adviser Gary Cohn made this very accusation against the then president in a heated argument over the nature of contemporary America: “‘Mr. President,’ Cohn said, trying to summarize, ‘You have a Norman Rockwell view of America.’” Harris, to the contrary, evokes a very different “Norman Rockwell view of America,” one in which racial violence and resistance are acknowledged as part of a shared reality.\n\nThe creation of “that little girl” involved the making of a profound choice about American history—and about its most toxic aspect: slavery. Of all the “firsts” that Harris represents—first female vice-president, first Black woman and first Indian American to contest the presidency—the one that goes unspoken is that if she wins in November, she will be the first openly acknowledged descendant of slaves to lead America. In this identification there is a complex interplay between freedom and necessity. It can perhaps best be appreciated through the uncanny recurrence of the same Irish name in her genealogy and in Biden’s: Finnegan or Finegan. It is Biden’s mother’s surname and a constant point of reference in his idea of who he really is. It lives on in the name of his granddaughter Finnegan. It is also the name of Harris’s father’s maternal grandmother, Miss Iris, a Black woman born, as he recalled in a 2020 essay, “Iris Finegan.”\n\nHarris’s parents split up when she was five, and her father subsequently had a limited place in her life. Donald Harris, a leftist critic of orthodox theories of underdevelopment, became the first Black scholar to receive tenure in Stanford’s economics department. He wrote of Kamala and her sister, Maya, that “my one big regret is that they did not come to know very well the two most influential women in my life,” Miss Iris and his other grandmother, Miss Chrishy. Donald reproduced with his essay a photograph of Miss Iris with a two-year-old Kamala on her knee. He recalled how\n\nwe drove up to Thatch Walk and worked our way, with lots of cuts and bruises, through the same cane fields where Miss Iris had run a thriving business in the “good ole days” of sugar and, a long time before, had probably been part of a slave plantation.\n\nThis locates a potential American president in the fields where some of her ancestors were enslaved to the brutal task of cutting cane.\n\nIn this other history, a name like Finegan loses the meaning it has for Biden: a sense of continuity, an uncomplicated connection to a genetic heritage. These Irish ancestors cannot be assumed to be what they are to Biden—heroic underdogs. Miss Chrishy was born Christiana Brown, and Donald Harris believes her to be a “descendant of Hamilton Brown.” Hamilton Brown, who owned a large number of slaves in Jamaica and fiercely opposed abolition, was also Irish, born in County Antrim. But unlike John F. Kennedy, Richard Nixon, Ronald Reagan, Biden, and even Barack Obama, all of whom engaged in the public ritual of visiting Ireland to celebrate their ancestral roots, Harris would probably not want to celebrate her distant Finegan and Brown cousins.\n\nThis is because Blackness is seldom a free choice. Speaking to the National Association of Black Journalists at the end of July, Trump claimed that Harris suddenly “became a Black person” and had previously been identifying only with her Indian heritage. “Is she Indian or is she Black? I respect either one but she obviously doesn’t because she was Indian all the way and then all of a sudden she became a Black person.” This was a lie—Harris has always identified as Black. But it also revealed a certain kind of truth about one of the ways racism operates: Trump’s attack on Harris was based on the assumption that she must be either Black or not Black.\n\nIt is easy for white Americans to pick an ethnicity—Biden could have decided to identify with his French or English, rather than his Irish, heritage. It is easy for white Americans to tell little lies about their ancestry. Trump himself has more than once falsely claimed that his father, Fred, who was born in New York, was in fact born in Germany: “My father is German, was German, born in a very wonderful place in Germany, so I have a very great feeling for Germany.” Fred Trump himself claimed for some years that he was Swedish. Harris, on the other hand, could not cherry-pick from among her complex origins. Her mother was indeed born in India and lived there until she was nineteen. Yet Gopalan understood that her girls were not going to be perceived in America as Brahmins. As Harris puts it in The Truths We Hold:\n\nMy mother understood very well that she was raising two black daughters. She knew that her adopted homeland would see Maya and me as black girls, and she was determined to make sure we would grow into confident, proud black women.\n\nThis is not a relishing of the openness of identity in America. It is something much more serious: an attempt to find the freedom within inevitability. Gopalan understood that her daughters could not escape the identity that a racist society would impose on them, including the history of enslavement that is part of their ancestry. What they could do is find the pride within that identity and embody the resistance that is the other side of that history.\n\nThey had to do this in an atmosphere of ferocious political engagement, in which these same questions of freedom and necessity were being hammered out within Black radicalism. Trump seeks to define Harris as a “radical left lunatic,” and there is no doubt that Republicans will delve into her parents’ political stances in the 1960s to find evidence for this characterization. But it is the exact opposite of the truth. The radical left is a huge influence on Harris—in the sense that she is part of a generational reaction against the revolutionary Black politics of the 1960s. She is a child of the revolution only in the sense that she grew up in its wreckage.\n\nThere is a figure in The Truths We Hold who is both named and not named, both intimately embraced and held at a distance. He is introduced as follows: Harris writes that San Francisco State University “had a student-run Experimental College, and in 1966, another of my mother’s dear friends, whom I knew as Uncle Aubrey, taught the college’s first-ever class in black studies.” We later learn that Aubrey’s aunt, Regina Shelton, was a “second mother” to Kamala and that “we shared a long-standing relationship of love, care, and connection” to this extended family. Uncle Aubrey is not given his full name, Aubrey LaBrie. Nor does Harris say much about his politics.\n\nIn 2019 Harris told Molly Ball of Time that she remembered coming “down the stairs of her childhood house in Berkeley to see FREE BOBBY carved in wet cement, after the Black Panther leader Bobby Seale was arrested.” Her childhood world was that from which the Panthers emerged. In 1965 LaBrie, along with his brothers Huey and Abdul and other friends, founded a periodical called Black Dialogue. It was in part a cultural magazine, publishing stories, poems, and essays alongside graphic art by young Black painters. But it was also highly political, and Aubrey is listed as its “political editor,” presumably responsible for its ideological direction. Its first issue appeared in the aftermath of the murder of Malcolm X and is “proudly dedicated” to his memory as a “great leader and a greater MAN .”\n\nIt was also produced immediately after the brutal police assault on peaceful civil rights marchers at Selma. It seethes with both the passion and the anguish of uncertainty that so many young Black activists felt in the face of such loss and violence. It despairs of the possibilities of looking to the two spheres that Kamala Harris would go on to inhabit—the law and democratic politics—to win justice:\n\nThe Black Americans are nauseated by the practices of the White community that are, to them, mockingly meaningless, hypocritical, dishonest and essentially amoral. These young Black people have no faith in the Constitution and no respect for the White man’s law. Why should they? What has it done for them? The law is dispensed in a manner which makes it a great big atrocious lie. It is merely another weapon to use against them.\n\nAfter the Watts riots in Los Angeles in August 1965, when South Central LA became a combat zone and thirty-four people died, Black Dialogue published a call to arms by Aubrey LaBrie’s younger brother Huey:\n\nMy beloved brothers and sisters of Watts, how proud we are of you. You who burned the city of angels and shook the crumbling white power structure…. The enemy called it a riot but we know that it was an insurrection. It was one battle in the “war of Armageddon” or the war between the black and white. The blacks who participated in the insurrection introduced an extremely effective tactic of igniting fires to local parasitical white business communities. They were not rioters or hoodlums, they were guerrillas.\n\nThere is an irony here. The “war of Armageddon,” as invoked in Black Dialogue, was almost certainly drawn from the preaching of Louis Farrakhan and the Nation of Islam. But it now has no purchase on the American left or on mainstream Black politics. Where it does have a strong grip is on the dark imagination of Trumpism. The insurrectionist violence that Trump unleashed with the invasion of the Capitol on January 6, 2021, was fed by the millenarian vision of a coming civil war, framed by many of its believers as a racial “war between the black and white.” The Republican Party has moved into the orbit of apocalyptic tribalism. If you want to see a figure who represents the most definitive movement out of that orbit, look at Harris.\n\nHarris told Ball in 2019 that “the reality is that when you are the so-called minority you learn many languages, necessarily.” She did not mean literal languages but rather the languages of power. Harris entered the very arenas her mother’s friends and political allies had despaired of: the law, party politics, elective public office. She chose to believe what the previous generation could not—that justice can be achieved by working from inside the existing institutional structures. It is an act of faith that critics of her work as a prosecutor and attorney general in California do not believe to be justified in practice by the way she used her power. She sought to uphold some wrongful convictions, threatened to prosecute parents of habitually truant children (a policy that disproportionately affected people of color), and even appealed a federal court ruling that California’s death penalty is unconstitutional (in spite of her own complete repudiation of the death penalty). But her caution is not mere moderation or bland centrism. It comes from a complex personal and political navigation between the desire for freedom on the one side and the tight constraints of reality on the other.\n\nThat weighing of what is right against what is possible is the business of democracy, and Harris represents the way the left has accepted that difficult responsibility. American politics has ended up in a place where it is those on the right who want to burn everything down. They will do that, if they can, in the name of a phony American normality that excludes Harris and everyone who shares with her a complex identity. It is striking, therefore, that Harris’s candidacy has given Democrats permission to point out how “weird” the Republicans’ version of America really is. Walz put the word into circulation just days after Biden announced his departure from the national stage. In a punchy statement after Trump appeared on Fox News, the Harris campaign listed as one of the main takeaways: “Trump is old and quite weird?” The conjunction of these two qualities implies that what is truly strange is not just Trump’s chronological age but the anachronistic vision in which only white men who plant their seed in fertile women are authentic citizens and legitimate rulers. Against that weirdness, we have the real possibility of a president whose history is synchronized with American reality.\n\n—August 20, 2024"
        }
    },
    "2024-08-30": {}
}